{
  "Apple Juice (1000ml)": "Apfelsaft (1000ml)",
  "The all-time classic.": "Der Allzeitklassiker.",
  "Apple Pomace": "Apfeltrester",
  "Finest pressings of apples. Allergy disclaimer: Might contain traces of worms. Can be <a href=\"/#recycle\">sent back to us</a> for recycling.": "Feinste ausgepresste Äpfel. Allergiehinweis: Kann Spuren von Würmern enthalten. Kann zum Recycling <a href=\"/#recycle\">an uns zurück geschickt</a> werden.",
  "Banana Juice (1000ml)": "Bananensaft (1000ml)",
  "Monkeys love it the most.": "Affen lieben ihn am meisten.",
  "Best Juice Shop Salesman Artwork": "Bester Juice Shop-Verkäufer Kunstwerk",
  "Unique digital painting depicting Stan, our most qualified and almost profitable salesman. He made a succesful carreer in selling used ships, coffins, krypts, crosses, real estate, life insurance, restaurant supplies, voodoo enhanced asbestos and courtroom souvenirs before <em>finally</em> adding his expertise to the Juice Shop marketing team.": "Einzigartige digitale Zeichnung, die Stan, unseren qualifiziertesten und beinahe profitablen Verkäufer zeigt. Er machte erfolgreich Karriere als Verkäufer von gebrauchten Schiffen, Särgen, Krypten, Kreuzen, Immobilien, Lebensversicherungen, Restaurant-Zubehör, Voodoo-verbessertem Asbest und Gerichtssaal-Souvenirs, bevor er <em>endlich</em> seine Expertise dem Marketing-Team des Juice Shop hinzufügte.",
  "Carrot Juice (1000ml)": "Karottensaft (1000ml)",
  "As the old German saying goes: \"Carrots are good for the eyes. Or has anyone ever seen a rabbit with glasses?\"": "Wie das alte deutsche Sprichwort sagt: \"Karotten sind gut für die Augen. Oder hat irgendwer jemals einen Hasen mit Brille gesehen?\"",
  "Eggfruit Juice (500ml)": "Canistelsaft (500ml)",
  "Now with even more exotic flavour.": "Jetzt mit noch exotischerem Geschmack.",
  "Fruit Press": "Saftpresse",
  "Fruits go in. Juice comes out. Pomace you can send back to us for recycling purposes.": "Obst kommt rein. Saft kommt raus. Trester kann zwecks Recycling an uns zurückgeschickt werden.",
  "Green Smoothie": "Grüner Smoothie",
  "Looks poisonous but is actually very good for your health! Made from green cabbage, spinach, kiwi and grass.": "Sieht giftig aus, aber ist wirklich sehr gut für deine Gesundheit! Aus Grünkohl, Spinat, Kiwi und Gras.",
  "Juice Shop \"Permafrost\" 2020 Edition": "Juice Shop \"Permafrost\" 2020-Ausgabe",
  "Exact version of <a href=\"https://github.com/juice-shop/juice-shop/releases/tag/v9.3.1-PERMAFROST\">OWASP Juice Shop that was archived on 02/02/2020</a> by the GitHub Archive Program and ultimately went into the <a href=\"https://github.blog/2020-07-16-github-archive-program-the-journey-of-the-worlds-open-source-code-to-the-arctic\">Arctic Code Vault</a> on July 8. 2020 where it will be safely stored for at least 1000 years.": "Exakte Version von <a href=\"https://github.com/juice-shop/juice-shop/releases/tag/v9.3.1-PERMAFROST\">OWASP Juice Shop, die am 02.02.2020</a> vom GitHub Archive Program archiviert wurde und am 8. Juli 2020 in den <a href=\"https://github.blog/2020-07-16-github-archive-program-the-journey-of-the-worlds-open-source-code-to-the-arctic\">Arctic Code Vault</a> ging, wo sie sicher für mindestens 1000 Jahre gelagert wird.",
  "Lemon Juice (500ml)": "Zitronensaft (500ml)",
  "Sour but full of vitamins.": "Sauer, aber voller Vitamine.",
  "Melon Bike (Comeback-Product 2018 Edition)": "Melonenfahrrad (Comeback-Artikel 2018 Auflage)",
  "The wheels of this bicycle are made from real water melons. You might not want to ride it up/down the curb too hard.": "Die Räder dieses Fahrrads werden aus echten Wassermelonen hergestellt. Du solltest es vielleicht nicht zu doll den Kantstein rauf/runter fahren.",
  "OWASP Juice Shop \"King of the Hill\" Facemask": "OWASP Juice Shop \"König des Hügels\"-Gesichtsmaske",
  "Facemask with compartment for filter from 50% cotton and 50% polyester.": "Gesichtsmaske mit Fach für Filter aus 50% Baumwolle und 50% Polyester.",
  "OWASP Juice Shop CTF Girlie-Shirt": "OWASP Juice Shop CTF Girlie-Shirt",
  "For serious Capture-the-Flag heroines only!": "Nur für waschechte Capture-the-Flag-Heldinnen!",
  "OWASP Juice Shop Card (non-foil)": "OWASP Juice Shop Karte (nicht foliert)",
  "Mythic rare <small><em>(obviously...)</em></small> card \"OWASP Juice Shop\" with three distinctly useful abilities. Alpha printing, mint condition. A true collectors piece to own!": "Mythische seltene <small><em>(natürlich...)</em></small> Karte \"OWASP Juice Shop\" mit drei eigenständig nützlichen Fähigkeiten. Alpha-Druck, ungebrauchter Zustand. Ein wahrlich besitzenswertes Sammlerstück!",
  "OWASP Juice Shop Coaster (10pcs)": "OWASP Juice Shop Bierdeckel (10 Stk.)",
  "Our 95mm circle coasters are printed in full color and made from thick, premium coaster board.": "Unsere runden 95mm Bierdeckel werden in Vollfarbe gedruckt und bestehen aus dicker Premium-Untersetzer-Pappe.",
  "OWASP Juice Shop Holographic Sticker": "OWASP Juice Shop Holografischer Aufkleber",
  "Die-cut holographic sticker. Stand out from those 08/15-sticker-covered laptops with this shiny beacon of 80's coolness!": "Gestanzte holgrafische Aufkleber. Hebe dich mit diesem glänzenden Leuchtfeuer aus 80er-Jahre-Coolness von den mit 08/15-Aufklebern zugekleisterten Laptops ab!",
  "OWASP Juice Shop Hoodie": "OWASP Juice Shop Kaputzenpulli",
  "Mr. Robot-style apparel. But in black. And with logo.": "Kleidung im Mr. Robot-Stil. Bloß in schwarz. Und mit Logo.",
  "OWASP Juice Shop Iron-Ons (16pcs)": "OWASP Juice Shop Bügelbilder (16 Stk.)",
  "Upgrade your clothes with washer safe <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">iron-ons</a> of the OWASP Juice Shop or CTF Extension logo!": "Verbessere deine Kleidung mit den waschmaschinenfesten <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">Bügelbildern</a> mit OWASP Juice Shop- oder CTF-Erweiterungs-Logo!",
  "OWASP Juice Shop LEGO™ Tower": "OWASP Juice Shop LEGO™-Turm",
  "Want to host a Juice Shop CTF in style? Build <a href=\"https://github.com/OWASP/owasp-swag/blob/master/projects/juice-shop/lego/OWASP%20JuiceShop%20Pi-server%201.2.pdf\" target=\"_blank\">your own LEGO™ tower</a> which holds four Raspberry Pi 4 models with PoE HAT modules <a href=\"https://github.com/juice-shop/multi-juicer/blob/main/guides/raspberry-pi/raspberry-pi.md\" target=\"_blank\">running a MultiJuicer Kubernetes cluster</a>! Wire to a switch and connect to your network to have an out-of-the-box ready CTF up in no time!": "Want to host a Juice Shop CTF in style? Build <a href=\"https://github.com/OWASP/owasp-swag/blob/master/projects/juice-shop/lego/OWASP%20JuiceShop%20Pi-server%201.2.pdf\" target=\"_blank\">your own LEGO™ tower</a> which holds four Raspberry Pi 4 models with PoE HAT modules <a href=\"https://github.com/juice-shop/multi-juicer/blob/main/guides/raspberry-pi/raspberry-pi.md\" target=\"_blank\">running a MultiJuicer Kubernetes cluster</a>! Wire to a switch and connect to your network to have an out-of-the-box ready CTF up in no time!",
  "OWASP Juice Shop Logo (3D-printed)": "OWASP Juice Shop Logo (3D-gedruckt)",
  "This rare item was designed and handcrafted in Sweden. This is why it is so incredibly expensive despite its complete lack of purpose.": "Dieses seltene Stück wurde in Schweden entworfen und handgefertigt. Deshalb ist es trotz seines vollständigen Mangels an Nutzen so unglaublich teuer.",
  "OWASP Juice Shop Magnets (16pcs)": "OWASP Juice Shop Magnete (16 Stk.)",
  "Your fridge will be even cooler with these OWASP Juice Shop or CTF Extension logo <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">magnets</a>!": "Dein Kühlschrank wird mit diesen OWASP Juice Shop oder CTF Extension Logo <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">Magneten</a> sogar noch cooler sein!",
  "OWASP Juice Shop Mug": "OWASP Juice Shop Becher",
  "Black mug with regular logo on one side and CTF logo on the other! Your colleagues will envy you!": "Schwarzer Becher mit regulärem Logo auf der einen und CTF-Logo auf der anderen Seite. Deine Kollegen werden dich beneiden!",
  "OWASP Juice Shop Sticker Page": "OWASP Juice Shop Aufkleberbogen",
  "Massive decoration opportunities with these OWASP Juice Shop or CTF Extension <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">sticker pages</a>! Each page has 16 stickers on it.": "Massive Dekorationsmöglichkeiten mit diesen OWASP Juice Shop- oder CTF-Erweiterungs-<a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">Stickerbögen</a>! Jeder Bogen hat 16 Aufkleber.",
  "OWASP Juice Shop Sticker Single": "OWASP Juice Shop Einzel-Aufkleber",
  "Super high-quality vinyl <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">sticker single</a> with the OWASP Juice Shop or CTF Extension logo! The ultimate laptop decal!": "Super-hochwertige Vinyl-<a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">Einzelaufkleber</a> mit dem OWASP Juice Shop- oder CTF-Erweiterungs-Logo! Die ultimative Laptop-Deko!",
  "OWASP Juice Shop T-Shirt": "OWASP Juice Shop T-Shirt",
  "Real fans wear it 24/7!": "Echte Fans tragen es 24/7!",
  "OWASP Juice Shop Temporary Tattoos (16pcs)": "OWASP Juice Shop Klebetattoos (16 Stk.)",
  "Get one of these <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">temporary tattoos</a> to proudly wear the OWASP Juice Shop or CTF Extension logo on your skin! If you tweet a photo of yourself with the tattoo, you get a couple of our stickers for free! Please mention <a href=\"https://twitter.com/owasp_juiceshop\" target=\"_blank\"><code>@owasp_juiceshop</code></a> in your tweet!": "Hol dir eines dieser <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">Abzieh-Tattoos</a>, um das OWASP Juice Shop- oder CTF-Erweiterungs-Logo stolz auf deiner Haut zu tragen! Wenn du ein Foto von dir mit dem Tattoo twitterst, bekommst du einige Aufkleber gratis! Bitte erwähne <a href=\"https://twitter.com/owasp_juiceshop\" target=\"_blank\"><code>@owasp_juiceshop</code></a> in deinem Tweet!",
  "OWASP Juice Shop-CTF Velcro Patch": "OWASP Juice Shop-CTF Klett-Aufnäher",
  "4x3.5\" embroidered patch with velcro backside. The ultimate decal for every tactical bag or backpack!": "10x9cm gestickter Aufnäher mit Klett-Rückseite. Das ultimative Dekor für jede(n) taktische Tasche oder Rucksack!",
  "OWASP SSL Advanced Forensic Tool (O-Saft)": "OWASP SSL Advanced Forensic Tool (O-Saft)",
  "O-Saft is an easy to use tool to show information about SSL certificate and tests the SSL connection according given list of ciphers and various SSL configurations. <a href=\"https://www.owasp.org/index.php/O-Saft\" target=\"_blank\">More...</a>": "O-Saft ist ein Programm, um einfach das Zertifakt und sonstige Informationen einer SSL-Verbindung zu überprüfen. <a href=\"https://www.owasp.org/index.php/O-Saft\" target=\"_blank\">Mehr...</a>",
  "OWASP Snakes and Ladders - Mobile Apps": "OWASP Schlangen und Leitern - Mobile Anwendungen",
  "This amazing mobile app security awareness board game is <a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1970691216\">available for Tabletop Simulator on Steam Workshop</a> now!": "Dieses fantastische Brettspiel für Sicherheitsbewusstsein bei mobilen Anwendungen ist jetzt <a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1970691216\">für Tabletop Simulator im Steam Workshop erhältlich</a>!",
  "OWASP Snakes and Ladders - Web Applications": "OWASP Schlangen und Leitern - Web-Anwendungen",
  "This amazing web application security awareness board game is <a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1969196030\">available for Tabletop Simulator on Steam Workshop</a> now!": "Dieses fantastische Brettspiel für Sicherheitsbewusstsein bei Webanwendungen ist jetzt <a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1969196030\">für Tabletop Simulator im Steam Workshop erhältlich</a>!",
  "Orange Juice (1000ml)": "Orangensaft (1000ml)",
  "Made from oranges hand-picked by Uncle Dittmeyer.": "Aus Orangen, die von Onkel Dittmeyer handverlesen wurden.",
  "Pwning OWASP Juice Shop": "Pwning OWASP Juice Shop",
  "<em>The official Companion Guide</em> by Björn Kimminich available <a href=\"https://leanpub.com/juice-shop\">for free on LeanPub</a> and also <a href=\"https://pwning.owasp-juice.shop\">readable online</a>!": "<em>Der offizielle Begleitführer</em> von Björn Kimminich ist <a href=\"https://leanpub.com/juice-shop\">kostenlos auf LeanPub</a> erhältlich und auch <a href=\"https://pwning.owasp-juice.shop\">zum online Lesen</a> verfügbar!",
  "Quince Juice (1000ml)": "Quittensaft (1000ml)",
  "Juice of the <em>Cydonia oblonga</em> fruit. Not exactly sweet but rich in Vitamin C.": "Saft aus der <em>Cydonia oblonga</em>-Frucht. Nicht wirklich süß, aber reich an Vitamin C.",
  "Raspberry Juice (1000ml)": "Himbeersaft (1000ml)",
  "Made from blended Raspberry Pi, water and sugar.": "Aus püriertem Raspberry Pi, Wasser und Zucker.",
  "Strawberry Juice (500ml)": "Erdbeersaft (500ml)",
  "Sweet & tasty!": "Süß & lecker!",
  "Woodruff Syrup \"Forest Master X-Treme\"": "Waldmeister-Sirup \"Forest Master X-Treme\"",
  "Harvested and manufactured in the Black Forest, Germany. Can cause hyperactive behavior in children. Can cause permanent green tongue when consumed undiluted.": "Geerntet und verarbeitet im Schwarzwald, Deutschland. Kann hyperaktives Verhalten bei Kindern verursachen. Kann bei unverdünntem Konsum dauerhaft grüne Zunge verursachen.",
  "Find the carefully hidden 'Score Board' page.": "Finde die sorgfältig versteckte 'Punkteübersicht'-Seite.",
  "Try to find a reference or clue behind the scenes. Or simply guess what URL the Score Board might have.": "Versuche, eine Referenz oder einen Hinweis hinter den Kulissen zu finden. Oder errate einfach, welche URL die Punkteübersicht wohl haben könnte.",
  "Perform a <i>persisted</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> without using the frontend application at all.": "Führe einen <i>persistenten</i> XSS-Angriff mit <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> aus, ohne überhaupt das Anwendungs-Frontend zu verwenden.",
  "You need to work with the server-side API directly. Try different HTTP verbs on different entities exposed through the API.": "Du musst direkt mit der serverseitigen API arbeiten. Versuche unterschiedliche HTTP-Verben bei verschiedenen durch die API exponierten Entitäten.",
  "Gain access to any access log file of the server.": "Erhalte Zugriff auf irgendeine Log-Datei des Servers.",
  "Who would want a server access log to be accessible through a web application?": "Wer würde wollen, dass ein Server-Access-Log durch eine Webanwendung zugreifbar ist?",
  "Register as a user with administrator privileges.": "Registriere dich als Benutzer mit Administratorrechten.",
  "You have to assign the unassignable.": "Du musst das Unzuweisbare zuweisen.",
  "Access the administration section of the store.": "Greife auf den Administrationsbereich des Ladens zu.",
  "It is just slightly harder to find than the score board link.": "Es ist nur geringfügig schwerer zu finden als der Link zur Punkteübersicht.",
  "Overwrite the <a href=\"/ftp/legal.md\">Legal Information</a> file.": "Überschreibe die Datei mit den <a href=\"/ftp/legal.md\">rechtlichen Informationen</a>.",
  "Look out for a tweet praising new functionality of the web shop. Then find a third party vulnerability associated with it.": "Halte Ausschau nach einem Tweet, der neue Funktionalität des Webshops bewirbt. Finde dann eine hiermit verbundene Drittanbieter-Verwundbarkeit.",
  "Reset the password of Bjoern's OWASP account via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "Setze das Passwort von Björns OWASP-Benutzerkonto in der <a href=\"/#/forgot-password\">Passwort vergessen</a>-Funktion mittels der <i>Original-Antwort</i> auf seine Sicherheitsfrage zurück.",
  "Hints to the answer to Bjoern’s question can be found by looking him up on the Internet.": "Hinweise auf die Antwort auf Björns Frage, findest du, indem du nach ihm im Internet suchst.",
  "Learn about the Token Sale before its official announcement.": "Erfahre vor der offiziellen Ankündigung von dem Token-Verkauf.",
  "The developers truly believe in \"Security through Obscurity\" over actual access restrictions.": "Die Entwickler glauben wirklich mehr an \"Sicherheit durch Obskurität\" als an tatsächliche Zugriffsbeschränkungen.",
  "Take over the wallet containing our official Soul Bound Token (NFT).": "Nimm die Brieftasche mit unserem offiziellen Soul Bound Token (NFT) in Besitz.",
  "Find the seed phrase posted accidentally.": "Finde die versehentlich gepostete Seed-Phrase.",
  "Mint the Honey Pot NFT by gathering BEEs from the bee haven.": "Präge das Honey-Pot-NFT indem du BEEs aus der Bienenzuflucht sammelst.",
  "Discover NFT wonders among the captivating visual memories.": "Entdecke NFT-Wunder zwischen den faszinierenden visuellen Erinnerungen.",
  "Withdraw more ETH from the new wallet than you deposited.": "Hebe mehr ETH von der neuen Brieftasche ab, als du hinterlegt hast.",
  "Try to exploit the contract of the wallet.": "Versuche, den Contract der Brieftasche auszunutzen.",
  "Find an accidentally deployed code sandbox for writing smart contracts on the fly.": "Finde eine versehentlich ausgelieferte Programmier-Sandbox zum spontanen Schreiben von Smart Contracts.",
  "It is just as easy as finding the Score Board.": "Es ist genauso einfach wie die Punkteübersicht zu finden.",
  "Perform a Remote Code Execution that would keep a less hardened application busy <em>forever</em>.": "Führe eine Remote Code Execution durch, die eine weniger gehärtete Anwendung <em>für immer</em> beschäftigen würde.",
  "The feature you need to exploit for this challenge is not directly advertised anywhere.": "Die Funktionalität, die du für diese Herausforderung ausnutzen musst, wird nirgendwo direkt beworben.",
  "Submit 10 or more customer feedbacks within 20 seconds.": "Schicke 10 oder mehr Kundenfeedbacks innerhalb von 20 Sekunden ab.",
  "After finding a CAPTCHA bypass, write a script that automates feedback submission. Or open many browser tabs and be really quick.": "Nachdem du eine Umgehung des CAPTCHA gefunden hast, schreibe ein Skript, das die Feedback-Einreichung automatisiert. Oder öffne viele Browser-Tabs und sei wirklich schnell.",
  "Change Bender's password into <i>slurmCl4ssic</i> without using SQL Injection or Forgot Password.": "Ändere Benders Passwort in <i>slurmCl4ssic</i> ohne Zuhilfenahme von SQL Injection oder Passwort vergessen.",
  "In previous releases this challenge was wrongly accused of being based on CSRF.": "In früheren Releases wurde diese Herausforderung fälschlicherweise beschuldigt, auf CSRF zu basieren.",
  "Order the Christmas special offer of 2014.": "Bestelle das Weihnachts-Sonderangebot von 2014.",
  "Find out how the application handles unavailable products and try to find a loophole.": "Finde heraus, wie die Anwendung nicht verfügbare Produkte behandelt, und versuche dann ein Schlupfloch zu finden.",
  "Bypass the Content Security Policy and perform an XSS attack with <code>&lt;script&gt;alert(`xss`)&lt;/script&gt;</code> on a legacy page within the application.": "Umgehe die Content Security Policy und führe einen XSS-Angriff mit <code>&lt;script&gt;alert(`xss`)&lt;/script&gt;</code> auf einer Legacy-Seite innerhalb der Anwendung aus.",
  "What is even \"better\" than a legacy page with a homegrown RegEx sanitizer? Having CSP injection issues on the exact same page as well!": "Was ist noch \"besser\" als eine veraltete Seite mit einem eigenen RegEx-Sanitizer? Auch ein Problem mit CSP-Injection auf genau derselben Seite zu haben!",
  "Perform a <i>persisted</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> bypassing a <i>client-side</i> security mechanism.": "Führe einen <i>persistenten</i> XSS-Angriff mit <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> aus und umgehe dabei einen <i>Client-seitigen</i> Sicherheitsmechanismus.",
  "There are only some input fields in the Juice Shop forms that validate their input.": "There are only some input fields in the Juice Shop forms that validate their input.",
  "Access a confidential document.": "Greife auf ein vertrauliches Dokument zu.",
  "Analyze and tamper with links in the application that deliver a file directly.": "Analysiere und manipuliere Links in der Anwendung, welche direkt eine Datei zurückliefern.",
  "Perform a <i>DOM</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code>.": "Führe einen <i>DOM</i> XSS-Angriff mit <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> aus.",
  "Look for an input field where its content appears in the HTML when its form is submitted.": "Halt Ausschau nach einem Eingabefeld, dessen Inhalt im HTML erscheint, wenn das Formular abgeschickt wird.",
  "Exfiltrate the entire DB schema definition via SQL Injection.": "Schleuse die gesamte Schemadefinition mittels SQL Injection aus der DB.",
  "Find out where this information could come from. Then craft an attack string against an endpoint that offers an unnecessary way to filter data.": "Find out where this information could come from. Then craft an attack string against an endpoint that offers an unnecessary way to filter data.",
  "Use a deprecated B2B interface that was not properly shut down.": "Benutze eine veraltete B2B-Schnittstelle, die nicht ordentlich abgeschaltet wurde.",
  "The developers who disabled the interface think they could go invisible by just closing their eyes.": "Die Entwickler, die diese Schnittstelle deaktiviert haben, glauben, sie könnten nur durch das Schließen ihrer Augen unsichtbar werden.",
  "Find the hidden <a href=\"https://en.wikipedia.org/wiki/Easter_egg_(media)\" target=\"_blank\">easter egg</a>.": "Finde das versteckte <a href=\"https://en.wikipedia.org/wiki/Easter_egg_(media)\" target=\"_blank\">Ostereier</a>.",
  "If you solved one of the four file access challenges, you already know where to find the easter egg.": "If you solved one of the four file access challenges, you already know where to find the easter egg.",
  "Perform an unwanted information disclosure by accessing data cross-domain.": "Führe Sie eine ungewollte Informationsoffenlegung mittels eines Cross-Domain-Datenzugriffs durch.",
  "Try to find and attack an endpoint that responds with user information. SQL Injection is not the solution here.": "Versuche, einen Endpunkt zu finden und anzugreifen, der mit Benutzerinformationen antwortet. SQL Injection ist hier nicht die Lösung.",
  "Register a user with an empty email and password.": "Registriere einen Benutzer mit leerer E-Mail und leerem Passwort.",
  "Consider intercepting and playing with the request payload.": "Erwäge das Abfangen von und Herumspielen mit dem Request-Payload.",
  "Log in with the (non-existing) accountant <i>acc0unt4nt@juice-sh.op</i> without ever registering that user.": "Melde dich mit dem (nicht existierenden) Buchhalter <i>acc0unt4nt@juice-sh.op</i> an, ohne diesen Benutzer jemals zu registrieren.",
  "Try to create the needed user \"out of thin air\".": "Versuche, den benötigten Benutzer \"aus dem Nichts\" zu erstellen.",
  "Provoke an error that is neither very gracefully nor consistently handled.": "Provoziere einen Fehler, der weder elegant noch stimmig behandelt wird.",
  "Try to submit bad input to forms. Alternatively tamper with URL paths or parameters.": "Versuche, böse Eingaben an Formulare zu senden. Manipuliere alternativ an URL-Pfaden oder -Parametern herum.",
  "Successfully redeem an expired campaign coupon code.": "Löse erfolgreich einen abgelaufenen Kampagnen-Gutscheincode ein.",
  "Try to identify past special event or holiday campaigns of the shop first.": "Versuche zunächst, eine vergangene Sonderveranstaltung oder Feiertags-Kampagne des Ladens zu identifizieren.",
  "First you should find out how the languages are technically changed in the user interface.": "First you should find out how the languages are technically changed in the user interface.",
  "Brute force is not the only option for this challenge, but a perfectly viable one.": "Brute Force ist nicht die einzige Option für diese Herausforderung, aber eine durchaus brauchbare.",
  "Get rid of all 5-star customer feedback.": "Werde alle 5-Sterne Kundenfeedbacks los.",
  "Once you found admin section of the application, this challenge is almost trivial.": "Sobald du den Admin-Bereich der Anwendung gefunden hast, ist diese Herausforderung fast trivial.",
  "Forge a coupon code that gives you a discount of at least 80%.": "Fäslche einen Gutscheincode, der dir mindestens 80% Rabatt gewährt.",
  "Try either a) a knowledgeable brute force attack or b) reverse engineering or c) some research in the cloud.": "Versuche entweder a) einen klugen Brute-Force-Angriff oder b) Reverse Engineering oder c) einige Nachforschungen in der Cloud.",
  "Post some feedback in another user's name.": "Schreibe ein Feedback im Namen eines anderen Benutzers.",
  "You can solve this by tampering with the user interface or by intercepting the communication with the RESTful backend.": "Du kannst diese lösen, indem du an der Benutzeroberfläche herumdokterst oder die Kommunikation mit dem RESTful Backend abfängst.",
  "Post a product review as another user or edit any user's existing review.": "Veröffentliche eine Produktrezension als ein anderer Benutzer oder bearbeite die bestehende Rezension eines anderen Benutzers.",
  "Observe the flow of product review posting and editing and see if you can exploit it.": "Beobachte den Ablauf des Veröffentlichens und Bearbeitens von Produktrezensionen, und schau ob du dir dieses zunutze machen kannst.",
  "Forge an almost properly RSA-signed JWT token that impersonates the (non-existing) user <i>rsa_lord@juice-sh.op</i>.": "Fälsche ein beinahe ordnungsgemäß RSA-signiertes JWT-Token, das sich als der (nicht existierende) Benutzer <i>rsa_lord@juice-sh.op</i> ausgibt.",
  " <em>(This challenge is <strong>potentially harmful</strong> on Windows!)</em>": " <em>(This challenge is <strong>potentially harmful</strong> on Windows!)</em>",
  "This challenge is explicitly not about acquiring the RSA private key used for JWT signing.": "Bei dieser Herausforderung geht es ausdrücklich nicht darum, den zum JWT-Signieren verwendeten privaten RSA-Schlüssel zu beschaffen.",
  "Access a developer's forgotten backup file.": "Greife auf die vergessene Sicherungskopie einer Datei eines Entwicklers zu.",
  "You need to trick a security mechanism into thinking that the file you want has a valid file type.": "Du musst einem Sicherheitsmechanismus vorgaukeln, dass die von dir gewünschte Datei einen gültigen Dateityp hat.",
  "Access a salesman's forgotten backup file.": "Greife auf die vergessene Sicherungskopie einer Datei eines Vertrieblers zu.",
  "<a href=\"/#/contact\">Inform the shop</a> about a <i>typosquatting</i> imposter that dug itself deep into the frontend. (Mention the exact name of the culprit)": "<a href=\"/#/contact\">Informiere den Laden</a> über einen <i>Typosquatting</i>-Hochstapler, der sich tief ins Frontend eingegraben hat. (Nenne den genauen Namen des Übeltäters)",
  "This challenge has nothing to do with mistyping web domains. There is no conveniently misplaced file helping you with this one either. Or is there?": "Diese Herausforderung hat nichts damit zu tun, sich bei Web-Domains zu vertippen. Auch gibt es keine zweckdienlich falsch abgelegte Datei, die dir hierbei helfen würde. Oder vielleicht doch?",
  "Log in with Chris' erased user account.": "Melde dich mit dem gelöschten Benutzerkonto von Chris an.",
  "Turns out that something is technically and legally wrong with the implementation of the \"right to be forgotten\" for users.": "Es stellt sich heraus, dass bei der Umsetzung des \"Rechts auf Vergessen\" für Benutzer technisch und rechtlich etwas schief gelaufen ist.",
  "Steal someone else's personal data without using Injection.": "Stiehl die personenbezogenen Daten von jemand anderem ohne Injection zu verwenden.",
  "Trick the regular Data Export to give you more than actually belongs to you.": "Bringe den normalen Datenexport dazu, dir mehr zu geben als dir eigentlich gehört.",
  "Perform a <i>persisted</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> through an HTTP header.": "Führe einen <i>persistenten</i> XSS-Angriff mit <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> durch einen HTTP-Header aus.",
  "Finding a piece of displayed information that could originate from an HTTP header is part of this challenge.": "Das Auffinden einer Information, die aus einem HTTP-Header stammen könnte, ist Teil dieser Herausforderung.",
  "Solve challenge #999. Unfortunately, this challenge does not exist.": "Löse Herausforderung #999. Leider existiert diese Herausforderung nicht.",
  "You need to trick the hacking progress persistence feature into thinking you solved challenge #999.": "Du musst die Hacking-Fortschrittsspeicherung in den Glauben versetzen, dass du Herausforderung #999 gelöst hättest.",
  "Dumpster dive the Internet for a leaked password and log in to the original user account it belongs to. (Creating a new account with the same password does not qualify as a solution.)": "Du musst im Internet nach einem durchgesickerten Passwort containern und dich dann mit dem Benutzerkonto, zu dem es gehört, anmelden. (Ein neues Benutzerkonto mit demselben Passwort anzulegen ist keine gültige Lösung.)",
  "As the challenge name implies, your task is to find some leaked access logs which happen to have a fairly common format.": "As the challenge name implies, your task is to find some leaked access logs which happen to have a fairly common format.",
  "Identify an unsafe product that was removed from the shop and <a href=\"/#/contact\">inform the shop</a> which ingredients are dangerous.": "Identifiziere ein unsicheres Produkt, das nicht mehr verfügbar ist, und <a href=\"/#/contact\">informiere den Laden</a> welches dessen gefährlichen Inhaltsstoffe sind.",
  "Your own SQLi and someone else's Ctrl-V will be your accomplices in this challenge!": "Dein eigenes SQLi und jemand anderes Strg-V werden bei dieser Herausforderung deine Komplizen sein!",
  "<a href=\"/#/contact\">Inform the shop</a> about a <i>typosquatting</i> trick it has been a victim of at least in <code>v6.2.0-SNAPSHOT</code>. (Mention the exact name of the culprit)": "<a href=\"/#/contact\">Informiere den Laden</a> über einen <i>Typosquatting</i>-Trick, dem er zumindest in <code>v6.2.0-SNAPSHOT</code> zum Opfer gefallen ist. (Nenne den exakten Namen des Übeltäters)",
  "This challenge has nothing to do with mistyping web domains. Investigate the forgotten developer's backup file instead.": "Diese Herausforderung hat nichts damit zu tun, sich beim beim Eingeben von Web-Domains zu vertippen. Untersuche stattdessen die vergessene Backup-Datei eines Entwicklers.",
  "Log in with the administrator's user account.": "Melde dich mit dem Benutzerkonto des Administrators an.",
  "The challenge description probably gave away what form you should attack.": "Die Beschreibung der Herausforderung hat wahrscheinlich verraten, welches Formular du angreifen solltest.",
  "Log in with Amy's original user credentials. (This could take 93.83 billion trillion trillion centuries to brute force, but luckily she did not read the \"One Important Final Note\")": "Melde dich mit Amys ursprünglichen Benutzerdaten an. (Ein Brute-Force-Angriff hierauf könnte 93,83 Milliarden Billionen Billionen Jahrhunderte dauern, aber glücklicherweise hat sie die \"One Important Final Note\" nicht gelesen)",
  "This challenge will make you go after a needle in a haystack.": "Diese Herausforderung lässt dich nach einer Nadel im Heuhaufen suchen.",
  "Log in with Bender's user account.": "Melde dich mit dem Benutzerkonto von Bender an.",
  "Log in with Bjoern's Gmail account <i>without</i> previously changing his password, applying SQL Injection, or hacking his Google account.": "Melde dich mit Björns Gmail-Benutzerkonto an, <i>ohne</i> zuvor sein Passwort zu ändern, SQL Injection anzuwenden oder sein Google-Konto zu hacken.",
  "The security flaw behind this challenge is 100% OWASP Juice Shop's fault and 0% Google's.": "Die Sicherheitslücke hinter dieser Herausforderung ist zu 100% die Schuld des OWASP Juice Shop und zu 0% die von Google.",
  "Log in with Jim's user account.": "Melde dich mit dem Benutzerkonto von Jim an.",
  "Log in with MC SafeSearch's original user credentials without applying SQL Injection or any other bypass.": "Melde dich mit MC SafeSearchs ursprünglichen Benutzerdaten an, ohne SQL Injection oder irgendeine andere Umgehung anzuwenden.",
  "MC SafeSearch is a rapper who produced the song \"Protect Ya' Passwordz\" which explains password & sensitive data protection very nicely.": "MC SafeSearch is a rapper who produced the song \"Protect Ya' Passwordz\" which explains password & sensitive data protection very nicely.",
  "Log in with the support team's original user credentials without applying SQL Injection or any other bypass.": "Melde dich mit den ursprünglichen Benutzerdaten des Support Teams an, ohne SQL Injection oder irgendeine andere Umgehung anzuwenden.",
  "The underlying flaw of this challenge is a lot more human error than technical weakness.": "Der zugrunde liegende Fehler bei dieser Herausforderung ist vielmehr menschliches Versagen als eine technische Schwäche.",
  "Put an additional product into another user's shopping basket.": "Lege ein weiteres Produkt in den Warenkorb eines anderen Benutzers.",
  "Have an eye on the HTTP traffic while placing products in the shopping basket.": "Beobachte den HTTP-Verkehr, während du Produkte in den Warenkorb legst.",
  "Access a misplaced <a href=\"https://github.com/Neo23x0/sigma\">SIEM signature</a> file.": "Greife auf eine falsch abgelegte <a href=\"https://github.com/Neo23x0/sigma\">SIEM-Signatur</a>-Datei zu.",
  "Like any review at least three times as the same user.": "Like eine Rezension mindestens dreimal mit demselben Benutzer.",
  "Punctuality is the politeness of kings.": "Pünktlichkeit ist die Höflichkeit der Könige.",
  "Apply some advanced cryptanalysis to find <i>the real</i> easter egg.": "Benutze einige fortgeschrittene Kryptoanalyse, um <i>das echte</i> Easter Egg zu finden.",
  "You might have to peel through several layers of tough-as-nails encryption for this challenge.": "Du musst dich für diese Herausforderung möglicherweise durch mehrere Schichten knallharter Verschlüsselung schälen.",
  "Let the server sleep for some time. (It has done more than enough hard work for you)": "Lass den Server für einige Zeit schlafen. (Er hat mehr als genug für dich geschuftet)",
  "This challenge is essentially a stripped-down Denial of Service (DoS) attack.": "Diese Herausforderung ist im Wesentlichen eine gekürzte Denial of Service (DoS)-Attacke.",
  "All your orders are belong to us! Even the ones which don't.": "All deine Bestellungen sind gehören uns! Selbst diejenigen, die nicht.",
  "Take a close look on how the $where query operator works in MongoDB.": "Schau dir genau an, wie der $where-Operator in MongoDB Abfragen funktioniert.",
  "Update multiple product reviews at the same time.": "Aktualisiere mehrere Produktrezensionen gleichzeitig.",
  "Take a close look on how the equivalent of UPDATE-statements in MongoDB work.": "Schau dir genau an, wie das Äquivalent einer UPDATE-Anwendung bei MongoDB funktioniert.",
  "Let us redirect you to one of our crypto currency addresses which are not promoted any longer.": "Lass dich von uns zu einer unserer nicht länger beworbenen Kryptowährungsadressen weiterleiten.",
  "When removing references to those addresses from the code the developers have been a bit sloppy.": "When removing references to those addresses from the code the developers have been a bit sloppy.",
  "Log in with the administrator's user credentials without previously changing them or applying SQL Injection.": "Melde dich mit den Benutzerdaten des Administrators an, ohne diese vorher zu verändern oder SQL Injection anzuwenden.",
  "This challenge can be solved with three different approaches.": "This challenge can be solved with three different approaches.",
  "Place an order that makes you rich.": "Gib eine Bestellung auf, die dich reich macht.",
  "You literally need to make the shop owe you any amount of money.": "Du musst buchstäblich dafür sorgen, dass der Laden dir einen beliebigen Geldbetrag schuldet.",
  "<i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><!--IvLuRfBJYlmStf9XfL6ckJFngyd9LfV1JaaN/KRTPQPidTuJ7FR+D/nkWJUF+0xUF07CeCeqYfxq+OJVVa0gNbqgYkUNvn//UbE7e95C+6e+7GtdpqJ8mqm4WcPvUGIUxmGLTTAC2+G9UuFCD1DUjg==--> <a href=\"https://blockchain.info/address/1AbKfgvw9psQ41NbLi8kufDQTezwG8DRZm\" target=\"_blank\"><i class=\"fab fa-btc fa-sm\"></i> Unlock Premium Challenge</a> to access exclusive content.": "<i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><!--IvLuRfBJYlmStf9XfL6ckJFngyd9LfV1JaaN/KRTPQPidTuJ7FR+D/nkWJUF+0xUF07CeCeqYfxq+OJVVa0gNbqgYkUNvn//UbE7e95C+6e+7GtdpqJ8mqm4WcPvUGIUxmGLTTAC2+G9UuFCD1DUjg==--> <a href=\"https://blockchain.info/address/1AbKfgvw9psQ41NbLi8kufDQTezwG8DRZm\" target=\"_blank\"><i class=\"fab fa-btc fa-sm\"></i> Schalte die Premium-Herausforderung frei</a>, um auf exklusive Inhalte zugreifen zu dürfen.",
  "You do not have to pay anything to unlock this challenge! Nonetheless, donations are very much appreciated.": "Du musst nichts bezahlen, um diese Herausforderung freizuschalten! Spenden sind nichtsdestotrotz sehr willkommen.",
  "Read our privacy policy.": "Lies unsere Datenschutzrichtlinie.",
  "We won't even ask you to confirm that you did. Just read it. Please. Pretty please.": "Wir werden dich nicht bitten, zu bestätigen, dass du es getan haben. Lies sie einfach. Bitte. Ach bitte, bitte.",
  "Prove that you actually read our privacy policy.": "Beweise, dass du unsere Datenschutzrichtlinie tatsächlich gelesen hast.",
  "Only by visiting a special URL you can confirm that you read it carefully.": "Nur indem du eine besondere URL besuchst, kannst du bestätigen, dass du sie sorgfältig gelesen hast.",
  "Change the <code>href</code> of the link within the <a href=\"/#/search?q=OWASP SSL Advanced Forensic Tool (O-Saft)\">OWASP SSL Advanced Forensic Tool (O-Saft)</a> product description into <i>https://owasp.slack.com</i>.": "Ändere das <code>href</code> des Links in der <a href=\"/#/search?q=OWASP SSL Advanced Forensic Tool (O-Saft)\">OWASP SSL Advanced Forensic Tool (O-Saft)</a>-Produktbeschreibung zu <i>https://owasp.slack.com</i>.",
  "Theoretically there are three possible ways to beat this challenge: a) broken admin functionality, b) holes in RESTful API or c) possibility for SQL Injection.": "Theoretically there are three possible ways to beat this challenge: a) broken admin functionality, b) holes in RESTful API or c) possibility for SQL Injection.",
  "Perform a <i>reflected</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code>.": "Führe einen <i>reflektierten</i> XSS-Angriff mit <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> aus.",
  "Look for a url parameter where its value appears in the page it is leading to.": "Halte Ausschau nach einem URL-Parameter, dessen Wert auf der Seite, zu der er führt, erscheint.",
  "Follow the DRY principle while registering a user.": "Befolge das DRY-Prinzip bei der Registrierung eines Benutzers.",
  "You can solve this by cleverly interacting with the UI or bypassing it altogether.": "Du kannst diese durch kluge Interaktion mit oder völliges Umgehen der Benutzeroberfläche lösen.",
  "Reset Bender's password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "Setze Benders Passwort in der <a href=\"/#/forgot-password\">Passwort vergessen</a>-Funktion mittels der <i>Original-Antwort</i> auf seine Sicherheitsfrage zurück.",
  "If you have no idea who Bender is, please put down this book right now and watch the first episodes of Futurama before you come back.": "If you have no idea who Bender is, please put down this book right now and watch the first episodes of Futurama before you come back.",
  "Reset the password of Bjoern's internal account via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "Setze das Passwort von Björns internem Benutzerkonto in der <a href=\"/#/forgot-password\">Passwort vergessen</a>-Funktion mittels der <i>Original-Antwort</i> auf seine Sicherheitsfrage zurück.",
  "Nothing a little bit of Facebook stalking couldn't reveal. Might involve a historical twist.": "Nichts, was ein bisschen Facebook-Stalking nicht offenbaren könnte. Könnte eine historische Wendung beinhalten.",
  "Reset Jim's password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "Setze Jims Passwort in der <a href=\"/#/forgot-password\">Passwort vergessen</a>-Funktion mittels der <i>Original-Antwort</i> auf seine Sicherheitsfrage zurück.",
  "The hardest part of this challenge is actually to find out who Jim actually is.": "The hardest part of this challenge is actually to find out who Jim actually is.",
  "Reset Morty's password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>his obfuscated answer</i> to his security question.": "Setze Mortys Passwort in der <a href=\"/#/forgot-password\">Passwort vergessen</a>-Funktion mittels <i>seiner obfuskierten Antwort</i> auf seine Sicherheitsfrage zurück.",
  "Finding out who Morty actually is, will help to reduce the solution space.": "Finding out who Morty actually is, will help to reduce the solution space.",
  "Deprive the shop of earnings by downloading the blueprint for one of its products.": "Beraube den Laden seiner Einnahmen, indem du die Blaupause für eines seiner Produkte herunterlädst.",
  "The product you might want to give a closer look is the OWASP Juice Shop Logo (3D-printed).": "Das Produkt, das Du dir vielleicht näher ansehen solltest, ist das OWASP Juice Shop Logo (3D-gedruckt).",
  "Request a hidden resource on server through server.": "Fordere eine versteckte Ressource über Server-zu-Server an.",
  "Reverse engineering something bad can make good things happen.": "Reverse-Engineering von etwas Schlechtem, kann gute Dinge geschehen lassen.",
  "Infect the server with juicy malware by abusing arbitrary command execution.": "Infiziere den Server mit saftiger Malware, indem du dir Arbitrary Command Execution zunutze machst.",
  "\"SSTi\" is a clear indicator that this has nothing to do with anything Angular. Also, make sure to use only our non-malicious malware.": "\"SSTi\" ist ein eindeutiger Indikator, dass dies nichts mit irgendwas in Angular zu tun hat. Achte darauf, nur unsere nicht-bösartige Malware zu verwenden.",
  "Behave like any \"white-hat\" should before getting into the action.": "Verhalte dich wie ein \"White-Hat\" es sollte, bevor du loslegst.",
  "This challenge asks you to act like an ethical hacker.": "Diese Herausforderung fordert dich auf, wie ein ethischer Hacker zu handeln.",
  "Perform a <i>persisted</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> bypassing a <i>server-side</i> security mechanism.": "Führe einen <i>persistenten</i> XSS-Angriff mit <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> aus und umgehe dabei einen <i>Server-seitigen</i> Sicherheitsmechanismus.",
  "The \"Comment\" field in the \"Customer Feedback\" screen is where you want to put your focus on.": "Du solltest deinen Fokus auf das Feld \"Kommentar\" im \"Kundenfeedback\"-Dialog setzen.",
  "<a href=\"/#/contact\">Rat out</a> a notorious character hiding in plain sight in the shop. (Mention the exact name of the character)": "<a href=\"/#/contact\">Verpetze</a> einen berüchtigten Charakter, der sich im Laden unsichtbar gemacht hat. (Erwähne den exakten Namen des Charakters)",
  "There is not the slightest chance that you can spot the hidden character with the naked eye.": "There is not the slightest chance that you can spot the hidden character with the naked eye.",
  "Perform a Remote Code Execution that occupies the server for a while without using infinite loops.": "Führe eine Remote Code Execution durch, die den Server, ohne Einsatz von Endlosschleifen, eine Weile beschäftigt.",
  "Your attack payload must not trigger the protection against too many iterations and infinite loops.": "Your attack payload must not trigger the protection against too many iterations and infinite loops.",
  "<a href=\"/#/contact\">Inform the development team</a> about a danger to some of <em>their</em> credentials. (Send them the URL of the <em>original report</em> or an assigned CVE or another identifier of this vulnerability)": "<a href=\"/#/contact\">Informiere das Entwicklungsteam</a> über eine Gefährdung einiger <em>ihrer</em> Anmeldedaten. (Sende ihnen die URL der <em>ursprünglichen Meldung</em> oder eine zugewiesene CVE oder andere Kennung dieser Verwundbarkeit)",
  "This vulnerability will not affect any customer of the shop. It is aimed exclusively at its developers.": "Diese Verwundbarkeit wird keinen einzigen Kunden des Ladens betreffen. Sie richtet sich ausschließlich gegen dessen Entwickler.",
  "Solve the 2FA challenge for user \"wurstbrot\". (Disabling, bypassing or overwriting his 2FA settings does not count as a solution)": "Löse die 2FA-Aufgabe für den Benutzer \"wurstbrot\". (Deaktivieren, Umgehen oder Überschreiben seiner 2FA-Einstellungen zählt nicht als Lösung)",
  "The 2FA implementation requires to store a secret for every user. You will need to find a way to access this secret in order to solve this challenge.": "Die 2FA-Implementierung erfordert, dass für jeden Benutzer ein Geheimnis gespeichert wird. Du musst einen Weg finden auf dieses Geheimnis zuzugreifen, um diese Herausforderung zu lösen.",
  "Forge an essentially unsigned JWT token that impersonates the (non-existing) user <i>jwtn3d@juice-sh.op</i>.": "Fälsche ein eigentlich unsigniertes JWT-Token, das sich als der (nicht existierende) Benutzer <i>jwtn3d@juice-sh.op</i> ausgibt.",
  "This challenge exploits a weird option that is supported when signing tokens with JWT.": "Diese Herausforderung nutzt eine seltsame Option aus, die beim Signieren von Tokens mit JWT unterstützt wird.",
  "Upload a file larger than 100 kB.": "Lade eine Datei größer als 100 kB hoch.",
  "You can attach a small file to the \"Complaint\" form. Investigate how this upload actually works.": "Du kannst eine kleine Datei an das \"Reklamation\"-Formular anhängen. Finde heraus, wie dieser Upload tatsächlich funktioniert.",
  "Upload a file that has no .pdf or .zip extension.": "Lade eine Datei hoch, die keine .pdf- oder .zip-Erweiterung hat.",
  "You can attach a PDF or ZIP file to the \"Complaint\" form. Investigate how this upload actually works.": "Du kannst eine PDF- oder ZIP-Datei an das \"Reklamation\"-Formular anhängen. Finde heraus, wie dieser Upload tatsächlich funktioniert.",
  "Retrieve a list of all user credentials via SQL Injection.": "Greife eine Liste aller Benutzerzugangsdaten mittels SQL Injection ab.",
  "Gather information on where user data is stored and how it is addressed. Then craft a corresponding UNION SELECT attack.": "Sammle Informationen darüber, wo die Benutzerdaten gespeichert und wie auf sie zugegriffen wird. Erstelle dann einen entsprechenden UNION SELECT-Angriff.",
  "Embed an XSS payload <code>&lt;/script&gt;&lt;script&gt;alert(`xss`)&lt;/script&gt;</code> into our promo video.": "Bette einen XSS-Payload <code>&lt;/script&gt;&lt;script&gt;alert(`xss`)&lt;/script&gt;</code> in unser Promo-Video ein.",
  "Without utilizing the vulnerability behind another ⭐⭐⭐⭐⭐⭐ challenge it is not possible to plant the XSS payload for this challenge.": "Without utilizing the vulnerability behind another ⭐⭐⭐⭐⭐⭐ challenge it is not possible to plant the XSS payload for this challenge.",
  "View another user's shopping basket.": "Schau dir den Warenkorb eines anderen Benutzers an.",
  "Try out all existing functionality involving the shopping basket while having an eye on the HTTP traffic.": "Try out all existing functionality involving the shopping basket while having an eye on the HTTP traffic.",
  "<a href=\"/#/contact\">Inform the shop</a> about a vulnerable library it is using. (Mention the exact library name and version in your comment)": "<a href=\"/#/contact\">Informiere den Laden</a> über eine verwendete verwundbare Bibliothek. (Erwähne den genauen Bibliotheksnamen und deren Version in deinem Kommentar)",
  "Report one of two possible answers via the \"Customer Feedback\" form. Do not forget to submit the library's version as well.": "Melde eine der zwei möglichen Antworten über das \"Kundenfeedback\"-Formular. Vergiss nicht, dass du auch die Version der Bibliothek mitschicken musst.",
  "<a href=\"/#/contact\">Inform the shop</a> about an algorithm or library it should definitely not use the way it does.": "<a href=\"/#/contact\">Informiere den Shop</a> über einen Algorithmus oder eine Bibliothek, die er in der vorliegenden Weise definitiv nicht nutzen sollte.",
  "Report one of five possible answers via the \"Customer Feedback\" form.": "Report one of five possible answers via the \"Customer Feedback\" form.",
  "Enforce a redirect to a page you are not supposed to redirect to.": "Erzwinge eine Weiterleitung zu einer Seite, auf die du nicht weitergeleitet werden solltest.",
  "You have to find a way to beat the allowlist of allowed redirect URLs.": "Du musst einen Weg finden, die Allowlist erlaubter Weiterleitungs-URLs zu besiegen.",
  "Retrieve the content of <code>C:\\Windows\\system.ini</code> or <code>/etc/passwd</code> from the server.": "Rufe den Inhalt von <code>C:\\Windows\\system.ini</code> oder <code>/etc/passwd</code> vom Server ab.",
  "The leverage point for this challenge is the deprecated B2B interface.": "Der Ansatzpunkt für diese Herausforderung ist die veraltete B2B-Schnittstelle.",
  "Give the server something to chew on for quite a while.": "Gib dem Server etwas, an dem er eine Weile lang zu kauen hat.",
  "It is not as easy as sending a large amount of data directly to the deprecated B2B interface.": "Es ist nicht so einfach, als dass man nur eine große Datenmenge direkt an die veraltete B2B Schnittstelle schicken müsste.",
  "Drop some explosive data into a vulnerable file-handling endpoint.": "Drop some explosive data into a vulnerable file-handling endpoint.",
  "This one is actually similar to the XXE DoS challenge in every way except the data format being (ab)used.": "This one is actually similar to the XXE DoS challenge in every way except the data format being (ab)used.",
  "Give a devastating zero-star feedback to the store.": "Gib dem Laden ein verheerendes Null-Sterne-Feedback.",
  "Before you invest time bypassing the API, you might want to play around with the UI a bit.": "Bevor du Zeit in das Umgehen der API investierst, möchtest du vielleicht etwas mit der Benutzeroberfläche herumspielen.",
  "Retrieve the photo of Bjoern's cat in \"melee combat-mode\".": "Rufe das Foto von Björns Katze im \"Nahkampfkampfmodus\" ab.",
  "Check the Photo Wall for an image that could not be loaded correctly.": "Überprüfe die Foto-Wand auf ein Bild, das nicht korrekt geladen werden konnte.",
  "Stick <a href=\"https://cataas.com/cat\" target=\"_blank\">cute cross-domain kittens</a> all over our delivery boxes.": "Beklebe unsere Lieferboxen von oben bis unten mit <a href=\"https://cataas.com/cat\" target=\"_blank\">süßen Cross-Domain-Kätzchen</a>.",
  "This challenge would formally have to be in several categories as the developers made multiple gaffes for this to be possible.": "Diese Herausforderung müsste formell zu verschiedenen Kategorien gehören, da die Entwickler sich mehrere Ausrutscher erlauben mussten, um diese zu ermöglichen.",
  "Find the endpoint that serves usage data to be scraped by a <a href=\"https://github.com/prometheus/prometheus\">popular monitoring system</a>.": "Finde den Endpunkt, der einem <a href=\"https://github.com/prometheus/prometheus\">beliebten Monitoring-System</a> Nutzungsdaten zum Schürfen bereit stellt.",
  "Try to guess what URL the endpoint might have.": "Versuche zu erraten, welche URL der Endpunkt haben könnte.",
  "Obtain a Deluxe Membership without paying for it.": "Erhalte eine Deluxe Mitgliedschaft, ohne dafür zu bezahlen.",
  "Look closely at what happens when you attempt to upgrade your account.": "Schau dir genau an, was passiert, wenn du versuchst, dein Konto zu aktualisieren.",
  "Change the name of a user by performing Cross-Site Request Forgery from <a href=\"http://htmledit.squarefree.com\">another origin</a>.": "Ändere den Namen eines Benutzers, indem du Cross-Site Request Forgery von <a href=\"http://htmledit.squarefree.com\">einem anderen Ursprung</a> ausführst.",
  "Find a form which updates the username and then construct a malicious page in the online HTML editor. You probably need an older browser version for this.": "Finde ein Formular, welches den Benutzernamen aktualisiert, und baue dann eine bösartige Seite in dem Online-HTML-Editor. Du benötigst hierfür wahrscheinlich eine ältere Browserversion.",
  "Use the bonus payload <code>&lt;iframe width=&quot;100%&quot; height=&quot;166&quot; scrolling=&quot;no&quot; frameborder=&quot;no&quot; allow=&quot;autoplay&quot; src=&quot;https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/771984076&amp;color=%23ff5500&amp;auto_play=true&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true&quot;&gt;&lt;/iframe&gt;</code> in the <i>DOM XSS</i> challenge.": "Verwendende den Bonus-Payload <code>&lt;iframe width=&quot;100%&quot; height=&quot;166&quot; scrolling=&quot;no&quot; frameborder=&quot;no&quot; allow=&quot;autoplay&quot; src=&quot;https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/771984076&amp;color=%23ff5500&amp;auto_play=true&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true&quot;&gt;&lt;/iframe&gt;</code> in der <i>DOM XSS</i>-Herausforderung.",
  "First, solve the \"Perform a DOM XSS attack\" challenge.": "Löse zunächst die Herausforderung \"Perform a DOM XSS attack\".",
  "Reset Uvogin's password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "Setze Uvogins Passwort in der <a href=\"/#/forgot-password\">Passwort vergessen</a>-Funktion mittels der <i>Original-Antwort</i> auf seine Sicherheitsfrage zurück.",
  "You might have to do some OSINT on his social media personas to find out his honest answer to the security question.": "Vielleicht musst du etwas OSINT in seinen Sozialen Medien-Personae vornehmen, um seine ehrliche Antwort auf die Sicherheitsfrage zu finden.",
  "Determine the answer to John's security question by looking at an upload of him to the Photo Wall and use it to reset his password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism.": "Bestimme die Antwort auf Johns Sicherheitsfrage, indem du einen seiner Uploads auf die Foto-Wand ansiehst und diese verwendest, um sein Passwort über den <a href=\"/#/forgot-password\">Passwort vergessen</a>-Mechanismus zurückzusetzen.",
  "Take a look at the meta data of the corresponding photo.": "Wirf einen Blick auf die Metadaten des entsprechenden Fotos.",
  "Determine the answer to Emma's security question by looking at an upload of her to the Photo Wall and use it to reset her password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism.": "Bestimme die Antwort auf Emmas Sicherheitsfrage, indem du einen ihrer Uploads auf die Foto-Wand ansiehst und diese verwendest, um ihr Passwort über den <a href=\"/#/forgot-password\">Passwort vergessen</a>-Mechanismus zurückzusetzen.",
  "Take a look at the details in the photo to determine the location of where it was taken.": "Wirf einen Blick auf die Details auf dem Foto, um zu bestimmen, wo es aufgenommen wurde.",
  "Permanently disable the support chatbot so that it can no longer answer customer queries.": "Schalte den Support-Chatbot dauerhaft ab, so dass er keine Kundenanfragen mehr beantworten kann.",
  "Think of a way to get a hold of the internal workings on the chatbot API.": "Überlege die eine Möglichkeit, wie du an die interne Funktionsweise der Chatbot API herankommen kannst.",
  "Bypass a security control with a <a href=\"https://hakipedia.com/index.php/Poison_Null_Byte\">Poison Null Byte</a> to access a file not meant for your eyes.": "Umgehe eine Sicherheitskontrolle mit einem <a href=\"https://hakipedia.com/index.php/Poison_Null_Byte\">Poison Null Byte</a>, um auf eine Datei zuzugreifen, die nicht für deine Augen bestimmt ist.",
  "Analyze and tamper with links in the application until you get to an unprotected directory listing.": "Analyze and tamper with links in the application until you get to an unprotected directory listing.",
  "Receive a coupon code from the support chatbot.": "Erhalte einen Gutscheincode vom Support-Chatbot.",
  "The bot is reluctant to give you a coupon as it’s coming up with various excuses for not giving you one.": "The bot is reluctant to give you a coupon as it’s coming up with various excuses for not giving you one.",
  "Gain read access to an arbitrary local file on the web server.": "Verschaffe dir Lesezugriff auf eine beliebige lokale Datei auf dem Webserver.",
  "You should read up on vulnerabilities in popular NodeJs template engines.": "Du solltest dich über Schwachstellen in beliebten NodeJs Template-Engines informieren.",
  "Close multiple \"Challenge solved\"-notifications in one go.": "Schließe mehrere \"Challenge gelöst\"-Benachrichtigungen auf einmal.",
  "Either check the official documentation or inspect a notification UI element directly.": "Schau entweder in die offizielle Dokumentation, oder inspiziere ein Benachrichtigungs-UI-Element direkt.",
  "The Juice Shop is susceptible to a known vulnerability in a library, for which an advisory has already been issued, marking the Juice Shop as <i>known affected</i>. A fix is still pending. <a href=\"/#/contact\">Inform the shop</a> about a suitable checksum as proof that you did your due diligence.": "The Juice Shop is susceptible to a known vulnerability in a library, for which an advisory has already been issued, marking the Juice Shop as <i>known affected</i>. A fix is still pending. <a href=\"/#/contact\">Inform the shop</a> about a suitable checksum as proof that you did your due diligence.",
  "Security Advisories are often listed in the security.txt": "Sicherheitsankündigungen werden oft in der security.txt aufgelistet.",
  "A developer was careless with hardcoding unused, but still valid credentials for a testing account on the client-side.": "A developer was careless with hardcoding unused, but still valid credentials for a testing account on the client-side.",
  "Have a look at the client-side code in the dev console.": "Have a look at the client-side code in the dev console.",
  "<a href=\"/#/contact\">Inform the shop</a> about a leaked API key. (Mention the exact key in your comment)": "<a href=\"/#/contact\">Inform the shop</a> about a leaked API key. (Mention the exact key in your comment)",
  "The API call is part of a scheduled process \"behind the scenes\", i.e. completely unrelated to the web application.": "The API call is part of a scheduled process \"behind the scenes\", i.e. completely unrelated to the web application.",
  "A matrix of known data entities and their supported HTTP verbs through the API can help you here.": "A matrix of known data entities and their supported HTTP verbs through the API can help you here.",
  "Careless developers might have exposed API methods that the client does not even need.": "Careless developers might have exposed API methods that the client does not even need.",
  "Normally, server log files are written to disk on server side and are not accessible from the outside.": "Normally, server log files are written to disk on server side and are not accessible from the outside.",
  "Which raises the question: Who would want a server access log to be accessible through a web application?": "Which raises the question: Who would want a server access log to be accessible through a web application?",
  "One particular file found in the folder you might already have found during the \"Access a confidential document\" challenge might give you an idea who is interested in such a public exposure.": "One particular file found in the folder you might already have found during the \"Access a confidential document\" challenge might give you an idea who is interested in such a public exposure.",
  "Drilling down one level into the file system might not be sufficient.": "Drilling down one level into the file system might not be sufficient.",
  "Register as an ordinary user to learn what API endpoints are involved in this use case.": "Register as an ordinary user to learn what API endpoints are involved in this use case.",
  "Think of the simplest possible implementations of a distinction between regular users and administrators.": "Think of the simplest possible implementations of a distinction between regular users and administrators.",
  "Knowing it exists, you can simply guess what URL the admin section might have.": "Knowing it exists, you can simply guess what URL the admin section might have.",
  "Alternatively, you can try to find a reference or clue within the parts of the application that are not usually visible in the browser.": "Alternatively, you can try to find a reference or clue within the parts of the application that are not usually visible in the browser.",
  "It is probably just slightly harder to find and gain access to than the score board link.": "It is probably just slightly harder to find and gain access to than the score board link.",
  "There is some access control in place, but there are at least three ways to bypass it.": "There is some access control in place, but there are at least three ways to bypass it.",
  "Find all places in the application where file uploads are possible.": "Finde alle Stellen in der Anwendung, an denen Datei-Uploads möglich sind.",
  "For at least one of these, the Juice Shop is depending on a library that suffers from an arbitrary file overwrite vulnerability.": "For at least one of these, the Juice Shop is depending on a library that suffers from an arbitrary file overwrite vulnerability.",
  "You can find a hint toward the underlying vulnerability in the @owasp_juiceshop Twitter timeline.": "Einen Hinweis auf die zugrunde liegende Schwachstelle findest du in der @owasp_juiceshop Twitter-Timeline.",
  "More precisely, Bjoern might have accidentally (?) doxxed himself by mentioning his security answer on at least one occasion where a camera was running.": "More precisely, Bjoern might have accidentally (?) doxxed himself by mentioning his security answer on at least one occasion where a camera was running.",
  "Brute forcing the answer might be very well possible with a sufficiently extensive list of common pet names.": "Brute forcing the answer might be very well possible with a sufficiently extensive list of common pet names.",
  "Guessing or brute forcing the URL of the token sale page is very unlikely to succeed.": "Guessing or brute forcing the URL of the token sale page is very unlikely to succeed.",
  "You should closely investigate the place where all paths within the application are defined.": "You should closely investigate the place where all paths within the application are defined.",
  "Beating the employed obfuscation mechanism manually will take some time. Maybe there is an easier way to undo it?": "Beating the employed obfuscation mechanism manually will take some time. Maybe there is an easier way to undo it?",
  "As the Juice Shop is written in pure Javascript, there is one data format that is most probably used for serialization.": "As the Juice Shop is written in pure Javascript, there is one data format that is most probably used for serialization.",
  "You should try to make the server busy for all eternity.": "You should try to make the server busy for all eternity.",
  "The challenge will be solved if you manage to trigger the protection of the application against a very specific DoS attack vector.": "The challenge will be solved if you manage to trigger the protection of the application against a very specific DoS attack vector.",
  "Similar to the \"Let the server sleep for some time\" challenge (which accepted nothing but NoSQL Injection as a solution) this challenge will only accept proper RCE as a solution. It cannot be solved by simply hammering the server with requests. That would probably just kill your server instance.": "Similar to the \"Let the server sleep for some time\" challenge (which accepted nothing but NoSQL Injection as a solution) this challenge will only accept proper RCE as a solution. It cannot be solved by simply hammering the server with requests. That would probably just kill your server instance.",
  "You could prepare 10 browser tabs, solving every CAPTCHA and filling out the each feedback form. Then you’d need to very quickly switch through the tabs and submit the forms in under 20 seconds total.": "You could prepare 10 browser tabs, solving every CAPTCHA and filling out the each feedback form. Then you’d need to very quickly switch through the tabs and submit the forms in under 20 seconds total.",
  "Should the Juice Shop ever decide to change the challenge into \"Submit 100 or more customer feedbacks within 60 seconds\" or worse, you’d probably have a hard time keeping up with any tab-switching approach.": "Should the Juice Shop ever decide to change the challenge into \"Submit 100 or more customer feedbacks within 60 seconds\" or worse, you’d probably have a hard time keeping up with any tab-switching approach.",
  "Investigate closely how the CAPTCHA mechanism works and try to find either a bypass or some automated way of solving it dynamically.": "Investigate closely how the CAPTCHA mechanism works and try to find either a bypass or some automated way of solving it dynamically.",
  "Wrap this into a script (in whatever programming language you prefer) that repeats this 10 times.": "Wrap this into a script (in whatever programming language you prefer) that repeats this 10 times.",
  "It might also have been put into the Improper Input Validation category.": "It might also have been put into the Improper Input Validation category.",
  "Bender’s current password is so strong that brute force, rainbow table or guessing attacks will probably not work.": "Bender’s current password is so strong that brute force, rainbow table or guessing attacks will probably not work.",
  "Find out how the application hides deleted products from its customers.": "Find out how the application hides deleted products from its customers.",
  "Try to craft an attack string that makes deleted products visible again.": "Try to craft an attack string that makes deleted products visible again.",
  "You need to get the deleted product into your shopping cart and trigger the Checkout.": "You need to get the deleted product into your shopping cart and trigger the Checkout.",
  "Neither of the above can be achieved through the application frontend and it might even require (half-)Blind SQL Injection.": "Neither of the above can be achieved through the application frontend and it might even require (half-)Blind SQL Injection.",
  "Find a screen in the application that looks subtly odd and dated compared with all other screens.": "Find a screen in the application that looks subtly odd and dated compared with all other screens.",
  "Before trying any XSS attacks, you should understand how the page is setting its Content Security Policy.": "Before trying any XSS attacks, you should understand how the page is setting its Content Security Policy.",
  "For the subsequent XSS, make good use of the flaws in the homegrown sanitization based on a RegEx!": "For the subsequent XSS, make good use of the flaws in the homegrown sanitization based on a RegEx!",
  "Even less of these fields are persisted in a way where their content is shown on another screen.": "Even less of these fields are persisted in a way where their content is shown on another screen.",
  "Bypassing client-side security can typically be done by either disabling it on the client (i.e. in the browser by manipulating the DOM tree) or by ignoring it completely and interacting with the backend instead.": "Bypassing client-side security can typically be done by either disabling it on the client (i.e. in the browser by manipulating the DOM tree) or by ignoring it completely and interacting with the backend instead.",
  "The file you are looking for is not protected in any way. Once you found it you can also access it.": "The file you are looking for is not protected in any way. Once you found it you can also access it.",
  "This challenge is almost indistinguishable from \"Perform a reflected XSS attack\" if you do not look \"under the hood\" to find out what the application actually does with the user input.": "This challenge is almost indistinguishable from \"Perform a reflected XSS attack\" if you do not look \"under the hood\" to find out what the application actually does with the user input.",
  "Find out which database system is in use and where it would usually store its schema definitions.": "Find out which database system is in use and where it would usually store its schema definitions.",
  "Craft a UNION SELECT attack string to join the relevant data from any such identified system table into the original result.": "Craft a UNION SELECT attack string to join the relevant data from any such identified system table into the original result.",
  "You might have to tackle some query syntax issues step-by-step, basically hopping from one error to the next.": "You might have to tackle some query syntax issues step-by-step, basically hopping from one error to the next.",
  "As with \"Order the Christmas special offer of 2014\" this cannot be achieved through the application frontend.": "As with \"Order the Christmas special offer of 2014\" this cannot be achieved through the application frontend.",
  "The old B2B interface was replaced with a more modern version recently.": "The old B2B interface was replaced with a more modern version recently.",
  "When deprecating the old interface, not all of its parts were cleanly removed from the code base.": "When deprecating the old interface, not all of its parts were cleanly removed from the code base.",
  "Simply using the deprecated interface suffices to solve this challenge. No attack or exploit is necessary.": "Simply using the deprecated interface suffices to solve this challenge. No attack or exploit is necessary.",
  "Simply reuse the trick that already worked for the files above.": "Simply reuse the trick that already worked for the files above.",
  "What ways are there to access data from a web application cross-domain?": "What ways are there to access data from a web application cross-domain?",
  "This challenge uses an old way which is no longer recommended.": "This challenge uses an old way which is no longer recommended.",
  "The user literally needs to be ephemeral as in \"lasting for only a short time\".": "The user literally needs to be ephemeral as in \"lasting for only a short time\".",
  "Registering normally with the user’s email address will then obviously not solve this challenge. The Juice Shop will not even let you register as acc0unt4nt@juice-sh.op, as this would make the challenge unsolvable for you.": "Registering normally with the user’s email address will then obviously not solve this challenge. The Juice Shop will not even let you register as acc0unt4nt@juice-sh.op, as this would make the challenge unsolvable for you.",
  "Getting the user into the database some other way will also fail to solve this challenge. In case you somehow managed to do so, you need to restart the Juice Shop application in order to wipe the database and make the challenge solvable again.": "Getting the user into the database some other way will also fail to solve this challenge. In case you somehow managed to do so, you need to restart the Juice Shop application in order to wipe the database and make the challenge solvable again.",
  "The fact that this challenge is in the Injection category should already give away the intended approach.": "The fact that this challenge is in the Injection category should already give away the intended approach.",
  "This challenge actually triggers from various possible error conditions.": "This challenge actually triggers from various possible error conditions.",
  "You can try to submit bad input to forms to provoke an improper error handling.": "You can try to submit bad input to forms to provoke an improper error handling.",
  "Tampering with URL paths or parameters might also trigger an unforeseen error.": "Tampering with URL paths or parameters might also trigger an unforeseen error.",
  "Look for clues about the past campaign or holiday event somewhere in the application.": "Look for clues about the past campaign or holiday event somewhere in the application.",
  "Solving this challenge does not require actual time traveling.": "Solving this challenge does not require actual time traveling.",
  "Guessing will most definitely not work in this challenge.": "Guessing will most definitely not work in this challenge.",
  "Investigate online what languages are actually available.": "Investigate online what languages are actually available.",
  "Nothing happens when you try to delete feedback entries? Check the JavaScript console for errors!": "Nothing happens when you try to delete feedback entries? Check the JavaScript console for errors!",
  "One viable solution would be to reverse-engineer how coupon codes are generated and craft your own 80% coupon by using the same (or at least similar) implementation.": "One viable solution would be to reverse-engineer how coupon codes are generated and craft your own 80% coupon by using the same (or at least similar) implementation.",
  "Another possible solution might be harvesting as many previous coupon as possible and look for patterns that might give you a leverage for a brute force attack.": "Another possible solution might be harvesting as many previous coupon as possible and look for patterns that might give you a leverage for a brute force attack.",
  "If all else fails, you could still try to blindly brute force the coupon code field before checkout.": "If all else fails, you could still try to blindly brute force the coupon code field before checkout.",
  "To find the client-side leverage point, closely analyze the HTML form used for feedback submission.": "To find the client-side leverage point, closely analyze the HTML form used for feedback submission.",
  "The backend-side leverage point is similar to some of the XSS challenges found in OWASP Juice Shop.": "The backend-side leverage point is similar to some of the XSS challenges found in OWASP Juice Shop.",
  "This challenge can be solved by using developers tool of your browser or with tools like postman.": "Diese Herausforderung kann mithilfe der Dev-Tools deines Browsers oder mit Werkzeugen wie Postman gelöst werden.",
  "Analyze the form used for review submission and try to find a leverage point.": "Analyze the form used for review submission and try to find a leverage point.",
  "This challenge is pretty similar to \"Post some feedback in another user’s name\" challenge.": "This challenge is pretty similar to \"Post some feedback in another user’s name\" challenge.",
  "The three generic hints from Forge an essentially unsigned JWT token also help with this challenge.": "The three generic hints from Forge an essentially unsigned JWT token also help with this challenge.",
  "Instead of enforcing no encryption to be applied, try to apply a more sophisticated exploit against the JWT libraries used in the Juice Shop.": "Instead of enforcing no encryption to be applied, try to apply a more sophisticated exploit against the JWT libraries used in the Juice Shop.",
  "Getting your hands on the public RSA key the application employs for its JWTs is mandatory for this challenge.": "Getting your hands on the public RSA key the application employs for its JWTs is mandatory for this challenge.",
  "Finding the corresponding private key should actually be impossible, but that obviously doesn’t make this challenge unsolvable.": "Finding the corresponding private key should actually be impossible, but that obviously doesn’t make this challenge unsolvable.",
  "Make sure your JWT is URL safe!": "Stelle sicher, dass dein JWT URL-sicher ist!",
  "The file is not directly accessible because a security mechanism prevents access to it.": "The file is not directly accessible because a security mechanism prevents access to it.",
  "You need to trick the security mechanism into thinking that the file has a valid file type.": "You need to trick the security mechanism into thinking that the file has a valid file type.",
  "For this challenge there is only one approach to pull this trick.": "For this challenge there is only one approach to pull this trick.",
  "This challenge has nothing to do with URLs or domains.": "This challenge has nothing to do with URLs or domains.",
  "Other than for its legacy companion, combing through the package.json.bak does not help for this challenge.": "Other than for its legacy companion, combing through the package.json.bak does not help for this challenge.",
  "Trying out the Request Data Erasure functionality might be interesting, but cannot help you solve this challenge in real time.": "Trying out the Request Data Erasure functionality might be interesting, but cannot help you solve this challenge in real time.",
  "If you have solved the challenge Retrieve a list of all user credentials via SQL Injection you might have already retrieved some information about how the Juice Shop \"deletes\" users upon their request.": "If you have solved the challenge Retrieve a list of all user credentials via SQL Injection you might have already retrieved some information about how the Juice Shop \"deletes\" users upon their request.",
  "What the Juice Shop does here is totally incompliant with GDPR. Luckily a 4% fine on a gross income of 0$ is still 0$.": "What the Juice Shop does here is totally incompliant with GDPR. Luckily a 4% fine on a gross income of 0$ is still 0$.",
  "You should not try to steal data from a \"vanilla\" user who never even ordered something at the shop.": "You should not try to steal data from a \"vanilla\" user who never even ordered something at the shop.",
  "As everything about this data export functionality happens on the server-side, it won’t be possible to just tamper with some HTTP requests to solve this challenge.": "As everything about this data export functionality happens on the server-side, it won’t be possible to just tamper with some HTTP requests to solve this challenge.",
  "Inspecting various server responses which contain user-specific data might give you a clue about the mistake the developers made.": "Inspecting various server responses which contain user-specific data might give you a clue about the mistake the developers made.",
  "You might have to look into less common or even proprietary HTTP headers to find the leverage point.": "You might have to look into less common or even proprietary HTTP headers to find the leverage point.",
  "Adding insult to injury, the HTTP header you need will never be sent by the application on its own.": "Adding insult to injury, the HTTP header you need will never be sent by the application on its own.",
  "Find out how saving and restoring progress is done behind the scenes.": "Find out how saving and restoring progress is done behind the scenes.",
  "Deduce from all available information (e.g. the package.json.bak) how the application encrypts and decrypts your hacking progress.": "Deduce from all available information (e.g. the package.json.bak) how the application encrypts and decrypts your hacking progress.",
  "Other than the user’s passwords, the hacking progress involves an additional secret during its encryption.": "Other than the user’s passwords, the hacking progress involves an additional secret during its encryption.",
  "What would be a really stupid mistake a developer might make when choosing such a secret?": "What would be a really stupid mistake a developer might make when choosing such a secret?",
  "A very popular help platform for developers might contain breadcrumbs towards solving this challenge.": "A very popular help platform for developers might contain breadcrumbs towards solving this challenge.",
  "The actual log file was copied & paste onto a platform often used to share data quickly with externals or even just internal peers.": "The actual log file was copied & paste onto a platform often used to share data quickly with externals or even just internal peers.",
  "Once you found and harvested the important piece of information from the log, you could employ a technique called Password Spraying to solve this challenge.": "Once you found and harvested the important piece of information from the log, you could employ a technique called Password Spraying to solve this challenge.",
  "You must first identify the \"unsafe product\" which ist not available any more in the shop.": "You must first identify the \"unsafe product\" which ist not available any more in the shop.",
  "Solving the \"Order the Christmas special offer of 2014\" challenge might give it to you as by-catch.": "Solving the \"Order the Christmas special offer of 2014\" challenge might give it to you as by-catch.",
  "The actual data you need to solve this challenge was leaked on the same platform that was involved in the \"Dumpster dive the Internet for a leaked password and log in to the original user account it belongs to\" challenge.": "The actual data you need to solve this challenge was leaked on the same platform that was involved in the \"Dumpster dive the Internet for a leaked password and log in to the original user account it belongs to\" challenge.",
  "Google is a particularly good accomplice in this challenge.": "Google is a particularly good accomplice in this challenge.",
  "Investigating the forgotten developer’s backup file might bring some insight.": "Investigating the forgotten developer’s backup file might bring some insight.",
  "\"Malicious packages in npm\" is a worthwhile read on Ivan Akulov’s blog.": "\"Malicious packages in npm\" is a worthwhile read on Ivan Akulov’s blog.",
  "If you happen to know the email address of the admin already, you can launch a targeted attack.": "If you happen to know the email address of the admin already, you can launch a targeted attack.",
  "You might be lucky with a dedicated attack pattern even if you have no clue about the admin email address.": "You might be lucky with a dedicated attack pattern even if you have no clue about the admin email address.",
  "If you harvested the admin’s password hash, you can of course try to attack that instead of using SQL Injection.": "If you harvested the admin’s password hash, you can of course try to attack that instead of using SQL Injection.",
  "Alternatively you can solve this challenge as a combo with the Log in with the administrator’s user credentials without previously changing them or applying SQL Injection challenge.": "Alternatively you can solve this challenge as a combo with the Log in with the administrator’s user credentials without previously changing them or applying SQL Injection challenge.",
  "As with so many other characters from Futurama this challenge is of course about logging in as Amy from that show.": "As with so many other characters from Futurama this challenge is of course about logging in as Amy from that show.",
  "Did you know that Amy is married to an alien named Kif?": "Did you know that Amy is married to an alien named Kif?",
  "The challenge description contains a few sentences which give away some information how Amy decided to strengthen her password.": "The challenge description contains a few sentences which give away some information how Amy decided to strengthen her password.",
  "Obviously, Amy - being a little dimwitted - did not put nearly enough effort and creativity into the password selection process.": "Obviously, Amy - being a little dimwitted - did not put nearly enough effort and creativity into the password selection process.",
  "You need to know (or smart-guess) Bender’s email address so you can launch a targeted attack.": "You need to know (or smart-guess) Bender’s email address so you can launch a targeted attack.",
  "Bender's password hash might not help you very much.": "Bender's password hash might not help you very much.",
  "In case you try some other approach than SQL Injection, you will notice that Bender’s password hash is not very useful.": "In case you try some other approach than SQL Injection, you will notice that Bender’s password hash is not very useful.",
  "One way to light up this challenge in green on the score board, is to be Bjoern Kimminich. In that case, just log in with your Google account to automatically solve this challenge! Congratulations!": "One way to light up this challenge in green on the score board, is to be Bjoern Kimminich. In that case, just log in with your Google account to automatically solve this challenge! Congratulations!",
  "Most likely you are not Bjoern Kimminich, so instead you might want to take detailed look into how the OAuth login with Google is implemented.": "Most likely you are not Bjoern Kimminich, so instead you might want to take detailed look into how the OAuth login with Google is implemented.",
  "It could bring you some insight to register with your own Google account and analyze closely what happens behind the scenes.": "It could bring you some insight to register with your own Google account and analyze closely what happens behind the scenes.",
  "You need to know (or smart-guess) Jim’s email address so you can launch a targeted attack.": "You need to know (or smart-guess) Jim’s email address so you can launch a targeted attack.",
  "If you harvested Jim’s password hash, you can try to attack that instead of using SQL Injection.": "If you harvested Jim’s password hash, you can try to attack that instead of using SQL Injection.",
  "After watching the music video of this song, you should agree that even ⭐⭐ is a slightly exaggerated difficulty rating for this challenge.": "After watching the music video of this song, you should agree that even ⭐⭐ is a slightly exaggerated difficulty rating for this challenge.",
  "The support team is located in a low-cost country and the team structure fluctuates a lot due to people leaving for jobs with even just slightly better wages.": "The support team is located in a low-cost country and the team structure fluctuates a lot due to people leaving for jobs with even just slightly better wages.",
  "To prevent abuse the password for the support team account itself is actually very strong.": "To prevent abuse the password for the support team account itself is actually very strong.",
  "To allow easy access during an incident, the support team utilizes a 3rd party tool which every support engineer can access to get the current account password from.": "To allow easy access during an incident, the support team utilizes a 3rd party tool which every support engineer can access to get the current account password from.",
  "While it is also possible to use SQL Injection to log in as the support team, this will not solve the challenge.": "While it is also possible to use SQL Injection to log in as the support team, this will not solve the challenge.",
  "Adding more instances of the same product to someone else’s basket does not qualify as a solution. The same goes for stealing from someone else’s basket.": "Adding more instances of the same product to someone else’s basket does not qualify as a solution. The same goes for stealing from someone else’s basket.",
  "This challenge requires a bit more sophisticated tampering than others of the same ilk.": "This challenge requires a bit more sophisticated tampering than others of the same ilk.",
  "If you solved one of the other four file access challenges, you already know where the SIEM signature file is located.": "If you solved one of the other four file access challenges, you already know where the SIEM signature file is located.",
  "Every user is (almost) immediately associated with the review they \"liked\" to prevent abuse of that functionality.": "Every user is (almost) immediately associated with the review they \"liked\" to prevent abuse of that functionality.",
  "Did you really think clicking the \"like\" button three times in a row really fast would be enough to solve a ⭐⭐⭐⭐⭐⭐ challenge?": "Did you really think clicking the \"like\" button three times in a row really fast would be enough to solve a ⭐⭐⭐⭐⭐⭐ challenge?",
  "The underlying flaw of this challenge is a Race Condition.": "The underlying flaw of this challenge is a Race Condition.",
  "Make sure you solve Find the hidden easter egg first.": "Make sure you solve Find the hidden easter egg first.",
  "As stated in the Architecture overview, OWASP Juice Shop uses a MongoDB derivate as its NoSQL database.": "As stated in the Architecture overview, OWASP Juice Shop uses a MongoDB derivate as its NoSQL database.",
  "The categorization into the NoSQL Injection category totally gives away the expected attack vector for this challenge. Trying any others will not solve the challenge, even if they might yield the same result.": "The categorization into the NoSQL Injection category totally gives away the expected attack vector for this challenge. Trying any others will not solve the challenge, even if they might yield the same result.",
  "In particular, flooding the application with requests will not solve this challenge. That would probably just kill your server instance.": "In particular, flooding the application with requests will not solve this challenge. That would probably just kill your server instance.",
  "This challenge requires a classic Injection attack.": "Diese Herausforderung erfordert einen klassischen Injection-Angriff.",
  "Find an API endpoint with the intent of delivering a single order to the user and work with that.": "Find an API endpoint with the intent of delivering a single order to the user and work with that.",
  "Reading up on how MongoDB queries work is really helpful here.": "Reading up on how MongoDB queries work is really helpful here.",
  "This challenge requires another classic Injection attack.": "This challenge requires another classic Injection attack.",
  "It is also worth looking into how Query Operators work in MongoDB.": "It is also worth looking into how Query Operators work in MongoDB.",
  "More particular, they have been sloppy in a way that even the Angular Compiler was not able to clean up after them automatically.": "More particular, they have been sloppy in a way that even the Angular Compiler was not able to clean up after them automatically.",
  "It is of course not sufficient to just visit any of the crypto currency links directly to solve the challenge.": "It is of course not sufficient to just visit any of the crypto currency links directly to solve the challenge.",
  "Guessing might work just fine.": "Bloßes Raten könnte schon klappen.",
  "If you harvested the admin’s password hash, you can try to attack that.": "If you harvested the admin’s password hash, you can try to attack that.",
  "In case you use some hacker tool, you can also go for a brute force attack using a generic password list.": "In case you use some hacker tool, you can also go for a brute force attack using a generic password list.",
  "Investigate the shopping basket closely to understand how it prevents you from creating orders that would fulfil the challenge.": "Investigate the shopping basket closely to understand how it prevents you from creating orders that would fulfil the challenge.",
  "There is no inappropriate, self-written or misconfigured cryptographic library to be exploited here.": "There is no inappropriate, self-written or misconfigured cryptographic library to be exploited here.",
  "How much protection does a sturdy top-quality door lock add to your house if you put the key under the door mat? Or hide the key in the nearby plant pot? Or tape the key to the underside of the mailbox?": "How much protection does a sturdy top-quality door lock add to your house if you put the key under the door mat? Or hide the key in the nearby plant pot? Or tape the key to the underside of the mailbox?",
  "Once more: You do not have to pay anything to unlock this challenge!": "Once more: You do not have to pay anything to unlock this challenge!",
  "When you work with the application you will most likely solve this challenge in the process.": "When you work with the application you will most likely solve this challenge in the process.",
  "Any automated crawling or spidering tool you use might solve this challenge for you.": "Any automated crawling or spidering tool you use might solve this challenge for you.",
  "There is no real hacking involved here.": "Hier geht es nicht um echtes Hacken.",
  "First you should obviously solve the \"Read our privacy policy\" challenge.": "First you should obviously solve the \"Read our privacy policy\" challenge.",
  "It is fine to use the mouse cursor to not lose sight of the paragraph you are currently reading.": "It is fine to use the mouse cursor to not lose sight of the paragraph you are currently reading.",
  "If you find some particularly hot sections in the policy you might want to melt them together similar to what you might have already uncovered in Apply some advanced cryptanalysis to find the real easter egg.": "If you find some particularly hot sections in the policy you might want to melt them together similar to what you might have already uncovered in Apply some advanced cryptanalysis to find the real easter egg.",
  "In practice two of these three ways should turn out to be dead ends.": "In practice two of these three ways should turn out to be dead ends.",
  "Try probing for XSS vulnerabilities by submitting text wrapped in an HTML tag which is easy to spot on screen, e.g. <h1> or <strike>.": "Try probing for XSS vulnerabilities by submitting text wrapped in an HTML tag which is easy to spot on screen, e.g. <h1> or <strike>.",
  "The obvious repetition in the User Registration form is the Repeat Password field.": "The obvious repetition in the User Registration form is the Repeat Password field.",
  "Try to register with either an empty or different value in Repeat Password.": "Try to register with either an empty or different value in Repeat Password.",
  "You can solve this challenge by cleverly interacting with the UI or bypassing it altogether.": "You can solve this challenge by cleverly interacting with the UI or bypassing it altogether.",
  "Unexpectedly, Bender also chose to answer his chosen question truthfully.": "Unexpectedly, Bender also chose to answer his chosen question truthfully.",
  "Hints to the answer to Bender’s question can be found in publicly available information on the Internet.": "Hints to the answer to Bender’s question can be found in publicly available information on the Internet.",
  "If a seemingly correct answer is not accepted, you might just need to try some alternative spelling.": "If a seemingly correct answer is not accepted, you might just need to try some alternative spelling.",
  "Brute forcing the answer should be next to impossible.": "Die Antwort über Brute Force zu finden, sollte so gut wie unmöglich sein.",
  "Other than with his OWASP account, Bjoern was a bit less careless with his choice of security and answer to his internal account.": "Other than with his OWASP account, Bjoern was a bit less careless with his choice of security and answer to his internal account.",
  "Bjoern chose to answer his chosen question truthfully but tried to make it harder for attackers by applying sort of a historical twist.": "Bjoern chose to answer his chosen question truthfully but tried to make it harder for attackers by applying sort of a historical twist.",
  "Again, hints to the answer to Bjoern’s question can be found by looking him up on the Internet.": "Again, hints to the answer to Bjoern’s question can be found by looking him up on the Internet.",
  "Jim picked one of the worst security questions and chose to answer it truthfully.": "Jim picked one of the worst security questions and chose to answer it truthfully.",
  "As Jim is a celebrity, the answer to his question is quite easy to find in publicly available information on the internet.": "As Jim is a celebrity, the answer to his question is quite easy to find in publicly available information on the internet.",
  "Even brute forcing the answer should be possible with the right kind of word list.": "Even brute forcing the answer should be possible with the right kind of word list.",
  "You can assume that Morty answered his security question truthfully but employed some obfuscation to make it more secure.": "You can assume that Morty answered his security question truthfully but employed some obfuscation to make it more secure.",
  "Morty’s answer is less than 10 characters long and does not include any special characters.": "Morty’s answer is less than 10 characters long and does not include any special characters.",
  "Unfortunately, Forgot your password? is protected by a rate limiting mechanism that prevents brute forcing. You need to beat this somehow.": "Unfortunately, Forgot your password? is protected by a rate limiting mechanism that prevents brute forcing. You need to beat this somehow.",
  "For your inconvenience the blueprint was not misplaced into the same place like so many others forgotten files covered in this chapter.": "For your inconvenience the blueprint was not misplaced into the same place like so many others forgotten files covered in this chapter.",
  "Using whatever you find inside the malware directly will not do you any good.": "Using whatever you find inside the malware directly will not do you any good.",
  "For this to count as an SSRF attack you need to make the Juice Shop server attack itself.": "For this to count as an SSRF attack you need to make the Juice Shop server attack itself.",
  "Do not try to find the source code for the malware on GitHub. Take it apart with classic reverse-engineering techniques instead.": "Do not try to find the source code for the malware on GitHub. Take it apart with classic reverse-engineering techniques instead.",
  "You can find the juicy malware via a very obvious Google search or by stumbling into a very ill-placed quarantine folder with the necessary URLs in it.": "You can find the juicy malware via a very obvious Google search or by stumbling into a very ill-placed quarantine folder with the necessary URLs in it.",
  "Making the server download and execute the malware is key to solving this challenge.": "Making the server download and execute the malware is key to solving this challenge.",
  "For this challenge you do not have to reverse engineer the malware in any way. That will be required later to solve the \"Request a hidden resource on server through server\" challenge.": "For this challenge you do not have to reverse engineer the malware in any way. That will be required later to solve the \"Request a hidden resource on server through server\" challenge.",
  "Undoubtedly you want to read our security policy before conducting any research on our application.": "Zweifellos möchtest du unsere Sicherheitsrichtlinie lesen, bevor Du irgendwelche Untersuchungen unserer Anwendung durchführst.",
  "As one of the good guys, would you just start attacking an application without consent of the owner?": "As one of the good guys, would you just start attacking an application without consent of the owner?",
  "You also might want to read the security policy or any bug bounty program that is in place.": "You also might want to read the security policy or any bug bounty program that is in place.",
  "The Comment field in the Contact Us screen is where you want to put your focus on.": "The Comment field in the Contact Us screen is where you want to put your focus on.",
  "The attack payload <iframe src=\"javascript:alert(`xss)\">` will not be rejected by any validator but stripped from the comment before persisting it.": "The attack payload <iframe src=\"javascript:alert(`xss)\">` will not be rejected by any validator but stripped from the comment before persisting it.",
  "Look for possible dependencies related to input processing in the package.json.bak you harvested earlier.": "Look for possible dependencies related to input processing in the package.json.bak you harvested earlier.",
  "If an XSS alert shows up but the challenge does not appear as solved on the Score Board, you might not have managed to put the exact attack string <iframe src=\"javascript:alert(`xss)\">` into the database?": "If an XSS alert shows up but the challenge does not appear as solved on the Score Board, you might not have managed to put the exact attack string <iframe src=\"javascript:alert(`xss)\">` into the database?",
  "You will need very specialized tool assistance for this challenge.": "You will need very specialized tool assistance for this challenge.",
  "The effective difficulty of this challenge depends a lot on what tools you pick to tackle it.": "The effective difficulty of this challenge depends a lot on what tools you pick to tackle it.",
  "This challenge cannot be solved by just reading our \"Lorem Ipsum\"-texts carefully.": "This challenge cannot be solved by just reading our \"Lorem Ipsum\"-texts carefully.",
  "This challenge uses the same leverage point as the \"Perform a Remote Code Execution that would keep a less hardened application busy forever\" challenge.": "This challenge uses the same leverage point as the \"Perform a Remote Code Execution that would keep a less hardened application busy forever\" challenge.",
  "This is a research-heavy challenge which does not involve any actual hacking.": "This is a research-heavy challenge which does not involve any actual hacking.",
  "Solving \"Access a developer's forgotten backup file\" before attempting this challenge will save you from a lot of frustration.": "Solving \"Access a developer's forgotten backup file\" before attempting this challenge will save you from a lot of frustration.",
  "As always, first learn how the feature under attack is used and behaves under normal conditions.": "As always, first learn how the feature under attack is used and behaves under normal conditions.",
  "Make sure you understand how 2FA with TOTP (time-based one-time password) works and which part of it is the critically sensitive one.": "Make sure you understand how 2FA with TOTP (time-based one-time password) works and which part of it is the critically sensitive one.",
  "Solving the challenge \"Retrieve a list of all user credentials via SQL Injection\" before tackling this one will definitely help. But it will not carry you all the way.": "Solving the challenge \"Retrieve a list of all user credentials via SQL Injection\" before tackling this one will definitely help. But it will not carry you all the way.",
  "You should begin with retrieving a valid JWT from the application’s Authorization request header.": "You should begin with retrieving a valid JWT from the application’s Authorization request header.",
  "A JWT is only given to users who have logged in. They have a limited validity, so better do not dawdle.": "A JWT is only given to users who have logged in. They have a limited validity, so better do not dawdle.",
  "Try to convince the site to give you a valid token with the required payload while downgrading to no encryption at all.": "Try to convince the site to give you a valid token with the required payload while downgrading to no encryption at all.",
  "First you should try to understand how the file upload is actually handled on the client and server side.": "First you should try to understand how the file upload is actually handled on the client and server side.",
  "With this understanding you need to find a \"weak spot\" in the right place and have to craft an exploit for it.": "With this understanding you need to find a \"weak spot\" in the right place and have to craft an exploit for it.",
  "If you solved the \"Upload a file larger than 100 kB\" challenge, you should try to apply the same solution here": "If you solved the \"Upload a file larger than 100 kB\" challenge, you should try to apply the same solution here",
  "Try to find an endpoint where you can influence data being retrieved from the server.": "Try to find an endpoint where you can influence data being retrieved from the server.",
  "Craft a UNION SELECT attack string to join data from another table into the original result.": "Craft a UNION SELECT attack string to join data from another table into the original result.",
  "You might have to tackle some query syntax issues step-by-step, basically hopping from one error to the next": "You might have to tackle some query syntax issues step-by-step, basically hopping from one error to the next",
  "As with \"Order the Christmas special offer of 2014\" and \"Exfiltrate the entire DB schema definition via SQL Injection\" this cannot be achieved through the application frontend.": "As with \"Order the Christmas special offer of 2014\" and \"Exfiltrate the entire DB schema definition via SQL Injection\" this cannot be achieved through the application frontend.",
  "The mentioned \"marketing collateral\" might have been publicly advertised by the Juice Shop but is not necessarily part of its sitemap yet.": "The mentioned \"marketing collateral\" might have been publicly advertised by the Juice Shop but is not necessarily part of its sitemap yet.",
  "It might help to perform some online searches for structurally similar web projects once you get stuck.": "It might help to perform some online searches for structurally similar web projects once you get stuck.",
  "This challenge will always partially keep you blindfolded, no matter how hard you do research and analysis.": "This challenge will always partially keep you blindfolded, no matter how hard you do research and analysis.",
  "There might be a client-side association of user to basket that you can try to manipulate.": "There might be a client-side association of user to basket that you can try to manipulate.",
  "In case you manage to update the database via SQL Injection so that a user is linked to another shopping basket, the application will not notice this challenge as solved.": "In case you manage to update the database via SQL Injection so that a user is linked to another shopping basket, the application will not notice this challenge as solved.",
  "Look for possible dependencies related to security in the package.json.bak you probably harvested earlier during the Access a developer’s forgotten backup file challenge.": "Look for possible dependencies related to security in the package.json.bak you probably harvested earlier during the Access a developer’s forgotten backup file challenge.",
  "Do some research on the internet for known security issues in the most suspicious application dependencies.": "Do some research on the internet for known security issues in the most suspicious application dependencies.",
  "Cryptographic functions only used in the \"Apply some advanced cryptanalysis to find the real easter egg\" challenge do not count as they are only a developer’s prank and not a serious security problem.": "Cryptographic functions only used in the \"Apply some advanced cryptanalysis to find the real easter egg\" challenge do not count as they are only a developer’s prank and not a serious security problem.",
  "You can find several places where redirects happen in the OWASP Juice Shop.": "You can find several places where redirects happen in the OWASP Juice Shop.",
  "The application will only allow you to redirect to allowlisted (previously referred to as whitelisted) URLs.": "The application will only allow you to redirect to allowlisted (previously referred to as whitelisted) URLs.",
  "Tampering with the redirect mechanism might give you some valuable information about how it works under to hood.": "Tampering with the redirect mechanism might give you some valuable information about how it works under to hood.",
  "This challenge sounds a lot harder than it actually is, which amplifies how bad the underlying vulnerability is.": "This challenge sounds a lot harder than it actually is, which amplifies how bad the underlying vulnerability is.",
  "Doing some research on typical XEE attack patterns basically gives away the solution for free.": "Doing some research on typical XEE attack patterns basically gives away the solution for free.",
  "The leverage point for this is obviously the same as for the XXE Data Access challenge.": "The leverage point for this is obviously the same as for the XXE Data Access challenge.",
  "You can only solve this challenge by keeping the server busy for >2sec with your attack.": "You can only solve this challenge by keeping the server busy for >2sec with your attack.",
  "The effectiveness of attack payloads for this challenge might depend on the operating system the Juice Shop is running on.": "The effectiveness of attack payloads for this challenge might depend on the operating system the Juice Shop is running on.",
  "You just have to (literally) inspect the problem to understand the basic issue.": "You just have to (literally) inspect the problem to understand the basic issue.",
  "It can also help to try out the Tweet-button of the entry and observe what happens.": "It can also help to try out the Tweet-button of the entry and observe what happens.",
  "Loading this page with an empty browser cache and on a slow (or throttled) connection will give you an idea on what the delivery box image is made of. Of course inspecting the page source will tell you just as much.": "Loading this page with an empty browser cache and on a slow (or throttled) connection will give you an idea on what the delivery box image is made of. Of course inspecting the page source will tell you just as much.",
  "You need to dive deep into the actual Angular code to understand this one.": "You need to dive deep into the actual Angular code to understand this one.",
  "This challenge requires the exploitation of another vulnerability which even has its own two challenges in its very own category": "This challenge requires the exploitation of another vulnerability which even has its own two challenges in its very own category",
  "This challenge can only be solved by strictly using the mentioned \"cross-domain kittens\". No other kittens from anywhere else can solve this challenge.": "This challenge can only be solved by strictly using the mentioned \"cross-domain kittens\". No other kittens from anywhere else can solve this challenge.",
  "The Juice Shop serves its metrics on the default path expected by Prometheus": "Der Juice Shop liefert seine Metriken auf dem Standardpfad von Prometheus aus",
  "Guessing the path is probably just as quick as taking the RTFM route via https://prometheus.io/docs/introduction/first_steps": "Guessing the path is probably just as quick as taking the RTFM route via https://prometheus.io/docs/introduction/first_steps",
  "Go to the payment page for a deluxe membership and try paying through different methods.": "Go to the payment page for a deluxe membership and try paying through different methods.",
  "Try inspecting the requests that go out for each of these methods, using the browser’s developer tools.": "Try inspecting the requests that go out for each of these methods, using the browser’s developer tools.",
  "Maybe playing around with the parameters in these requests could reveal something interesting.": "Maybe playing around with the parameters in these requests could reveal something interesting.",
  "Take a look at what happens when you change the username within the profile page.": "Wirf einen Blick darauf, was passiert, wenn du den Benutzernamen innerhalb der Profilseite änderst.",
  "Search for information about CSRF attacks and look out for examples that can be applied to this challenge.": "Search for information about CSRF attacks and look out for examples that can be applied to this challenge.",
  "Write the code for the CSRF attack within http://htmledit.squarefree.com and verify that it changes your username.": "Write the code for the CSRF attack within http://htmledit.squarefree.com and verify that it changes your username.",
  "Now it is just a question of copying and pasting the payload into the same vulnerable field.": "Now it is just a question of copying and pasting the payload into the same vulnerable field.",
  "Crank up the volume of your computer before submitting the payload! 🔊": "Crank up the volume of your computer before submitting the payload! 🔊",
  "People often reuse aliases online. You might be able to find something by looking online for Uvogin’s name or slight variations of it based on his unique writing habits.": "People often reuse aliases online. You might be able to find something by looking online for Uvogin’s name or slight variations of it based on his unique writing habits.",
  "You might be able to find some existing OSINT tools to help you in this investigation.": "You might be able to find some existing OSINT tools to help you in this investigation.",
  "Make use of tools that can inspect the metadata of images.": "Make use of tools that can inspect the metadata of images.",
  "Use this information to answer the security question of the John, who enjoys hiking in the park.": "Use this information to answer the security question of the John, who enjoys hiking in the park.",
  "In order to disable the chatbot for all users, you must first get an understanding of how it works under the hood.": "In order to disable the chatbot for all users, you must first get an understanding of how it works under the hood.",
  "The chatbot sure offers a lot of functionality. Could it be that juice-shop relies on a third party, possibly open source library for this?": "The chatbot sure offers a lot of functionality. Could it be that juice-shop relies on a third party, possibly open source library for this?",
  "Maybe you can try to gather clues from around juice shop and then go dumpster dive the internet to get a hold of the bot’s source.": "Maybe you can try to gather clues from around juice shop and then go dumpster dive the internet to get a hold of the bot’s source.",
  "Some files in there are not directly accessible because a security mechanism prevents access.": "Some files in there are not directly accessible because a security mechanism prevents access.",
  "The Poison Null Byte can trick the security mechanism into thinking that the file you want has a valid file type.": "The Poison Null Byte can trick the security mechanism into thinking that the file you want has a valid file type.",
  "Depending on the files you try to retrieve you will probably solve \"Access a developer’s forgotten backup file\", \"Access a salesman’s forgotten backup file\", \"Access a misplaced SIEM signature file, or \"Find the hidden easter egg\" along the way.": "Depending on the files you try to retrieve you will probably solve \"Access a developer’s forgotten backup file\", \"Access a salesman’s forgotten backup file\", \"Access a misplaced SIEM signature file, or \"Find the hidden easter egg\" along the way.",
  "Asking over and over again like a little kid might actually help you succeed in this case.": "Asking over and over again like a little kid might actually help you succeed in this case.",
  "No seriously, just keep asking.": "Nein ernsthaft, frag einfach immer weiter.",
  "You should read up on Local File Read (LFR) vulnerabilities in popular NodeJS template engines.": "You should read up on Local File Read (LFR) vulnerabilities in popular NodeJS template engines.",
  "Look for an easily forgettable endpoint in Juice Shop to test out the LFR attack.": "Look for an easily forgettable endpoint in Juice Shop to test out the LFR attack.",
  "500 Internal Server Error is always an interesting status code.": "500 Internal Server Error is always an interesting status code.",
  "Fuzzing can also help with this challenge.": "Fuzzing kann auch bei dieser Herausforderung helfen.",
  "This challenge is most easily solvable immediately after a server restart.": "This challenge is most easily solvable immediately after a server restart.",
  "Alternatively you can also inspect any \"Challenge solved\"-notification in your browser to understand its convenience feature.": "Alternatively you can also inspect any \"Challenge solved\"-notification in your browser to understand its convenience feature.",
  "Check the Juice Shop’s social media channels for regularly scheduled content being posted, possibly even indicating that it was automatically created.": "Check the Juice Shop’s social media channels for regularly scheduled content being posted, possibly even indicating that it was automatically created.",
  "Find out which part of the content might come from the response of an API call.": "Find out which part of the content might come from the response of an API call.",
  "Find the place where the API call happens — as stated above, it is not in the web application — and then look for the API key itself.": "Find the place where the API call happens — as stated above, it is not in the web application — and then look for the API key itself.",
  "Your eldest siblings middle name?": "Zweitname deines ältesten Geschwisters?",
  "Mother's maiden name?": "Mädchenname der Mutter?",
  "Mother's birth date? (MM/DD/YY)": "Geburtsdatum der Mutter? (MM/DD/YY)",
  "Father's birth date? (MM/DD/YY)": "Geburtsdatum des Vaters? (MM/DD/YY)",
  "Maternal grandmother's first name?": "Vorname der Großmutter mütterlicherseits?",
  "Paternal grandmother's first name?": "Vorname der Großmutter väterlicherseits?",
  "Name of your favorite pet?": "Name deines Lieblingshaustiers?",
  "Last name of dentist when you were a teenager? (Do not include 'Dr.')": "Nachname des Zahnarztes, bei dem du als Teenager warst? (Lasse 'Dr.' weg)",
  "Your ZIP/postal code when you were a teenager?": "Deine Postleitzahl, als du ein Teenager warst?",
  "Company you first work for as an adult?": "Erste Firma, für die du als Erwachsener gearbeitet hast?",
  "Your favorite book?": "Dein Lieblingsbuch?",
  "Your favorite movie?": "Dein Lieblingsfilm?",
  "Number of one of your customer or ID cards?": "Nummer einer deiner Kundenkarten oder Ausweise?",
  "What's your favorite place to go hiking?": "Was ist dein Lieblingsort zum Wandern?"
}
