{
  "Apple Juice (1000ml)": "アップルジュース (1000ml)",
  "The all-time classic.": "永遠の定番",
  "Apple Pomace": "Apple Pomace",
  "Finest pressings of apples. Allergy disclaimer: Might contain traces of worms. Can be <a href=\"/#recycle\">sent back to us</a> for recycling.": "選び抜かれた最高のリンゴを絞ったジュースです。\n\nアレルギーに関する免責事項：微量のワーム（虫）が含まれている可能性があります。リサイクルのため、<a href=\"/#recycle\">当社にご返送</a>いただけます。",
  "Banana Juice (1000ml)": "バナナジュース (1000ml)",
  "Monkeys love it the most.": "サルが一番大好きです。",
  "Best Juice Shop Salesman Artwork": "Juice Shop 最高のセールスマン アートワーク",
  "Unique digital painting depicting Stan, our most qualified and almost profitable salesman. He made a succesful carreer in selling used ships, coffins, krypts, crosses, real estate, life insurance, restaurant supplies, voodoo enhanced asbestos and courtroom souvenirs before <em>finally</em> adding his expertise to the Juice Shop marketing team.": "最も優秀で、もう少しで利益が出そうだったセールスマン、スタンを描いたユニークなデジタルペインティング。\n\n彼は、中古船、棺桶、墓所、十字架、不動産、生命保険、レストラン用品、ブードゥー教で強化されたアスベスト、そして法廷のお土産を販売するキャリアで成功を収めた後、<em>ついに</em>Juice Shopのマーケティングチームに専門知識をもたらしました。",
  "Carrot Juice (1000ml)": "ニンジンジュース (1000ml)",
  "As the old German saying goes: \"Carrots are good for the eyes. Or has anyone ever seen a rabbit with glasses?\"": "「ニンジンは目に良い。メガネをかけたウサギを見たことがあるかい？」というのは昔からドイツで言われていることわざです",
  "Eggfruit Juice (500ml)": "エッグフルーツジュース (500ml)",
  "Now with even more exotic flavour.": "さらにエキゾチックな風味になりました。",
  "Fruit Press": "フルーツプレス",
  "Fruits go in. Juice comes out. Pomace you can send back to us for recycling purposes.": "果実が入り、ジュースが出てきます。絞りかすは、リサイクルのために当社にご返送いただけます。",
  "Green Smoothie": "グリーンスムージー",
  "Looks poisonous but is actually very good for your health! Made from green cabbage, spinach, kiwi and grass.": "見た目は毒々しいですが、実際にはとても体に良い飲み物です！キャベツ、ほうれん草、キウイ、若草を使用しています。",
  "Juice Shop \"Permafrost\" 2020 Edition": "Juice Shop \"永久凍土\" 2020版",
  "Exact version of <a href=\"https://github.com/juice-shop/juice-shop/releases/tag/v9.3.1-PERMAFROST\">OWASP Juice Shop that was archived on 02/02/2020</a> by the GitHub Archive Program and ultimately went into the <a href=\"https://github.blog/2020-07-16-github-archive-program-the-journey-of-the-worlds-open-source-code-to-the-arctic\">Arctic Code Vault</a> on July 8. 2020 where it will be safely stored for at least 1000 years.": "GitHubアーカイブプログラムによって2020年2月2日にアーカイブされ、最終的に2020年7月8日に北極コードヴォールトに収蔵されたOWASP Juice Shopのバージョンv9.3.1-PERMAFROSTの正確なバージョン。このバージョンは、少なくとも1000年間安全に保管されます。",
  "Lemon Juice (500ml)": "レモンジュース (500ml)",
  "Sour but full of vitamins.": "酸っぱいですが、ビタミンたっぷりです。",
  "Melon Bike (Comeback-Product 2018 Edition)": "メロンバイク（カムバック商品 2018年版）",
  "The wheels of this bicycle are made from real water melons. You might not want to ride it up/down the curb too hard.": "この自転車の車輪は、本物のスイカでできています。縁石を勢いよく乗り越えたりしない方がいいでしょう。",
  "OWASP Juice Shop \"King of the Hill\" Facemask": "OWASP Juice Shop \"キング・オブ・ザ・ヒル\" フェイスマスク",
  "Facemask with compartment for filter from 50% cotton and 50% polyester.": "フィルター用ポケット付きフェイスマスク。\n\nコットン50％、ポリエステル50％素材。",
  "OWASP Juice Shop CTF Girlie-Shirt": "OWASP Juice Shop CTF レディースシャツ",
  "For serious Capture-the-Flag heroines only!": "本格的な CTF 女性プレイヤー専用！",
  "OWASP Juice Shop Card (non-foil)": "OWASP Juice Shop カード (ノンホイル)",
  "Mythic rare <small><em>(obviously...)</em></small> card \"OWASP Juice Shop\" with three distinctly useful abilities. Alpha printing, mint condition. A true collectors piece to own!": "この神話級のレアカード「OWASP Juice Shop」は、3つの非常に有用なアビリティを備えています。アルファ版印刷でミントコンディション。真のコレクターズアイテムです！",
  "OWASP Juice Shop Coaster (10pcs)": "OWASP Juice Shop コースター (10個)",
  "Our 95mm circle coasters are printed in full color and made from thick, premium coaster board.": "当社の95mm円形コースターは、厚みのあるプレミアムなコースターボードにフルカラーで印刷されています。",
  "OWASP Juice Shop Holographic Sticker": "OWASP Juice Shop ホログラフィックステッカー",
  "Die-cut holographic sticker. Stand out from those 08/15-sticker-covered laptops with this shiny beacon of 80's coolness!": "ダイカットのホログラフィックステッカー。ありきたりなステッカーだらけのノートパソコンから一歩抜きん出て、80年代のクールさを放つ輝く光を放ちましょう！",
  "OWASP Juice Shop Hoodie": "OWASP Juice Shop パーカー",
  "Mr. Robot-style apparel. But in black. And with logo.": "Mr. Robot スタイルのブラック仕様、ロゴ入り",
  "OWASP Juice Shop Iron-Ons (16pcs)": "OWASP Juice Shop アイロンワッペン (16個入り)",
  "Upgrade your clothes with washer safe <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">iron-ons</a> of the OWASP Juice Shop or CTF Extension logo!": "OWASP Juice Shop または CTF Extension ロゴの洗濯機対応<a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">アイロンワッペン</a>で、あなたの服をアップグレードしましょう！",
  "OWASP Juice Shop LEGO™ Tower": "OWASP Juice Shop LEGO™ タワー",
  "Want to host a Juice Shop CTF in style? Build <a href=\"https://github.com/OWASP/owasp-swag/blob/master/projects/juice-shop/lego/OWASP%20JuiceShop%20Pi-server%201.2.pdf\" target=\"_blank\">your own LEGO™ tower</a> which holds four Raspberry Pi 4 models with PoE HAT modules <a href=\"https://github.com/juice-shop/multi-juicer/blob/main/guides/raspberry-pi/raspberry-pi.md\" target=\"_blank\">running a MultiJuicer Kubernetes cluster</a>! Wire to a switch and connect to your network to have an out-of-the-box ready CTF up in no time!": "「OWASP Juice Shop CTFをスタイリッシュに開催したいですか？PoE HATモジュールを備えた4台のRaspberry Pi 4モデルを搭載し、<a href=\"https://github.com/juice-shop/multi-juicer/blob/main/guides/raspberry-pi/raspberry-pi.md\" target=\"_blank\">MultiJuicer Kubernetesクラスターを実行する独自のLEGO™タワー</a>を構築しましょう！スイッチに接続してネットワークに接続すれば、すぐに使えるCTFがすぐに手に入ります！」\n\nこのLEGO™タワーの組み立て説明書は<a href=\"https://github.com/OWASP/owasp-swag/blob/master/projects/juice-shop/lego/OWASP%20JuiceShop%20Pi-server%201.2.pdf\" target=\"_blank\">こちら</a>からダウンロードできます。",
  "OWASP Juice Shop Logo (3D-printed)": "OWASP Juice Shop ロゴ (3D プリント)",
  "This rare item was designed and handcrafted in Sweden. This is why it is so incredibly expensive despite its complete lack of purpose.": "この珍しいアイテムは、スウェーデンでデザインされ、手作りされました。\n\nそのため、まったくの無意味であるにもかかわらず、信じられないほど高価なのです。",
  "OWASP Juice Shop Magnets (16pcs)": "OWASP Juice Shop マグネット (16個入り)",
  "Your fridge will be even cooler with these OWASP Juice Shop or CTF Extension logo <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">magnets</a>!": "OWASP Juice Shop または CTF Extension ロゴの<a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">マグネット</a>で、あなたの冷蔵庫がよりクールに（カッコよく）なります！",
  "OWASP Juice Shop Mug": "OWASP Juice Shop マグカップ",
  "Black mug with regular logo on one side and CTF logo on the other! Your colleagues will envy you!": "ブラックマグカップ - 片面に標準ロゴ、反対側に CTF ロゴ！職場で注目の的になります！",
  "OWASP Juice Shop Sticker Page": "OWASP Juice Shop ステッカーページ",
  "Massive decoration opportunities with these OWASP Juice Shop or CTF Extension <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">sticker pages</a>! Each page has 16 stickers on it.": "OWASP Juice Shop または CTF Extension の<a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">ステッカーシート</a>で、デコレーションの可能性は無限大！各シートには16枚のステッカーが付いています。",
  "OWASP Juice Shop Sticker Single": "OWASP Juice Shop ステッカーシングル",
  "Super high-quality vinyl <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">sticker single</a> with the OWASP Juice Shop or CTF Extension logo! The ultimate laptop decal!": "OWASP Juice Shop または CTF Extension ロゴの超高品質ビニール<a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">単体ステッカー</a>！ラップトップデカールの決定版！",
  "OWASP Juice Shop T-Shirt": "OWASP Juice Shop Tシャツ",
  "Real fans wear it 24/7!": "真のファンは24時間365日着用しています！",
  "OWASP Juice Shop Temporary Tattoos (16pcs)": "OWASP Juice Shop タトゥーシール (16枚入り)",
  "Get one of these <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">temporary tattoos</a> to proudly wear the OWASP Juice Shop or CTF Extension logo on your skin! If you tweet a photo of yourself with the tattoo, you get a couple of our stickers for free! Please mention <a href=\"https://twitter.com/owasp_juiceshop\" target=\"_blank\"><code>@owasp_juiceshop</code></a> in your tweet!": "この<a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">タトゥーシール</a>で、OWASP Juice Shop や CTF Extension ロゴを肌に誇らしく貼ってみませんか！タトゥーの写真をツイートしていただければ、ステッカーを数枚無料でお送りします！ツイートには<a href=\"https://twitter.com/owasp_juiceshop\" target=\"_blank\"><code>@owasp_juiceshop</code></a>のメンションをお忘れなく！",
  "OWASP Juice Shop-CTF Velcro Patch": "OWASP Juice Shop-CTF マジックテープパッチ",
  "4x3.5\" embroidered patch with velcro backside. The ultimate decal for every tactical bag or backpack!": "4×3.5インチの刺繍パッチ、裏面マジックテープ付き。あらゆるタクティカルバッグやバックパックに最適なワッペン！",
  "OWASP SSL Advanced Forensic Tool (O-Saft)": "OWASP SSL Advanced Forensic Tool (O-Saft)",
  "O-Saft is an easy to use tool to show information about SSL certificate and tests the SSL connection according given list of ciphers and various SSL configurations. <a href=\"https://www.owasp.org/index.php/O-Saft\" target=\"_blank\">More...</a>": "O-Saft は、SSL証明書の情報を表示し、指定した暗号スイート一覧と各種SSL設定に基づいてSSL接続をテストする、使いやすいツールです。<a href=\"https://www.owasp.org/index.php/O-Saft\" target=\"_blank\">詳細…</a>",
  "OWASP Snakes and Ladders - Mobile Apps": "OWASP Snakes and Ladders - モバイルアプリ",
  "This amazing mobile app security awareness board game is <a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1970691216\">available for Tabletop Simulator on Steam Workshop</a> now!": "この素晴らしいモバイルアプリのセキュリティ啓発ボードゲームは、現在、<a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1970691216\">Steam WorkshopのTabletop Simulatorで入手可能</a>です！",
  "OWASP Snakes and Ladders - Web Applications": "OWASP Snakes and Ladders - ウェブアプリケーション",
  "This amazing web application security awareness board game is <a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1969196030\">available for Tabletop Simulator on Steam Workshop</a> now!": "この素晴らしいウェブアプリケーションセキュリティ啓発ボードゲームは、現在、<a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1969196030\">Steam WorkshopのTabletop Simulatorで入手可能</a>です！",
  "Orange Juice (1000ml)": "オレンジジュース (1000ml)",
  "Made from oranges hand-picked by Uncle Dittmeyer.": "ディットマイヤーおじさんが手摘みしたオレンジから作られています。",
  "Pwning OWASP Juice Shop": "Pwning OWASP Juice Shop",
  "<em>The official Companion Guide</em> by Björn Kimminich available <a href=\"https://leanpub.com/juice-shop\">for free on LeanPub</a> and also <a href=\"https://pwning.owasp-juice.shop\">readable online</a>!": "ビョルン・キミニッヒによる<em>The official Companion Guide</em>は、<a href=\"https://leanpub.com/juice-shop\">LeanPubで無料で入手</a>でき、<a href=\"https://pwning.owasp-juice.shop\">オンラインでも読むことができます</a>。",
  "Quince Juice (1000ml)": "カリンジュース (1000ml)",
  "Juice of the <em>Cydonia oblonga</em> fruit. Not exactly sweet but rich in Vitamin C.": "<em>Cydonia oblonga</em> の果汁。甘みは強くありませんが、ビタミンCが豊富です。",
  "Raspberry Juice (1000ml)": "ラズベリージュース (1000ml)",
  "Made from blended Raspberry Pi, water and sugar.": "ブレンドした Raspberry Pi、水、砂糖から作られています。",
  "Strawberry Juice (500ml)": "イチゴジュース (500ml)",
  "Sweet & tasty!": "甘くておいしい！",
  "Woodruff Syrup \"Forest Master X-Treme\"": "ウッドラフシロップ \"Forest Master X-Treme\"",
  "Harvested and manufactured in the Black Forest, Germany. Can cause hyperactive behavior in children. Can cause permanent green tongue when consumed undiluted.": "ドイツのシュヴァルツヴァルト（黒い森）地方で収穫・製造。お子様に過度な行動を引き起こす場合があります。希釈せずに飲用すると舌が永続的に緑色になる恐れがあります。",
  "Find the carefully hidden 'Score Board' page.": "巧妙に隠された「スコアボード」ページを見つけます。",
  "Try to find a reference or clue behind the scenes. Or simply guess what URL the Score Board might have.": "隠された参照またはヒントを見つけてください。または、スコアボードのURLを推測してください。",
  "Perform a <i>persisted</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> without using the frontend application at all.": "フロントエンドアプリケーションをまったく使用せずに、<i>持続型</i>XSS攻撃を <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> で実行します。",
  "You need to work with the server-side API directly. Try different HTTP verbs on different entities exposed through the API.": "サーバーサイドAPIを直接操作する必要があります。APIを通して公開されている異なるエンティティで異なるHTTP動詞を試してみてください。",
  "Gain access to any access log file of the server.": "サーバーの任意のアクセスログファイルにアクセスしてください。",
  "Who would want a server access log to be accessible through a web application?": "サーバーアクセスログをWebアプリケーションを通じて公開するべきではありません。",
  "Register as a user with administrator privileges.": "管理者権限を持つユーザーとして登録してください。",
  "You have to assign the unassignable.": "割り当てられていないものを割り当てる必要があります。",
  "Access the administration section of the store.": "ストアの管理機能にアクセスします。",
  "It is just slightly harder to find than the score board link.": "スコアボードのリンクよりも見つけるのが少し難しいです。",
  "Overwrite the <a href=\"/ftp/legal.md\">Legal Information</a> file.": "<a href=\"/ftp/legal.md\">Legal Information</a>ファイルを上書きします。",
  "Look out for a tweet praising new functionality of the web shop. Then find a third party vulnerability associated with it.": "ウェブショップの新しい機能を称賛するツイートを探してください。その後、それに関連付けられたサードパーティの脆弱性を見つけてください。",
  "Reset the password of Bjoern's OWASP account via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "<a href=\"/#/forgot-password\">パスワード忘れた場合</a>のメカニズムからセキュリティの質問に対する<i>元々の答</i>を使って、BjoernのOWASPアカウントのパスワードをリセットしてください。",
  "Hints to the answer to Bjoern’s question can be found by looking him up on the Internet.": "Hints to the answer to Bjoern’s question can be found by looking him up on the Internet.",
  "Learn about the Token Sale before its official announcement.": "公式発表の前にトークンセールについて学びましょう。",
  "The developers truly believe in \"Security through Obscurity\" over actual access restrictions.": "これらの開発者は、実際のアクセス制限よりも「隠蔽によるセキュリティ」を信じこんでいます。",
  "Take over the wallet containing our official Soul Bound Token (NFT).": "私たちの公式 Soul Bound Token (NFT) が入っているウォレットを乗っ取る。",
  "Find the seed phrase posted accidentally.": "うっかり投稿されたシードフレーズを見つける。",
  "Mint the Honey Pot NFT by gathering BEEs from the bee haven.": "Bee Haven から BEE を集めて、Honey Pot NFT をミントする。",
  "Discover NFT wonders among the captivating visual memories.": "心を奪われるような視覚的な思い出の中から、NFT の素晴らしいものを発見しましょう。",
  "Withdraw more ETH from the new wallet than you deposited.": "新しいウォレットから、入金した額よりも多くの ETH を出金する。",
  "Try to exploit the contract of the wallet.": "コントラクトのウォレットを悪用する。",
  "Find an accidentally deployed code sandbox for writing smart contracts on the fly.": "スマートコントラクトをオンザフライで書くために、たまたまデプロイされたコードサンドボックスを見つける。",
  "It is just as easy as finding the Score Board.": "スコアボードを見つけるのと同じくらい簡単です。",
  "Perform a Remote Code Execution that would keep a less hardened application busy <em>forever</em>.": "リモートコード実行 (RCE) の攻撃を行い、堅牢化されていないアプリケーションに対して<em>永遠に</em>負荷をかけ続けましょう。",
  "The feature you need to exploit for this challenge is not directly advertised anywhere.": "このチャレンジで攻撃すべき機能は、どこにも明記されていません。",
  "Submit 10 or more customer feedbacks within 20 seconds.": "20秒以内に10以上の顧客フィードバックを送信してください。",
  "After finding a CAPTCHA bypass, write a script that automates feedback submission. Or open many browser tabs and be really quick.": "CAPTCHAバイパスを見つけた後、フィードバックの送信を自動化するスクリプトを作成してください。または、多くのブラウザのタブを開いてから迅速に操作してください。",
  "Change Bender's password into <i>slurmCl4ssic</i> without using SQL Injection or Forgot Password.": "SQLインジェクションやパスワード再設定を使用せずにBenderのパスワードを<i>slurmCl4ssic</i>に変更します。",
  "In previous releases this challenge was wrongly accused of being based on CSRF.": "以前のリリースでは、このチャレンジはCSRFに基づいていると非難されましたが、それは正しくありません。",
  "Order the Christmas special offer of 2014.": "2014年のクリスマススペシャルをご注文ください。",
  "Find out how the application handles unavailable products and try to find a loophole.": "アプリケーションが在庫切れの製品をどのように処理するか確認したら、抜け穴を探しましょう。",
  "Bypass the Content Security Policy and perform an XSS attack with <code>&lt;script&gt;alert(`xss`)&lt;/script&gt;</code> on a legacy page within the application.": "Content Security Policyをバイパスして、アプリケーション内のレガシーページで<code>&lt;script&gt;alert(`xss`)&lt;/script&gt;</code> を使ってXSS攻撃を実行します。",
  "What is even \"better\" than a legacy page with a homegrown RegEx sanitizer? Having CSP injection issues on the exact same page as well!": "レガシーなページと自作のRegExサニタイザーの組み合わせ以上に「ステキな」ことがあります。そのページにはなんとCSPインジェクションもあるんです。",
  "Perform a <i>persisted</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> bypassing a <i>client-side</i> security mechanism.": "<i>持続型</i>XSS攻撃を <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> で実行し、<i>クライアントサイド</i>のセキュリティメカニズムをバイパスします。",
  "There are only some input fields in the Juice Shop forms that validate their input.": "There are only some input fields in the Juice Shop forms that validate their input.",
  "Access a confidential document.": "機密文書にアクセスします。",
  "Analyze and tamper with links in the application that deliver a file directly.": "アプリケーション内でファイルを直接配信するリンクを分析して改ざんします。",
  "Perform a <i>DOM</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code>.": "<i>DOM</i>型XSS攻撃を <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> により実行します。",
  "Look for an input field where its content appears in the HTML when its form is submitted.": "送信された内容がHTMLに表示されてしまう入力フィールドを探します。",
  "Exfiltrate the entire DB schema definition via SQL Injection.": "SQLインジェクションを介して、DBスキーマ全体の定義を抽出します。",
  "Find out where this information could come from. Then craft an attack string against an endpoint that offers an unnecessary way to filter data.": "Find out where this information could come from. Then craft an attack string against an endpoint that offers an unnecessary way to filter data.",
  "Use a deprecated B2B interface that was not properly shut down.": "適切にシャットダウンされなかった非推奨のB2Bインターフェースを使用してください。",
  "The developers who disabled the interface think they could go invisible by just closing their eyes.": "インターフェイスを無効にした開発者は、目を閉じるだけで周りから自分が見えなくなると考えています。",
  "Find the hidden <a href=\"https://en.wikipedia.org/wiki/Easter_egg_(media)\" target=\"_blank\">easter egg</a>.": "隠された<a href=\"https://en.wikipedia.org/wiki/Easter_egg_(media)\" target=\"_blank\">イースターエッグ</a>を見つけ出す。",
  "If you solved one of the four file access challenges, you already know where to find the easter egg.": "If you solved one of the four file access challenges, you already know where to find the easter egg.",
  "Perform an unwanted information disclosure by accessing data cross-domain.": "望まれない情報漏えいを、クロスドメインでデータにアクセスして実行する。",
  "Try to find and attack an endpoint that responds with user information. SQL Injection is not the solution here.": "ユーザー情報を返すエンドポイントを見つけ、攻撃する。SQLインジェクションはここでは解決策ではありません。",
  "Register a user with an empty email and password.": "メールアドレスとパスワードが空のユーザーを登録します。",
  "Consider intercepting and playing with the request payload.": "リクエストペイロードを傍受し、操作することを検討する。",
  "Log in with the (non-existing) accountant <i>acc0unt4nt@juice-sh.op</i> without ever registering that user.": "(まだ登録されていない)アカウントである  <i>acc0unt4nt@juice-sh.op</i> を使って、ユーザ登録することなしにログインしてみてください。",
  "Try to create the needed user \"out of thin air\".": "必要とされているユーザ\"out of thin air\"を作成してみてください",
  "Provoke an error that is neither very gracefully nor consistently handled.": "一貫性をもって適切に処理されていないエラーを引き起こす。",
  "Try to submit bad input to forms. Alternatively tamper with URL paths or parameters.": "フォームに不正な入力を送信する。または、URLのパスやパラメータを改ざんする。",
  "Successfully redeem an expired campaign coupon code.": "期限切れのキャンペーンクーポンコードを正常に引き換えました。",
  "Try to identify past special event or holiday campaigns of the shop first.": "まず、このショップが過去に行った特別なイベントやホリデーキャンペーンを特定してみましょう。",
  "First you should find out how the languages are technically changed in the user interface.": "First you should find out how the languages are technically changed in the user interface.",
  "Brute force is not the only option for this challenge, but a perfectly viable one.": "この課題を解く方法はブルートフォース攻撃だけではありませんが、それでも十分に有効な手段です。",
  "Get rid of all 5-star customer feedback.": "星5つのカスタマーレビューをすべて削除する。",
  "Once you found admin section of the application, this challenge is almost trivial.": "アプリケーションの管理者セクションを見つけたら、このチャレンジはほぼ自明です",
  "Forge a coupon code that gives you a discount of at least 80%.": "80%以上の割引が適用されるクーポンコードを偽造する。",
  "Try either a) a knowledgeable brute force attack or b) reverse engineering or c) some research in the cloud.": "a) 知識に基づいたブルートフォース攻撃\nb) リバースエンジニアリング\nc) クラウドで何らかの調査\nいずれかを試してください。",
  "Post some feedback in another user's name.": "他のユーザー名でフィードバックを投稿する。",
  "You can solve this by tampering with the user interface or by intercepting the communication with the RESTful backend.": "UIを改ざんするか、RESTfulバックエンドとの通信を傍受することで、これを解決できます。",
  "Post a product review as another user or edit any user's existing review.": "他のユーザーとして商品レビューを投稿するか、既存のユーザーレビューを編集する。",
  "Observe the flow of product review posting and editing and see if you can exploit it.": "商品レビューの投稿と編集の流れを観察し、それを悪用できないか試してみてください。",
  "Forge an almost properly RSA-signed JWT token that impersonates the (non-existing) user <i>rsa_lord@juice-sh.op</i>.": "不完全ながらも適切にRSA署名された JWT トークンを偽造し、存在しないユーザー<i>rsa_lord@juice-sh.op</i>になりすます。",
  " <em>(This challenge is <strong>potentially harmful</strong> on Windows!)</em>": "<em>（このチャレンジは Windows では<strong>危険な可能性</strong>があります！）</em>",
  "This challenge is explicitly not about acquiring the RSA private key used for JWT signing.": "このチャレンジは、JWT署名に使用されるRSA秘密鍵の取得を目的としていません。",
  "Access a developer's forgotten backup file.": "開発者の忘れられたバックアップファイルにアクセスする。",
  "You need to trick a security mechanism into thinking that the file you want has a valid file type.": "これは、セキュリティメカニズムを欺いて、目的のファイルが有効なファイル形式であると認識させる必要があるチャレンジです。",
  "Access a salesman's forgotten backup file.": "営業担当者の忘れられたバックアップファイルにアクセスする。",
  "<a href=\"/#/contact\">Inform the shop</a> about a <i>typosquatting</i> imposter that dug itself deep into the frontend. (Mention the exact name of the culprit)": "<a href=\"/#/contact\">ショップに報告する</a>: フロントエンドの奥深くに潜り込んだ<i>タイポスクワッティング</i>の偽者について。 （犯人の正確な名前を明記する）",
  "This challenge has nothing to do with mistyping web domains. There is no conveniently misplaced file helping you with this one either. Or is there?": "このチャレンジは、ウェブドメインのタイプミスとは関係ありません。都合よく配置されたファイルがこのチャレンジを助けることもありません。本当にそうでしょうか？",
  "Log in with Chris' erased user account.": "Chris の削除されたユーザーアカウントでログインする。",
  "Turns out that something is technically and legally wrong with the implementation of the \"right to be forgotten\" for users.": "ユーザーの「忘れられる権利」の実装には、技術的にも法的にも何か問題があることが判明しました。",
  "Steal someone else's personal data without using Injection.": "他のユーザーの個人情報を、インジェクションを使わずに盗む。",
  "Trick the regular Data Export to give you more than actually belongs to you.": "通常のデータエクスポートを騙して、自分のものではないデータを取得する。",
  "Perform a <i>persisted</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> through an HTTP header.": "HTTPヘッダーを介して、<code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code>で<i>持続的 (persisted)</i>XSS攻撃を実行する。",
  "Finding a piece of displayed information that could originate from an HTTP header is part of this challenge.": "このチャレンジを解くには、表示されている情報の一部がHTTPヘッダーから来ている可能性を突き止める必要があります。",
  "Solve challenge #999. Unfortunately, this challenge does not exist.": "お探しのチャレンジ「#999」は存在しません。",
  "You need to trick the hacking progress persistence feature into thinking you solved challenge #999.": "OWASP Juice Shop のチャレンジ「#999」を解決したと、ハッキング進捗の永続化機能をだます。",
  "Dumpster dive the Internet for a leaked password and log in to the original user account it belongs to. (Creating a new account with the same password does not qualify as a solution.)": "インターネットのゴミ箱を漁り、流出したパスワードを見つけて、そのパスワードが属する元のユーザーアカウントにログインする。（同じパスワードで新しいアカウントを作成することは、解決策として認められません。）",
  "As the challenge name implies, your task is to find some leaked access logs which happen to have a fairly common format.": "As the challenge name implies, your task is to find some leaked access logs which happen to have a fairly common format.",
  "Identify an unsafe product that was removed from the shop and <a href=\"/#/contact\">inform the shop</a> which ingredients are dangerous.": "削除された安全ではない製品を特定し、その製品のどの成分が危険であるかを<a href=\"/#/contact\">ショップに報告</a>する。",
  "Your own SQLi and someone else's Ctrl-V will be your accomplices in this challenge!": "この課題では、あなた自身のSQLインジェクションと、他の誰かのCtrl-V（貼り付け）があなたの共犯者となります。",
  "<a href=\"/#/contact\">Inform the shop</a> about a <i>typosquatting</i> trick it has been a victim of at least in <code>v6.2.0-SNAPSHOT</code>. (Mention the exact name of the culprit)": "少なくとも<code>v6.2.0-SNAPSHOT</code>で被害を受けた<i>タイポスクワッティング</i>攻撃について、<a href=\"/#/contact\">ショップに報告</a>してください。（問題のパッケージ名を正確に記載すること）",
  "This challenge has nothing to do with mistyping web domains. Investigate the forgotten developer's backup file instead.": "このチャレンジはWebドメインの入力ミスとは関係ありません。代わりに、忘れられた開発者のバックアップファイルを調査してください。",
  "Log in with the administrator's user account.": "管理者のユーザーアカウントでログインします。",
  "The challenge description probably gave away what form you should attack.": "The challenge description probably gave away what form you should attack.",
  "Log in with Amy's original user credentials. (This could take 93.83 billion trillion trillion centuries to brute force, but luckily she did not read the \"One Important Final Note\")": "Amyの元のユーザー認証情報でログインしてください。（これをブルートフォースするには933億兆兆世紀かかる可能性がありますが、幸い彼女は「重要な最終注意事項」を読んでいませんでした）",
  "This challenge will make you go after a needle in a haystack.": "このチャレンジは、干し草の中から針を探すような難題です。",
  "Log in with Bender's user account.": "Bender のユーザーアカウントでログインします。",
  "Log in with Bjoern's Gmail account <i>without</i> previously changing his password, applying SQL Injection, or hacking his Google account.": "Bjoern のパスワード変更、SQLインジェクション攻撃、Google アカウントハッキングを<i>使用せずに</i>、Bjoern の Gmail アカウントでログインしてください。",
  "The security flaw behind this challenge is 100% OWASP Juice Shop's fault and 0% Google's.": "このチャレンジの背後にあるセキュリティ上の欠陥は、100% OWASP Juice Shopの責任であり、Googleには一切責任はありません。",
  "Log in with Jim's user account.": "Jimのユーザーアカウントでログインします。",
  "Log in with MC SafeSearch's original user credentials without applying SQL Injection or any other bypass.": "SQL Injection などのバイパスを適用せずに、MC SafeSearch のオリジナルユーザー資格情報でログインします。",
  "MC SafeSearch is a rapper who produced the song \"Protect Ya' Passwordz\" which explains password & sensitive data protection very nicely.": "MC SafeSearch is a rapper who produced the song \"Protect Ya' Passwordz\" which explains password & sensitive data protection very nicely.",
  "Log in with the support team's original user credentials without applying SQL Injection or any other bypass.": "SQL Injection などのバイパスを適用せずに、サポートチームのオリジナルユーザー資格情報を使用してログインします。",
  "The underlying flaw of this challenge is a lot more human error than technical weakness.": "このチャレンジの本質的な脆弱性は、技術的弱点よりも人的エラーに起因する部分がはるかに大きいです。",
  "Put an additional product into another user's shopping basket.": "別のユーザーのショッピングカートに商品を追加します。",
  "Have an eye on the HTTP traffic while placing products in the shopping basket.": "Have an eye on the HTTP traffic while placing products in the shopping basket.",
  "Access a misplaced <a href=\"https://github.com/Neo23x0/sigma\">SIEM signature</a> file.": "誤った <a href=\"https://github.com/Neo23x0/sigma\">SIEM 署名</a> ファイルにアクセスします。",
  "Like any review at least three times as the same user.": "同一ユーザーとして、任意のレビューを少なくとも3回「いいね」してください。",
  "Punctuality is the politeness of kings.": "時間厳守は王の礼儀である。",
  "Apply some advanced cryptanalysis to find <i>the real</i> easter egg.": "高度な暗号解読を適用して、<i>真の</i>イースターエッグを見つけてください。",
  "You might have to peel through several layers of tough-as-nails encryption for this challenge.": "このチャレンジでは、鉄壁のような暗号化の複数の層を剥がしていく必要があるかもしれません。",
  "Let the server sleep for some time. (It has done more than enough hard work for you)": "サーバーをしばらくスリープ状態にしてください。（あなたのために十分すぎるほど働いてくれました）",
  "This challenge is essentially a stripped-down Denial of Service (DoS) attack.": "このチャレンジは本質的に簡略化されたDoS（Denial of Service）攻撃です。",
  "All your orders are belong to us! Even the ones which don't.": "あなたの注文はすべて我々のものだ！そうでないものも含めて。",
  "Take a close look on how the $where query operator works in MongoDB.": "MongoDBの$whereクエリオペレータがどのように動作するかを詳しく調べてください。",
  "Update multiple product reviews at the same time.": "複数の製品レビューを同時に更新します。",
  "Take a close look on how the equivalent of UPDATE-statements in MongoDB work.": "MongoDBにおけるUPDATE文相当の処理がどのように動作するかを詳しく調べてください。",
  "Let us redirect you to one of our crypto currency addresses which are not promoted any longer.": "現在は使用されていない暗号通貨アドレスにリダイレクトします。",
  "When removing references to those addresses from the code the developers have been a bit sloppy.": "When removing references to those addresses from the code the developers have been a bit sloppy.",
  "Log in with the administrator's user credentials without previously changing them or applying SQL Injection.": "事前にパスワードを変更したり、SQLインジェクションを適用したりすることなく、管理者のユーザー認証情報でログインしてください。",
  "This challenge can be solved with three different approaches.": "This challenge can be solved with three different approaches.",
  "Place an order that makes you rich.": "あなたを金持ちにする注文を行ってください。",
  "You literally need to make the shop owe you any amount of money.": "文字通り、ショップがあなたに任意の額の借金を作るようにする必要があります。",
  "<i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><!--IvLuRfBJYlmStf9XfL6ckJFngyd9LfV1JaaN/KRTPQPidTuJ7FR+D/nkWJUF+0xUF07CeCeqYfxq+OJVVa0gNbqgYkUNvn//UbE7e95C+6e+7GtdpqJ8mqm4WcPvUGIUxmGLTTAC2+G9UuFCD1DUjg==--> <a href=\"https://blockchain.info/address/1AbKfgvw9psQ41NbLi8kufDQTezwG8DRZm\" target=\"_blank\"><i class=\"fab fa-btc fa-sm\"></i> Unlock Premium Challenge</a> to access exclusive content.": "<i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><!--IvLuRfBJYlmStf9XfL6ckJFngyd9LfV1JaaN/KRTPQPidTuJ7FR+D/nkWJUF+0xUF07CeCeqYfxq+OJVVa0gNbqgYkUNvn//UbE7e95C+6e+7GtdpqJ8mqm4WcPvUGIUxmGLTTAC2+G9UuFCD1DUjg==--> <a href=\"https://blockchain.info/address/1AbKfgvw9psQ41NbLi8kufDQTezwG8DRZm\" target=\"_blank\"><i class=\"fab fa-btc fa-sm\"></i> プレミアムチャレンジをアンロック</a>して、限定コンテンツにアクセスしてください。",
  "You do not have to pay anything to unlock this challenge! Nonetheless, donations are very much appreciated.": "このチャレンジのアンロックに料金は一切かかりません！でも寄付してもらえると嬉しいです。",
  "Read our privacy policy.": "当社のプライバシーポリシーをお読みください。",
  "We won't even ask you to confirm that you did. Just read it. Please. Pretty please.": "読んだかどうかの確認すら求めません。ただ読んでください。お願いします。どうかお願いします。",
  "Prove that you actually read our privacy policy.": "プライバシーポリシーを読んだことを証明する。",
  "Only by visiting a special URL you can confirm that you read it carefully.": "特別なURLにアクセスすることでのみ、あなたがそれを注意深く読んだことを確認できます。",
  "Change the <code>href</code> of the link within the <a href=\"/#/search?q=OWASP SSL Advanced Forensic Tool (O-Saft)\">OWASP SSL Advanced Forensic Tool (O-Saft)</a> product description into <i>https://owasp.slack.com</i>.": "<a href=\"/#/search?q=OWASP SSL Advanced Forensic Tool (O-Saft)\">OWASP SSL Advanced Forensic Tool (O-Saft)</a> 商品説明内のリンクの<code>href</code>を<i>https://owasp.slack.com</i>に変更してください。",
  "Theoretically there are three possible ways to beat this challenge: a) broken admin functionality, b) holes in RESTful API or c) possibility for SQL Injection.": "Theoretically there are three possible ways to beat this challenge: a) broken admin functionality, b) holes in RESTful API or c) possibility for SQL Injection.",
  "Perform a <i>reflected</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code>.": "<code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code>を使用して<i>reflected</i> XSS攻撃を実行してください。",
  "Look for a url parameter where its value appears in the page it is leading to.": "その値が導かれるページに表示されるURLパラメータを探してください。",
  "Follow the DRY principle while registering a user.": "ユーザーを登録しながらDRYの原則に従ってください。",
  "You can solve this by cleverly interacting with the UI or bypassing it altogether.": "UIと巧妙に相互作用したり、完全にバイパスしたりすることでこれを解決できます。",
  "Reset Bender's password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "Bender のパスワードを、<a href=\"/#/forgot-password\">パスワードを忘れた場合</a>の機能で、彼のセキュリティ質問に対する<i>元の答え</i>を使ってリセットする。",
  "If you have no idea who Bender is, please put down this book right now and watch the first episodes of Futurama before you come back.": "If you have no idea who Bender is, please put down this book right now and watch the first episodes of Futurama before you come back.",
  "Reset the password of Bjoern's internal account via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "Bjoern の内部アカウントのパスワードを、<a href=\"/#/forgot-password\">パスワードを忘れた場合</a>のメカニズムを介して、彼のセキュリティ質問に対する<i>元の答え</i>を使ってリセットする。",
  "Nothing a little bit of Facebook stalking couldn't reveal. Might involve a historical twist.": "ほんの少し Facebook を調べればわかることだ。歴史的なひねりが隠されているかもしれない。",
  "Reset Jim's password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "Jimのパスワードを、<a href=\"/#/forgot-password\">パスワードを忘れた場合</a>の機能で、彼のセキュリティ質問に対する<i>元の答え</i>を使ってリセットする。",
  "The hardest part of this challenge is actually to find out who Jim actually is.": "The hardest part of this challenge is actually to find out who Jim actually is.",
  "Reset Morty's password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>his obfuscated answer</i> to his security question.": "Mortyのパスワードを、<a href=\"/#/forgot-password\">パスワードを忘れた場合</a>の機能で、彼のセキュリティ質問に対する<i>難読化された答え</i>を使ってリセットする。",
  "Finding out who Morty actually is, will help to reduce the solution space.": "Finding out who Morty actually is, will help to reduce the solution space.",
  "Deprive the shop of earnings by downloading the blueprint for one of its products.": "製品の設計図をダウンロードし、お店の収益を奪う。",
  "The product you might want to give a closer look is the OWASP Juice Shop Logo (3D-printed).": "より詳しく調べるべき製品は、OWASP Juice Shop ロゴ (3Dプリント)かもしれません。",
  "Request a hidden resource on server through server.": "サーバー上で、隠されたリソースをサーバー経由でリクエストする。",
  "Reverse engineering something bad can make good things happen.": "悪いものをリバースエンジニアリングすることで、良いことが起こるかもしれない。",
  "Infect the server with juicy malware by abusing arbitrary command execution.": "サーバーで任意のコマンド実行を悪用し、ジューシーなマルウェアを感染させる。",
  "\"SSTi\" is a clear indicator that this has nothing to do with anything Angular. Also, make sure to use only our non-malicious malware.": "このチャレンジはAngularとは無関係であることを、\"SSTi\" が明確に示しています。また、必ず私たちの悪意のないマルウェアのみを使用してください。",
  "Behave like any \"white-hat\" should before getting into the action.": "攻撃に取り掛かる前に、ホワイトハットがとるべき行動をとりなさい。",
  "This challenge asks you to act like an ethical hacker.": "This challenge asks you to act like an ethical hacker.",
  "Perform a <i>persisted</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> bypassing a <i>server-side</i> security mechanism.": "<i>サーバーサイド</i>セキュリティメカニズムをバイパスして、<i>持続的な</i>XSS攻撃を<code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code>で実行する。\n",
  "The \"Comment\" field in the \"Customer Feedback\" screen is where you want to put your focus on.": "\"お客様の声\"画面にある \"コメント\" フィールドに焦点を当てる必要があります。",
  "<a href=\"/#/contact\">Rat out</a> a notorious character hiding in plain sight in the shop. (Mention the exact name of the character)": "ショップに堂々と潜んでいる悪名高いキャラクターについて、<a href=\"/#/contact\">ショップに報告</a>する。（そのキャラクターの正確な名前を明記する）",
  "There is not the slightest chance that you can spot the hidden character with the naked eye.": "There is not the slightest chance that you can spot the hidden character with the naked eye.",
  "Perform a Remote Code Execution that occupies the server for a while without using infinite loops.": "無限ループを使わずに、サーバーを一定時間占有するリモートコード実行を行う。",
  "Your attack payload must not trigger the protection against too many iterations and infinite loops.": "Your attack payload must not trigger the protection against too many iterations and infinite loops.",
  "<a href=\"/#/contact\">Inform the development team</a> about a danger to some of <em>their</em> credentials. (Send them the URL of the <em>original report</em> or an assigned CVE or another identifier of this vulnerability)": "<em>彼ら自身</em>の認証情報に対する危険性を<a href=\"/#/contact\">開発チームに知らせる</a>。（<em>元のレポート</em>のURL、割り当てられたCVE、またはこの脆弱性の別の識別子を送る）",
  "This vulnerability will not affect any customer of the shop. It is aimed exclusively at its developers.": "この脆弱性は、ショップの顧客には影響しません。開発者のみを対象としています。\n",
  "Solve the 2FA challenge for user \"wurstbrot\". (Disabling, bypassing or overwriting his 2FA settings does not count as a solution)": "ユーザー「wurstbrot」の2要素認証 (2FA) チャレンジを解決します。（2FA設定の無効化、バイパス、または上書きは解決策とは見なされません）",
  "The 2FA implementation requires to store a secret for every user. You will need to find a way to access this secret in order to solve this challenge.": "2要素認証 (2FA) の実装では、すべてのユーザーにシークレットを保存する必要があります。このチャレンジを解決するには、このシークレットにアクセスする方法を見つける必要があります。",
  "Forge an essentially unsigned JWT token that impersonates the (non-existing) user <i>jwtn3d@juice-sh.op</i>.": "意図的に署名されていないJWTトークンを偽造し、存在しないユーザー <i>jwtn3d@juice-sh.op</i>になりすます。",
  "This challenge exploits a weird option that is supported when signing tokens with JWT.": "このチャレンジは、JWTでトークンに署名する際にサポートされている、奇妙なオプションを悪用します。",
  "Upload a file larger than 100 kB.": "100 KBより大きいファイルをアップロードしてください。",
  "You can attach a small file to the \"Complaint\" form. Investigate how this upload actually works.": "「苦情」フォームには小さなファイルを添付できます。このアップロードが実際にどのように機能するかを調査してください。",
  "Upload a file that has no .pdf or .zip extension.": "拡張子が .pdf または .zip ではないファイルをアップロードする。",
  "You can attach a PDF or ZIP file to the \"Complaint\" form. Investigate how this upload actually works.": "「苦情」フォームには PDF または ZIPファイルを添付できます。このアップロードが実際にどのように機能するかを調査してください。",
  "Retrieve a list of all user credentials via SQL Injection.": "SQL インジェクションを介してすべてのユーザー資格情報のリストを取得する。",
  "Gather information on where user data is stored and how it is addressed. Then craft a corresponding UNION SELECT attack.": "ユーザーデータの保存場所と対処方法に関する情報を収集し、対応するUNION SELECT攻撃を作成する。",
  "Embed an XSS payload <code>&lt;/script&gt;&lt;script&gt;alert(`xss`)&lt;/script&gt;</code> into our promo video.": "XSS ペイロード <code>&lt;/script&gt;&lt;script&gt;alert(`xss`)&lt;/script&gt;</code> をプロモーションビデオに埋め込みました。",
  "Without utilizing the vulnerability behind another ⭐⭐⭐⭐⭐⭐ challenge it is not possible to plant the XSS payload for this challenge.": "Without utilizing the vulnerability behind another ⭐⭐⭐⭐⭐⭐ challenge it is not possible to plant the XSS payload for this challenge.",
  "View another user's shopping basket.": "他のユーザーのショッピングカートを表示する。",
  "Try out all existing functionality involving the shopping basket while having an eye on the HTTP traffic.": "Try out all existing functionality involving the shopping basket while having an eye on the HTTP traffic.",
  "<a href=\"/#/contact\">Inform the shop</a> about a vulnerable library it is using. (Mention the exact library name and version in your comment)": "使用している脆弱なライブラリについて<a href=\"/#/contact\">ショップに知らせる</a>。（コメントに正確なライブラリ名とバージョンを記載する）",
  "Report one of two possible answers via the \"Customer Feedback\" form. Do not forget to submit the library's version as well.": "二つの選択肢のうち、どちらか一つの回答を「お客様の声」フォームから報告してください。ライブラリのバージョンを忘れずに提出してください。",
  "<a href=\"/#/contact\">Inform the shop</a> about an algorithm or library it should definitely not use the way it does.": "絶対に使うべきではないアルゴリズムやライブラリの使い方について<a href=\"/#/contact\">ショップに知らせる</a>。",
  "Report one of five possible answers via the \"Customer Feedback\" form.": "Report one of five possible answers via the \"Customer Feedback\" form.",
  "Enforce a redirect to a page you are not supposed to redirect to.": "リダイレクトしないページへのリダイレクトを強制する。",
  "You have to find a way to beat the allowlist of allowed redirect URLs.": "許可されたリダイレクトURLの許容リストを破る方法を見つける必要があります。",
  "Retrieve the content of <code>C:\\Windows\\system.ini</code> or <code>/etc/passwd</code> from the server.": "<code>C:\\Windows\\system.ini</code> または <code>/etc/passwd</code> の内容をサーバーから取得します。",
  "The leverage point for this challenge is the deprecated B2B interface.": "このチャレンジのレバレッジポイントは非推奨の B2B インタフェースです。",
  "Give the server something to chew on for quite a while.": "サーバーにしばらくの間、処理させ続けるものを提供してください。",
  "It is not as easy as sending a large amount of data directly to the deprecated B2B interface.": "これは、非推奨のB2Bインターフェースに大量のデータを直接送信するほど簡単ではありません。",
  "Drop some explosive data into a vulnerable file-handling endpoint.": "脆弱なファイル処理のエンドポイントに、爆発的なデータをドロップする。",
  "This one is actually similar to the XXE DoS challenge in every way except the data format being (ab)used.": "これは、データを悪用するフォーマットが異なる点を除けば、XXE DoSチャレンジとあらゆる面で似ています。",
  "Give a devastating zero-star feedback to the store.": "店舗に対して、手加減なしの星ゼロのフィードバックを送ってください。",
  "Before you invest time bypassing the API, you might want to play around with the UI a bit.": "APIをバイパスするために時間を費やす前に、少しUIをいじってみるといいかもしれません。",
  "Retrieve the photo of Bjoern's cat in \"melee combat-mode\".": "Bjoern の猫が「接近戦モード」になっている写真を取得する。",
  "Check the Photo Wall for an image that could not be loaded correctly.": "画像の読み込みが正しく行われなかった Photo Wall の画像をチェックしてください。",
  "Stick <a href=\"https://cataas.com/cat\" target=\"_blank\">cute cross-domain kittens</a> all over our delivery boxes.": "弊社の配送箱全体に、<a href=\"https://cataas.com/cat\" target=\"_blank\">かわいいクロスドメインの子猫</a>を貼り付けてください。",
  "This challenge would formally have to be in several categories as the developers made multiple gaffes for this to be possible.": "このチャレンジは、複数のカテゴリーに分類されるべきでしょう。開発者は、この問題を引き起こすために複数の過ちを犯したからです。",
  "Find the endpoint that serves usage data to be scraped by a <a href=\"https://github.com/prometheus/prometheus\">popular monitoring system</a>.": "このチャレンジを解決するためには、<a href=\"https://github.com/prometheus/prometheus\">人気のあるモニタリングシステム</a>がデータを収集するために使用するエンドポイントを見つける必要があります。",
  "Try to guess what URL the endpoint might have.": "エンドポイントのURLを推測してください。",
  "Obtain a Deluxe Membership without paying for it.": "支払いをせずに「デラックスメンバーシップ」を獲得してください。",
  "Look closely at what happens when you attempt to upgrade your account.": "アカウントをアップグレードしようとすると何が起こるか、よく注意して見てください。",
  "Change the name of a user by performing Cross-Site Request Forgery from <a href=\"http://htmledit.squarefree.com\">another origin</a>.": "Cross-Site Request Forgery (CSRF) を使用して、<a href=\"http://htmledit.squarefree.com\">別のオリジン</a>からユーザーの名前を変更してください。",
  "Find a form which updates the username and then construct a malicious page in the online HTML editor. You probably need an older browser version for this.": "ユーザー名を更新するフォームを見つけ、オンラインHTMLエディターで悪意のあるページを構築してください。この操作には、おそらく古いブラウザバージョンが必要です。",
  "Use the bonus payload <code>&lt;iframe width=&quot;100%&quot; height=&quot;166&quot; scrolling=&quot;no&quot; frameborder=&quot;no&quot; allow=&quot;autoplay&quot; src=&quot;https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/771984076&amp;color=%23ff5500&amp;auto_play=true&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true&quot;&gt;&lt;/iframe&gt;</code> in the <i>DOM XSS</i> challenge.": "<i>DOM XSS</i>チャレンジで、ボーナスペイロードの<code>&lt;iframe width=&quot;100%&quot; height=&quot;166&quot; scrolling=&quot;no&quot; frameborder=&quot;no&quot; allow=&quot;autoplay&quot; src=&quot;https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/771984076&amp;color=%23ff5500&amp;auto_play=true&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true&quot;&gt;&lt;/iframe&gt;</code>を使用してください。",
  "First, solve the \"Perform a DOM XSS attack\" challenge.": "First, solve the \"Perform a DOM XSS attack\" challenge.",
  "Reset Uvogin's password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "Uvogin のセキュリティ質問に対する<i>元の答え</i>を使って、<a href=\"/#/forgot-password\">パスワードを忘れた場合</a>の仕組みから彼のパスワードをリセットしてください。\n\n",
  "You might have to do some OSINT on his social media personas to find out his honest answer to the security question.": "彼のセキュリティ質問に対する「誠実な」答えを見つけるために、彼のソーシャルメディアのペルソナに関して、いくつかのOSINT（オープンソース・インテリジェンス）を行う必要があるかもしれません。",
  "Determine the answer to John's security question by looking at an upload of him to the Photo Wall and use it to reset his password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism.": "John が Photo Wall にアップロードした写真から彼の「秘密の質問」の答えを特定し、それを使って<a href=\"/#/forgot-password\">パスワード忘れた</a>のメカニズムを介してパスワードをリセットしてください。",
  "Take a look at the meta data of the corresponding photo.": "対応する写真のメタデータを見てください。",
  "Determine the answer to Emma's security question by looking at an upload of her to the Photo Wall and use it to reset her password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism.": "Emma が Photo Wall にアップロードした写真から彼女の「秘密の質問」の答えを特定し、それを使って<a href=\"/#/forgot-password\">パスワード忘れた</a>のメカニズムを介してパスワードをリセットしてください。",
  "Take a look at the details in the photo to determine the location of where it was taken.": "写真を詳しく見て、撮影された場所を特定してください。",
  "Permanently disable the support chatbot so that it can no longer answer customer queries.": "サポートチャットボットを恒久的に無効化し、顧客からの問い合わせに回答できないようにする。",
  "Think of a way to get a hold of the internal workings on the chatbot API.": "チャットボットAPIの内部仕様を入手する方法を見つけ出す。",
  "Bypass a security control with a <a href=\"https://hakipedia.com/index.php/Poison_Null_Byte\">Poison Null Byte</a> to access a file not meant for your eyes.": "<a href=\"https://hakipedia.com/index.php/Poison_Null_Byte\">Poison Null Byte</a>を使用してセキュリティコントロールをバイパスし、閲覧許可のないファイルにアクセスする。",
  "Analyze and tamper with links in the application until you get to an unprotected directory listing.": "Analyze and tamper with links in the application until you get to an unprotected directory listing.",
  "Receive a coupon code from the support chatbot.": "サポートチャットボットからクーポンコードを受け取る。",
  "The bot is reluctant to give you a coupon as it’s coming up with various excuses for not giving you one.": "The bot is reluctant to give you a coupon as it’s coming up with various excuses for not giving you one.",
  "Gain read access to an arbitrary local file on the web server.": "Web サーバー上の任意のローカル ファイルへの読み取りアクセスを得る。",
  "You should read up on vulnerabilities in popular NodeJs template engines.": "一般的なNodeJsテンプレートエンジンの脆弱性について読むべきです。",
  "Close multiple \"Challenge solved\"-notifications in one go.": "複数の「チャレンジ達成」通知を一度に閉じる。",
  "Either check the official documentation or inspect a notification UI element directly.": "公式ドキュメントを確認するか、通知UI要素を直接調べてみてください。",
  "The Juice Shop is susceptible to a known vulnerability in a library, for which an advisory has already been issued, marking the Juice Shop as <i>known affected</i>. A fix is still pending. <a href=\"/#/contact\">Inform the shop</a> about a suitable checksum as proof that you did your due diligence.": "Juice Shopは既知のライブラリの脆弱性の影響を受けやすい状態にあります。この脆弱性に対しては、すでにアドバイザリが発行されており、Juice Shopは<i>既知の被影響</i>として指定されています。修正はまだ保留中です。デューデリジェンスを行った証拠として、適切なチェックサムを<a href=\"/#/contact\">ショップに知らせる</a>。",
  "Security Advisories are often listed in the security.txt": "セキュリティアドバイザリは通常 security.txt ファイルに記載されています",
  "A developer was careless with hardcoding unused, but still valid credentials for a testing account on the client-side.": "ある開発者が不注意にも、テスト用アカウントで未使用ながらも有効な認証情報を、クライアントサイドにハードコーディングしてしまいました。",
  "Have a look at the client-side code in the dev console.": "開発コンソールでクライアント側のコードを確認してください。",
  "<a href=\"/#/contact\">Inform the shop</a> about a leaked API key. (Mention the exact key in your comment)": "リークされたAPIキーについて<a href=\"/#/contact\">ショップに通知</a> します（コメントの正確なキーを指定してください）",
  "The API call is part of a scheduled process \"behind the scenes\", i.e. completely unrelated to the web application.": "API 呼び出しはスケジュールされたプロセスの一部です。すなわち、Web アプリケーションとはまったく関係ありません。",
  "A matrix of known data entities and their supported HTTP verbs through the API can help you here.": "A matrix of known data entities and their supported HTTP verbs through the API can help you here.",
  "Careless developers might have exposed API methods that the client does not even need.": "Careless developers might have exposed API methods that the client does not even need.",
  "Normally, server log files are written to disk on server side and are not accessible from the outside.": "Normally, server log files are written to disk on server side and are not accessible from the outside.",
  "Which raises the question: Who would want a server access log to be accessible through a web application?": "Which raises the question: Who would want a server access log to be accessible through a web application?",
  "One particular file found in the folder you might already have found during the \"Access a confidential document\" challenge might give you an idea who is interested in such a public exposure.": "One particular file found in the folder you might already have found during the \"Access a confidential document\" challenge might give you an idea who is interested in such a public exposure.",
  "Drilling down one level into the file system might not be sufficient.": "Drilling down one level into the file system might not be sufficient.",
  "Register as an ordinary user to learn what API endpoints are involved in this use case.": "Register as an ordinary user to learn what API endpoints are involved in this use case.",
  "Think of the simplest possible implementations of a distinction between regular users and administrators.": "Think of the simplest possible implementations of a distinction between regular users and administrators.",
  "Knowing it exists, you can simply guess what URL the admin section might have.": "Knowing it exists, you can simply guess what URL the admin section might have.",
  "Alternatively, you can try to find a reference or clue within the parts of the application that are not usually visible in the browser.": "Alternatively, you can try to find a reference or clue within the parts of the application that are not usually visible in the browser.",
  "It is probably just slightly harder to find and gain access to than the score board link.": "It is probably just slightly harder to find and gain access to than the score board link.",
  "There is some access control in place, but there are at least three ways to bypass it.": "There is some access control in place, but there are at least three ways to bypass it.",
  "Find all places in the application where file uploads are possible.": "Find all places in the application where file uploads are possible.",
  "For at least one of these, the Juice Shop is depending on a library that suffers from an arbitrary file overwrite vulnerability.": "For at least one of these, the Juice Shop is depending on a library that suffers from an arbitrary file overwrite vulnerability.",
  "You can find a hint toward the underlying vulnerability in the @owasp_juiceshop Twitter timeline.": "You can find a hint toward the underlying vulnerability in the @owasp_juiceshop Twitter timeline.",
  "More precisely, Bjoern might have accidentally (?) doxxed himself by mentioning his security answer on at least one occasion where a camera was running.": "More precisely, Bjoern might have accidentally (?) doxxed himself by mentioning his security answer on at least one occasion where a camera was running.",
  "Brute forcing the answer might be very well possible with a sufficiently extensive list of common pet names.": "Brute forcing the answer might be very well possible with a sufficiently extensive list of common pet names.",
  "Guessing or brute forcing the URL of the token sale page is very unlikely to succeed.": "Guessing or brute forcing the URL of the token sale page is very unlikely to succeed.",
  "You should closely investigate the place where all paths within the application are defined.": "You should closely investigate the place where all paths within the application are defined.",
  "Beating the employed obfuscation mechanism manually will take some time. Maybe there is an easier way to undo it?": "Beating the employed obfuscation mechanism manually will take some time. Maybe there is an easier way to undo it?",
  "As the Juice Shop is written in pure Javascript, there is one data format that is most probably used for serialization.": "As the Juice Shop is written in pure Javascript, there is one data format that is most probably used for serialization.",
  "You should try to make the server busy for all eternity.": "You should try to make the server busy for all eternity.",
  "The challenge will be solved if you manage to trigger the protection of the application against a very specific DoS attack vector.": "The challenge will be solved if you manage to trigger the protection of the application against a very specific DoS attack vector.",
  "Similar to the \"Let the server sleep for some time\" challenge (which accepted nothing but NoSQL Injection as a solution) this challenge will only accept proper RCE as a solution. It cannot be solved by simply hammering the server with requests. That would probably just kill your server instance.": "Similar to the \"Let the server sleep for some time\" challenge (which accepted nothing but NoSQL Injection as a solution) this challenge will only accept proper RCE as a solution. It cannot be solved by simply hammering the server with requests. That would probably just kill your server instance.",
  "You could prepare 10 browser tabs, solving every CAPTCHA and filling out the each feedback form. Then you’d need to very quickly switch through the tabs and submit the forms in under 20 seconds total.": "You could prepare 10 browser tabs, solving every CAPTCHA and filling out the each feedback form. Then you’d need to very quickly switch through the tabs and submit the forms in under 20 seconds total.",
  "Should the Juice Shop ever decide to change the challenge into \"Submit 100 or more customer feedbacks within 60 seconds\" or worse, you’d probably have a hard time keeping up with any tab-switching approach.": "Should the Juice Shop ever decide to change the challenge into \"Submit 100 or more customer feedbacks within 60 seconds\" or worse, you’d probably have a hard time keeping up with any tab-switching approach.",
  "Investigate closely how the CAPTCHA mechanism works and try to find either a bypass or some automated way of solving it dynamically.": "Investigate closely how the CAPTCHA mechanism works and try to find either a bypass or some automated way of solving it dynamically.",
  "Wrap this into a script (in whatever programming language you prefer) that repeats this 10 times.": "Wrap this into a script (in whatever programming language you prefer) that repeats this 10 times.",
  "It might also have been put into the Improper Input Validation category.": "It might also have been put into the Improper Input Validation category.",
  "Bender’s current password is so strong that brute force, rainbow table or guessing attacks will probably not work.": "Bender’s current password is so strong that brute force, rainbow table or guessing attacks will probably not work.",
  "Find out how the application hides deleted products from its customers.": "Find out how the application hides deleted products from its customers.",
  "Try to craft an attack string that makes deleted products visible again.": "Try to craft an attack string that makes deleted products visible again.",
  "You need to get the deleted product into your shopping cart and trigger the Checkout.": "You need to get the deleted product into your shopping cart and trigger the Checkout.",
  "Neither of the above can be achieved through the application frontend and it might even require (half-)Blind SQL Injection.": "Neither of the above can be achieved through the application frontend and it might even require (half-)Blind SQL Injection.",
  "Find a screen in the application that looks subtly odd and dated compared with all other screens.": "Find a screen in the application that looks subtly odd and dated compared with all other screens.",
  "Before trying any XSS attacks, you should understand how the page is setting its Content Security Policy.": "Before trying any XSS attacks, you should understand how the page is setting its Content Security Policy.",
  "For the subsequent XSS, make good use of the flaws in the homegrown sanitization based on a RegEx!": "For the subsequent XSS, make good use of the flaws in the homegrown sanitization based on a RegEx!",
  "Even less of these fields are persisted in a way where their content is shown on another screen.": "Even less of these fields are persisted in a way where their content is shown on another screen.",
  "Bypassing client-side security can typically be done by either disabling it on the client (i.e. in the browser by manipulating the DOM tree) or by ignoring it completely and interacting with the backend instead.": "Bypassing client-side security can typically be done by either disabling it on the client (i.e. in the browser by manipulating the DOM tree) or by ignoring it completely and interacting with the backend instead.",
  "The file you are looking for is not protected in any way. Once you found it you can also access it.": "The file you are looking for is not protected in any way. Once you found it you can also access it.",
  "This challenge is almost indistinguishable from \"Perform a reflected XSS attack\" if you do not look \"under the hood\" to find out what the application actually does with the user input.": "This challenge is almost indistinguishable from \"Perform a reflected XSS attack\" if you do not look \"under the hood\" to find out what the application actually does with the user input.",
  "Find out which database system is in use and where it would usually store its schema definitions.": "Find out which database system is in use and where it would usually store its schema definitions.",
  "Craft a UNION SELECT attack string to join the relevant data from any such identified system table into the original result.": "Craft a UNION SELECT attack string to join the relevant data from any such identified system table into the original result.",
  "You might have to tackle some query syntax issues step-by-step, basically hopping from one error to the next.": "You might have to tackle some query syntax issues step-by-step, basically hopping from one error to the next.",
  "As with \"Order the Christmas special offer of 2014\" this cannot be achieved through the application frontend.": "As with \"Order the Christmas special offer of 2014\" this cannot be achieved through the application frontend.",
  "The old B2B interface was replaced with a more modern version recently.": "The old B2B interface was replaced with a more modern version recently.",
  "When deprecating the old interface, not all of its parts were cleanly removed from the code base.": "When deprecating the old interface, not all of its parts were cleanly removed from the code base.",
  "Simply using the deprecated interface suffices to solve this challenge. No attack or exploit is necessary.": "Simply using the deprecated interface suffices to solve this challenge. No attack or exploit is necessary.",
  "Simply reuse the trick that already worked for the files above.": "Simply reuse the trick that already worked for the files above.",
  "What ways are there to access data from a web application cross-domain?": "What ways are there to access data from a web application cross-domain?",
  "This challenge uses an old way which is no longer recommended.": "This challenge uses an old way which is no longer recommended.",
  "The user literally needs to be ephemeral as in \"lasting for only a short time\".": "The user literally needs to be ephemeral as in \"lasting for only a short time\".",
  "Registering normally with the user’s email address will then obviously not solve this challenge. The Juice Shop will not even let you register as acc0unt4nt@juice-sh.op, as this would make the challenge unsolvable for you.": "Registering normally with the user’s email address will then obviously not solve this challenge. The Juice Shop will not even let you register as acc0unt4nt@juice-sh.op, as this would make the challenge unsolvable for you.",
  "Getting the user into the database some other way will also fail to solve this challenge. In case you somehow managed to do so, you need to restart the Juice Shop application in order to wipe the database and make the challenge solvable again.": "Getting the user into the database some other way will also fail to solve this challenge. In case you somehow managed to do so, you need to restart the Juice Shop application in order to wipe the database and make the challenge solvable again.",
  "The fact that this challenge is in the Injection category should already give away the intended approach.": "The fact that this challenge is in the Injection category should already give away the intended approach.",
  "This challenge actually triggers from various possible error conditions.": "This challenge actually triggers from various possible error conditions.",
  "You can try to submit bad input to forms to provoke an improper error handling.": "You can try to submit bad input to forms to provoke an improper error handling.",
  "Tampering with URL paths or parameters might also trigger an unforeseen error.": "Tampering with URL paths or parameters might also trigger an unforeseen error.",
  "Look for clues about the past campaign or holiday event somewhere in the application.": "Look for clues about the past campaign or holiday event somewhere in the application.",
  "Solving this challenge does not require actual time traveling.": "Solving this challenge does not require actual time traveling.",
  "Guessing will most definitely not work in this challenge.": "Guessing will most definitely not work in this challenge.",
  "Investigate online what languages are actually available.": "Investigate online what languages are actually available.",
  "Nothing happens when you try to delete feedback entries? Check the JavaScript console for errors!": "Nothing happens when you try to delete feedback entries? Check the JavaScript console for errors!",
  "One viable solution would be to reverse-engineer how coupon codes are generated and craft your own 80% coupon by using the same (or at least similar) implementation.": "One viable solution would be to reverse-engineer how coupon codes are generated and craft your own 80% coupon by using the same (or at least similar) implementation.",
  "Another possible solution might be harvesting as many previous coupon as possible and look for patterns that might give you a leverage for a brute force attack.": "Another possible solution might be harvesting as many previous coupon as possible and look for patterns that might give you a leverage for a brute force attack.",
  "If all else fails, you could still try to blindly brute force the coupon code field before checkout.": "If all else fails, you could still try to blindly brute force the coupon code field before checkout.",
  "To find the client-side leverage point, closely analyze the HTML form used for feedback submission.": "To find the client-side leverage point, closely analyze the HTML form used for feedback submission.",
  "The backend-side leverage point is similar to some of the XSS challenges found in OWASP Juice Shop.": "The backend-side leverage point is similar to some of the XSS challenges found in OWASP Juice Shop.",
  "This challenge can be solved by using developers tool of your browser or with tools like postman.": "This challenge can be solved by using developers tool of your browser or with tools like postman.",
  "Analyze the form used for review submission and try to find a leverage point.": "Analyze the form used for review submission and try to find a leverage point.",
  "This challenge is pretty similar to \"Post some feedback in another user’s name\" challenge.": "This challenge is pretty similar to \"Post some feedback in another user’s name\" challenge.",
  "The three generic hints from Forge an essentially unsigned JWT token also help with this challenge.": "The three generic hints from Forge an essentially unsigned JWT token also help with this challenge.",
  "Instead of enforcing no encryption to be applied, try to apply a more sophisticated exploit against the JWT libraries used in the Juice Shop.": "Instead of enforcing no encryption to be applied, try to apply a more sophisticated exploit against the JWT libraries used in the Juice Shop.",
  "Getting your hands on the public RSA key the application employs for its JWTs is mandatory for this challenge.": "Getting your hands on the public RSA key the application employs for its JWTs is mandatory for this challenge.",
  "Finding the corresponding private key should actually be impossible, but that obviously doesn’t make this challenge unsolvable.": "Finding the corresponding private key should actually be impossible, but that obviously doesn’t make this challenge unsolvable.",
  "Make sure your JWT is URL safe!": "Make sure your JWT is URL safe!",
  "The file is not directly accessible because a security mechanism prevents access to it.": "The file is not directly accessible because a security mechanism prevents access to it.",
  "You need to trick the security mechanism into thinking that the file has a valid file type.": "You need to trick the security mechanism into thinking that the file has a valid file type.",
  "For this challenge there is only one approach to pull this trick.": "For this challenge there is only one approach to pull this trick.",
  "This challenge has nothing to do with URLs or domains.": "This challenge has nothing to do with URLs or domains.",
  "Other than for its legacy companion, combing through the package.json.bak does not help for this challenge.": "Other than for its legacy companion, combing through the package.json.bak does not help for this challenge.",
  "Trying out the Request Data Erasure functionality might be interesting, but cannot help you solve this challenge in real time.": "Trying out the Request Data Erasure functionality might be interesting, but cannot help you solve this challenge in real time.",
  "If you have solved the challenge Retrieve a list of all user credentials via SQL Injection you might have already retrieved some information about how the Juice Shop \"deletes\" users upon their request.": "If you have solved the challenge Retrieve a list of all user credentials via SQL Injection you might have already retrieved some information about how the Juice Shop \"deletes\" users upon their request.",
  "What the Juice Shop does here is totally incompliant with GDPR. Luckily a 4% fine on a gross income of 0$ is still 0$.": "What the Juice Shop does here is totally incompliant with GDPR. Luckily a 4% fine on a gross income of 0$ is still 0$.",
  "You should not try to steal data from a \"vanilla\" user who never even ordered something at the shop.": "You should not try to steal data from a \"vanilla\" user who never even ordered something at the shop.",
  "As everything about this data export functionality happens on the server-side, it won’t be possible to just tamper with some HTTP requests to solve this challenge.": "As everything about this data export functionality happens on the server-side, it won’t be possible to just tamper with some HTTP requests to solve this challenge.",
  "Inspecting various server responses which contain user-specific data might give you a clue about the mistake the developers made.": "Inspecting various server responses which contain user-specific data might give you a clue about the mistake the developers made.",
  "You might have to look into less common or even proprietary HTTP headers to find the leverage point.": "You might have to look into less common or even proprietary HTTP headers to find the leverage point.",
  "Adding insult to injury, the HTTP header you need will never be sent by the application on its own.": "Adding insult to injury, the HTTP header you need will never be sent by the application on its own.",
  "Find out how saving and restoring progress is done behind the scenes.": "Find out how saving and restoring progress is done behind the scenes.",
  "Deduce from all available information (e.g. the package.json.bak) how the application encrypts and decrypts your hacking progress.": "Deduce from all available information (e.g. the package.json.bak) how the application encrypts and decrypts your hacking progress.",
  "Other than the user’s passwords, the hacking progress involves an additional secret during its encryption.": "Other than the user’s passwords, the hacking progress involves an additional secret during its encryption.",
  "What would be a really stupid mistake a developer might make when choosing such a secret?": "What would be a really stupid mistake a developer might make when choosing such a secret?",
  "A very popular help platform for developers might contain breadcrumbs towards solving this challenge.": "A very popular help platform for developers might contain breadcrumbs towards solving this challenge.",
  "The actual log file was copied & paste onto a platform often used to share data quickly with externals or even just internal peers.": "The actual log file was copied & paste onto a platform often used to share data quickly with externals or even just internal peers.",
  "Once you found and harvested the important piece of information from the log, you could employ a technique called Password Spraying to solve this challenge.": "Once you found and harvested the important piece of information from the log, you could employ a technique called Password Spraying to solve this challenge.",
  "You must first identify the \"unsafe product\" which ist not available any more in the shop.": "You must first identify the \"unsafe product\" which ist not available any more in the shop.",
  "Solving the \"Order the Christmas special offer of 2014\" challenge might give it to you as by-catch.": "Solving the \"Order the Christmas special offer of 2014\" challenge might give it to you as by-catch.",
  "The actual data you need to solve this challenge was leaked on the same platform that was involved in the \"Dumpster dive the Internet for a leaked password and log in to the original user account it belongs to\" challenge.": "The actual data you need to solve this challenge was leaked on the same platform that was involved in the \"Dumpster dive the Internet for a leaked password and log in to the original user account it belongs to\" challenge.",
  "Google is a particularly good accomplice in this challenge.": "Google is a particularly good accomplice in this challenge.",
  "Investigating the forgotten developer’s backup file might bring some insight.": "Investigating the forgotten developer’s backup file might bring some insight.",
  "\"Malicious packages in npm\" is a worthwhile read on Ivan Akulov’s blog.": "\"Malicious packages in npm\" is a worthwhile read on Ivan Akulov’s blog.",
  "If you happen to know the email address of the admin already, you can launch a targeted attack.": "If you happen to know the email address of the admin already, you can launch a targeted attack.",
  "You might be lucky with a dedicated attack pattern even if you have no clue about the admin email address.": "You might be lucky with a dedicated attack pattern even if you have no clue about the admin email address.",
  "If you harvested the admin’s password hash, you can of course try to attack that instead of using SQL Injection.": "If you harvested the admin’s password hash, you can of course try to attack that instead of using SQL Injection.",
  "Alternatively you can solve this challenge as a combo with the Log in with the administrator’s user credentials without previously changing them or applying SQL Injection challenge.": "Alternatively you can solve this challenge as a combo with the Log in with the administrator’s user credentials without previously changing them or applying SQL Injection challenge.",
  "As with so many other characters from Futurama this challenge is of course about logging in as Amy from that show.": "As with so many other characters from Futurama this challenge is of course about logging in as Amy from that show.",
  "Did you know that Amy is married to an alien named Kif?": "Did you know that Amy is married to an alien named Kif?",
  "The challenge description contains a few sentences which give away some information how Amy decided to strengthen her password.": "The challenge description contains a few sentences which give away some information how Amy decided to strengthen her password.",
  "Obviously, Amy - being a little dimwitted - did not put nearly enough effort and creativity into the password selection process.": "Obviously, Amy - being a little dimwitted - did not put nearly enough effort and creativity into the password selection process.",
  "You need to know (or smart-guess) Bender’s email address so you can launch a targeted attack.": "You need to know (or smart-guess) Bender’s email address so you can launch a targeted attack.",
  "Bender's password hash might not help you very much.": "Bender's password hash might not help you very much.",
  "In case you try some other approach than SQL Injection, you will notice that Bender’s password hash is not very useful.": "In case you try some other approach than SQL Injection, you will notice that Bender’s password hash is not very useful.",
  "One way to light up this challenge in green on the score board, is to be Bjoern Kimminich. In that case, just log in with your Google account to automatically solve this challenge! Congratulations!": "One way to light up this challenge in green on the score board, is to be Bjoern Kimminich. In that case, just log in with your Google account to automatically solve this challenge! Congratulations!",
  "Most likely you are not Bjoern Kimminich, so instead you might want to take detailed look into how the OAuth login with Google is implemented.": "Most likely you are not Bjoern Kimminich, so instead you might want to take detailed look into how the OAuth login with Google is implemented.",
  "It could bring you some insight to register with your own Google account and analyze closely what happens behind the scenes.": "It could bring you some insight to register with your own Google account and analyze closely what happens behind the scenes.",
  "You need to know (or smart-guess) Jim’s email address so you can launch a targeted attack.": "You need to know (or smart-guess) Jim’s email address so you can launch a targeted attack.",
  "If you harvested Jim’s password hash, you can try to attack that instead of using SQL Injection.": "If you harvested Jim’s password hash, you can try to attack that instead of using SQL Injection.",
  "After watching the music video of this song, you should agree that even ⭐⭐ is a slightly exaggerated difficulty rating for this challenge.": "After watching the music video of this song, you should agree that even ⭐⭐ is a slightly exaggerated difficulty rating for this challenge.",
  "The support team is located in a low-cost country and the team structure fluctuates a lot due to people leaving for jobs with even just slightly better wages.": "The support team is located in a low-cost country and the team structure fluctuates a lot due to people leaving for jobs with even just slightly better wages.",
  "To prevent abuse the password for the support team account itself is actually very strong.": "To prevent abuse the password for the support team account itself is actually very strong.",
  "To allow easy access during an incident, the support team utilizes a 3rd party tool which every support engineer can access to get the current account password from.": "To allow easy access during an incident, the support team utilizes a 3rd party tool which every support engineer can access to get the current account password from.",
  "While it is also possible to use SQL Injection to log in as the support team, this will not solve the challenge.": "While it is also possible to use SQL Injection to log in as the support team, this will not solve the challenge.",
  "Adding more instances of the same product to someone else’s basket does not qualify as a solution. The same goes for stealing from someone else’s basket.": "Adding more instances of the same product to someone else’s basket does not qualify as a solution. The same goes for stealing from someone else’s basket.",
  "This challenge requires a bit more sophisticated tampering than others of the same ilk.": "This challenge requires a bit more sophisticated tampering than others of the same ilk.",
  "If you solved one of the other four file access challenges, you already know where the SIEM signature file is located.": "If you solved one of the other four file access challenges, you already know where the SIEM signature file is located.",
  "Every user is (almost) immediately associated with the review they \"liked\" to prevent abuse of that functionality.": "Every user is (almost) immediately associated with the review they \"liked\" to prevent abuse of that functionality.",
  "Did you really think clicking the \"like\" button three times in a row really fast would be enough to solve a ⭐⭐⭐⭐⭐⭐ challenge?": "Did you really think clicking the \"like\" button three times in a row really fast would be enough to solve a ⭐⭐⭐⭐⭐⭐ challenge?",
  "The underlying flaw of this challenge is a Race Condition.": "The underlying flaw of this challenge is a Race Condition.",
  "Make sure you solve Find the hidden easter egg first.": "Make sure you solve Find the hidden easter egg first.",
  "As stated in the Architecture overview, OWASP Juice Shop uses a MongoDB derivate as its NoSQL database.": "As stated in the Architecture overview, OWASP Juice Shop uses a MongoDB derivate as its NoSQL database.",
  "The categorization into the NoSQL Injection category totally gives away the expected attack vector for this challenge. Trying any others will not solve the challenge, even if they might yield the same result.": "The categorization into the NoSQL Injection category totally gives away the expected attack vector for this challenge. Trying any others will not solve the challenge, even if they might yield the same result.",
  "In particular, flooding the application with requests will not solve this challenge. That would probably just kill your server instance.": "In particular, flooding the application with requests will not solve this challenge. That would probably just kill your server instance.",
  "This challenge requires a classic Injection attack.": "This challenge requires a classic Injection attack.",
  "Find an API endpoint with the intent of delivering a single order to the user and work with that.": "Find an API endpoint with the intent of delivering a single order to the user and work with that.",
  "Reading up on how MongoDB queries work is really helpful here.": "Reading up on how MongoDB queries work is really helpful here.",
  "This challenge requires another classic Injection attack.": "This challenge requires another classic Injection attack.",
  "It is also worth looking into how Query Operators work in MongoDB.": "It is also worth looking into how Query Operators work in MongoDB.",
  "More particular, they have been sloppy in a way that even the Angular Compiler was not able to clean up after them automatically.": "More particular, they have been sloppy in a way that even the Angular Compiler was not able to clean up after them automatically.",
  "It is of course not sufficient to just visit any of the crypto currency links directly to solve the challenge.": "It is of course not sufficient to just visit any of the crypto currency links directly to solve the challenge.",
  "Guessing might work just fine.": "Guessing might work just fine.",
  "If you harvested the admin’s password hash, you can try to attack that.": "If you harvested the admin’s password hash, you can try to attack that.",
  "In case you use some hacker tool, you can also go for a brute force attack using a generic password list.": "In case you use some hacker tool, you can also go for a brute force attack using a generic password list.",
  "Investigate the shopping basket closely to understand how it prevents you from creating orders that would fulfil the challenge.": "Investigate the shopping basket closely to understand how it prevents you from creating orders that would fulfil the challenge.",
  "There is no inappropriate, self-written or misconfigured cryptographic library to be exploited here.": "There is no inappropriate, self-written or misconfigured cryptographic library to be exploited here.",
  "How much protection does a sturdy top-quality door lock add to your house if you put the key under the door mat? Or hide the key in the nearby plant pot? Or tape the key to the underside of the mailbox?": "How much protection does a sturdy top-quality door lock add to your house if you put the key under the door mat? Or hide the key in the nearby plant pot? Or tape the key to the underside of the mailbox?",
  "Once more: You do not have to pay anything to unlock this challenge!": "Once more: You do not have to pay anything to unlock this challenge!",
  "When you work with the application you will most likely solve this challenge in the process.": "When you work with the application you will most likely solve this challenge in the process.",
  "Any automated crawling or spidering tool you use might solve this challenge for you.": "Any automated crawling or spidering tool you use might solve this challenge for you.",
  "There is no real hacking involved here.": "There is no real hacking involved here.",
  "First you should obviously solve the \"Read our privacy policy\" challenge.": "First you should obviously solve the \"Read our privacy policy\" challenge.",
  "It is fine to use the mouse cursor to not lose sight of the paragraph you are currently reading.": "It is fine to use the mouse cursor to not lose sight of the paragraph you are currently reading.",
  "If you find some particularly hot sections in the policy you might want to melt them together similar to what you might have already uncovered in Apply some advanced cryptanalysis to find the real easter egg.": "If you find some particularly hot sections in the policy you might want to melt them together similar to what you might have already uncovered in Apply some advanced cryptanalysis to find the real easter egg.",
  "In practice two of these three ways should turn out to be dead ends.": "In practice two of these three ways should turn out to be dead ends.",
  "Try probing for XSS vulnerabilities by submitting text wrapped in an HTML tag which is easy to spot on screen, e.g. <h1> or <strike>.": "Try probing for XSS vulnerabilities by submitting text wrapped in an HTML tag which is easy to spot on screen, e.g. <h1> or <strike>.",
  "The obvious repetition in the User Registration form is the Repeat Password field.": "The obvious repetition in the User Registration form is the Repeat Password field.",
  "Try to register with either an empty or different value in Repeat Password.": "Try to register with either an empty or different value in Repeat Password.",
  "You can solve this challenge by cleverly interacting with the UI or bypassing it altogether.": "You can solve this challenge by cleverly interacting with the UI or bypassing it altogether.",
  "Unexpectedly, Bender also chose to answer his chosen question truthfully.": "Unexpectedly, Bender also chose to answer his chosen question truthfully.",
  "Hints to the answer to Bender’s question can be found in publicly available information on the Internet.": "Hints to the answer to Bender’s question can be found in publicly available information on the Internet.",
  "If a seemingly correct answer is not accepted, you might just need to try some alternative spelling.": "If a seemingly correct answer is not accepted, you might just need to try some alternative spelling.",
  "Brute forcing the answer should be next to impossible.": "Brute forcing the answer should be next to impossible.",
  "Other than with his OWASP account, Bjoern was a bit less careless with his choice of security and answer to his internal account.": "Other than with his OWASP account, Bjoern was a bit less careless with his choice of security and answer to his internal account.",
  "Bjoern chose to answer his chosen question truthfully but tried to make it harder for attackers by applying sort of a historical twist.": "Bjoern chose to answer his chosen question truthfully but tried to make it harder for attackers by applying sort of a historical twist.",
  "Again, hints to the answer to Bjoern’s question can be found by looking him up on the Internet.": "Again, hints to the answer to Bjoern’s question can be found by looking him up on the Internet.",
  "Jim picked one of the worst security questions and chose to answer it truthfully.": "Jim picked one of the worst security questions and chose to answer it truthfully.",
  "As Jim is a celebrity, the answer to his question is quite easy to find in publicly available information on the internet.": "As Jim is a celebrity, the answer to his question is quite easy to find in publicly available information on the internet.",
  "Even brute forcing the answer should be possible with the right kind of word list.": "Even brute forcing the answer should be possible with the right kind of word list.",
  "You can assume that Morty answered his security question truthfully but employed some obfuscation to make it more secure.": "You can assume that Morty answered his security question truthfully but employed some obfuscation to make it more secure.",
  "Morty’s answer is less than 10 characters long and does not include any special characters.": "Morty’s answer is less than 10 characters long and does not include any special characters.",
  "Unfortunately, Forgot your password? is protected by a rate limiting mechanism that prevents brute forcing. You need to beat this somehow.": "Unfortunately, Forgot your password? is protected by a rate limiting mechanism that prevents brute forcing. You need to beat this somehow.",
  "For your inconvenience the blueprint was not misplaced into the same place like so many others forgotten files covered in this chapter.": "For your inconvenience the blueprint was not misplaced into the same place like so many others forgotten files covered in this chapter.",
  "Using whatever you find inside the malware directly will not do you any good.": "Using whatever you find inside the malware directly will not do you any good.",
  "For this to count as an SSRF attack you need to make the Juice Shop server attack itself.": "For this to count as an SSRF attack you need to make the Juice Shop server attack itself.",
  "Do not try to find the source code for the malware on GitHub. Take it apart with classic reverse-engineering techniques instead.": "Do not try to find the source code for the malware on GitHub. Take it apart with classic reverse-engineering techniques instead.",
  "You can find the juicy malware via a very obvious Google search or by stumbling into a very ill-placed quarantine folder with the necessary URLs in it.": "You can find the juicy malware via a very obvious Google search or by stumbling into a very ill-placed quarantine folder with the necessary URLs in it.",
  "Making the server download and execute the malware is key to solving this challenge.": "Making the server download and execute the malware is key to solving this challenge.",
  "For this challenge you do not have to reverse engineer the malware in any way. That will be required later to solve the \"Request a hidden resource on server through server\" challenge.": "For this challenge you do not have to reverse engineer the malware in any way. That will be required later to solve the \"Request a hidden resource on server through server\" challenge.",
  "Undoubtedly you want to read our security policy before conducting any research on our application.": "アプリケーションに対する調査を開始する前に、セキュリティポリシーを熟読したいに違いない。",
  "As one of the good guys, would you just start attacking an application without consent of the owner?": "As one of the good guys, would you just start attacking an application without consent of the owner?",
  "You also might want to read the security policy or any bug bounty program that is in place.": "You also might want to read the security policy or any bug bounty program that is in place.",
  "The Comment field in the Contact Us screen is where you want to put your focus on.": "The Comment field in the Contact Us screen is where you want to put your focus on.",
  "The attack payload <iframe src=\"javascript:alert(`xss)\">` will not be rejected by any validator but stripped from the comment before persisting it.": "The attack payload <iframe src=\"javascript:alert(`xss)\">` will not be rejected by any validator but stripped from the comment before persisting it.",
  "Look for possible dependencies related to input processing in the package.json.bak you harvested earlier.": "Look for possible dependencies related to input processing in the package.json.bak you harvested earlier.",
  "If an XSS alert shows up but the challenge does not appear as solved on the Score Board, you might not have managed to put the exact attack string <iframe src=\"javascript:alert(`xss)\">` into the database?": "If an XSS alert shows up but the challenge does not appear as solved on the Score Board, you might not have managed to put the exact attack string <iframe src=\"javascript:alert(`xss)\">` into the database?",
  "You will need very specialized tool assistance for this challenge.": "You will need very specialized tool assistance for this challenge.",
  "The effective difficulty of this challenge depends a lot on what tools you pick to tackle it.": "The effective difficulty of this challenge depends a lot on what tools you pick to tackle it.",
  "This challenge cannot be solved by just reading our \"Lorem Ipsum\"-texts carefully.": "This challenge cannot be solved by just reading our \"Lorem Ipsum\"-texts carefully.",
  "This challenge uses the same leverage point as the \"Perform a Remote Code Execution that would keep a less hardened application busy forever\" challenge.": "This challenge uses the same leverage point as the \"Perform a Remote Code Execution that would keep a less hardened application busy forever\" challenge.",
  "This is a research-heavy challenge which does not involve any actual hacking.": "This is a research-heavy challenge which does not involve any actual hacking.",
  "Solving \"Access a developer's forgotten backup file\" before attempting this challenge will save you from a lot of frustration.": "Solving \"Access a developer's forgotten backup file\" before attempting this challenge will save you from a lot of frustration.",
  "As always, first learn how the feature under attack is used and behaves under normal conditions.": "As always, first learn how the feature under attack is used and behaves under normal conditions.",
  "Make sure you understand how 2FA with TOTP (time-based one-time password) works and which part of it is the critically sensitive one.": "Make sure you understand how 2FA with TOTP (time-based one-time password) works and which part of it is the critically sensitive one.",
  "Solving the challenge \"Retrieve a list of all user credentials via SQL Injection\" before tackling this one will definitely help. But it will not carry you all the way.": "Solving the challenge \"Retrieve a list of all user credentials via SQL Injection\" before tackling this one will definitely help. But it will not carry you all the way.",
  "You should begin with retrieving a valid JWT from the application’s Authorization request header.": "You should begin with retrieving a valid JWT from the application’s Authorization request header.",
  "A JWT is only given to users who have logged in. They have a limited validity, so better do not dawdle.": "A JWT is only given to users who have logged in. They have a limited validity, so better do not dawdle.",
  "Try to convince the site to give you a valid token with the required payload while downgrading to no encryption at all.": "Try to convince the site to give you a valid token with the required payload while downgrading to no encryption at all.",
  "First you should try to understand how the file upload is actually handled on the client and server side.": "First you should try to understand how the file upload is actually handled on the client and server side.",
  "With this understanding you need to find a \"weak spot\" in the right place and have to craft an exploit for it.": "With this understanding you need to find a \"weak spot\" in the right place and have to craft an exploit for it.",
  "If you solved the \"Upload a file larger than 100 kB\" challenge, you should try to apply the same solution here": "If you solved the \"Upload a file larger than 100 kB\" challenge, you should try to apply the same solution here",
  "Try to find an endpoint where you can influence data being retrieved from the server.": "Try to find an endpoint where you can influence data being retrieved from the server.",
  "Craft a UNION SELECT attack string to join data from another table into the original result.": "Craft a UNION SELECT attack string to join data from another table into the original result.",
  "You might have to tackle some query syntax issues step-by-step, basically hopping from one error to the next": "You might have to tackle some query syntax issues step-by-step, basically hopping from one error to the next",
  "As with \"Order the Christmas special offer of 2014\" and \"Exfiltrate the entire DB schema definition via SQL Injection\" this cannot be achieved through the application frontend.": "As with \"Order the Christmas special offer of 2014\" and \"Exfiltrate the entire DB schema definition via SQL Injection\" this cannot be achieved through the application frontend.",
  "The mentioned \"marketing collateral\" might have been publicly advertised by the Juice Shop but is not necessarily part of its sitemap yet.": "The mentioned \"marketing collateral\" might have been publicly advertised by the Juice Shop but is not necessarily part of its sitemap yet.",
  "It might help to perform some online searches for structurally similar web projects once you get stuck.": "It might help to perform some online searches for structurally similar web projects once you get stuck.",
  "This challenge will always partially keep you blindfolded, no matter how hard you do research and analysis.": "This challenge will always partially keep you blindfolded, no matter how hard you do research and analysis.",
  "There might be a client-side association of user to basket that you can try to manipulate.": "There might be a client-side association of user to basket that you can try to manipulate.",
  "In case you manage to update the database via SQL Injection so that a user is linked to another shopping basket, the application will not notice this challenge as solved.": "In case you manage to update the database via SQL Injection so that a user is linked to another shopping basket, the application will not notice this challenge as solved.",
  "Look for possible dependencies related to security in the package.json.bak you probably harvested earlier during the Access a developer’s forgotten backup file challenge.": "Look for possible dependencies related to security in the package.json.bak you probably harvested earlier during the Access a developer’s forgotten backup file challenge.",
  "Do some research on the internet for known security issues in the most suspicious application dependencies.": "Do some research on the internet for known security issues in the most suspicious application dependencies.",
  "Cryptographic functions only used in the \"Apply some advanced cryptanalysis to find the real easter egg\" challenge do not count as they are only a developer’s prank and not a serious security problem.": "Cryptographic functions only used in the \"Apply some advanced cryptanalysis to find the real easter egg\" challenge do not count as they are only a developer’s prank and not a serious security problem.",
  "You can find several places where redirects happen in the OWASP Juice Shop.": "You can find several places where redirects happen in the OWASP Juice Shop.",
  "The application will only allow you to redirect to allowlisted (previously referred to as whitelisted) URLs.": "The application will only allow you to redirect to allowlisted (previously referred to as whitelisted) URLs.",
  "Tampering with the redirect mechanism might give you some valuable information about how it works under to hood.": "Tampering with the redirect mechanism might give you some valuable information about how it works under to hood.",
  "This challenge sounds a lot harder than it actually is, which amplifies how bad the underlying vulnerability is.": "This challenge sounds a lot harder than it actually is, which amplifies how bad the underlying vulnerability is.",
  "Doing some research on typical XEE attack patterns basically gives away the solution for free.": "Doing some research on typical XEE attack patterns basically gives away the solution for free.",
  "The leverage point for this is obviously the same as for the XXE Data Access challenge.": "The leverage point for this is obviously the same as for the XXE Data Access challenge.",
  "You can only solve this challenge by keeping the server busy for >2sec with your attack.": "You can only solve this challenge by keeping the server busy for >2sec with your attack.",
  "The effectiveness of attack payloads for this challenge might depend on the operating system the Juice Shop is running on.": "The effectiveness of attack payloads for this challenge might depend on the operating system the Juice Shop is running on.",
  "You just have to (literally) inspect the problem to understand the basic issue.": "You just have to (literally) inspect the problem to understand the basic issue.",
  "It can also help to try out the Tweet-button of the entry and observe what happens.": "It can also help to try out the Tweet-button of the entry and observe what happens.",
  "Loading this page with an empty browser cache and on a slow (or throttled) connection will give you an idea on what the delivery box image is made of. Of course inspecting the page source will tell you just as much.": "Loading this page with an empty browser cache and on a slow (or throttled) connection will give you an idea on what the delivery box image is made of. Of course inspecting the page source will tell you just as much.",
  "You need to dive deep into the actual Angular code to understand this one.": "You need to dive deep into the actual Angular code to understand this one.",
  "This challenge requires the exploitation of another vulnerability which even has its own two challenges in its very own category": "This challenge requires the exploitation of another vulnerability which even has its own two challenges in its very own category",
  "This challenge can only be solved by strictly using the mentioned \"cross-domain kittens\". No other kittens from anywhere else can solve this challenge.": "This challenge can only be solved by strictly using the mentioned \"cross-domain kittens\". No other kittens from anywhere else can solve this challenge.",
  "The Juice Shop serves its metrics on the default path expected by Prometheus": "The Juice Shop serves its metrics on the default path expected by Prometheus",
  "Guessing the path is probably just as quick as taking the RTFM route via https://prometheus.io/docs/introduction/first_steps": "Guessing the path is probably just as quick as taking the RTFM route via https://prometheus.io/docs/introduction/first_steps",
  "Go to the payment page for a deluxe membership and try paying through different methods.": "Go to the payment page for a deluxe membership and try paying through different methods.",
  "Try inspecting the requests that go out for each of these methods, using the browser’s developer tools.": "Try inspecting the requests that go out for each of these methods, using the browser’s developer tools.",
  "Maybe playing around with the parameters in these requests could reveal something interesting.": "Maybe playing around with the parameters in these requests could reveal something interesting.",
  "Take a look at what happens when you change the username within the profile page.": "Take a look at what happens when you change the username within the profile page.",
  "Search for information about CSRF attacks and look out for examples that can be applied to this challenge.": "Search for information about CSRF attacks and look out for examples that can be applied to this challenge.",
  "Write the code for the CSRF attack within http://htmledit.squarefree.com and verify that it changes your username.": "Write the code for the CSRF attack within http://htmledit.squarefree.com and verify that it changes your username.",
  "Now it is just a question of copying and pasting the payload into the same vulnerable field.": "Now it is just a question of copying and pasting the payload into the same vulnerable field.",
  "Crank up the volume of your computer before submitting the payload! 🔊": "Crank up the volume of your computer before submitting the payload! 🔊",
  "People often reuse aliases online. You might be able to find something by looking online for Uvogin’s name or slight variations of it based on his unique writing habits.": "People often reuse aliases online. You might be able to find something by looking online for Uvogin’s name or slight variations of it based on his unique writing habits.",
  "You might be able to find some existing OSINT tools to help you in this investigation.": "You might be able to find some existing OSINT tools to help you in this investigation.",
  "Make use of tools that can inspect the metadata of images.": "Make use of tools that can inspect the metadata of images.",
  "Use this information to answer the security question of the John, who enjoys hiking in the park.": "Use this information to answer the security question of the John, who enjoys hiking in the park.",
  "In order to disable the chatbot for all users, you must first get an understanding of how it works under the hood.": "In order to disable the chatbot for all users, you must first get an understanding of how it works under the hood.",
  "The chatbot sure offers a lot of functionality. Could it be that juice-shop relies on a third party, possibly open source library for this?": "The chatbot sure offers a lot of functionality. Could it be that juice-shop relies on a third party, possibly open source library for this?",
  "Maybe you can try to gather clues from around juice shop and then go dumpster dive the internet to get a hold of the bot’s source.": "Maybe you can try to gather clues from around juice shop and then go dumpster dive the internet to get a hold of the bot’s source.",
  "Some files in there are not directly accessible because a security mechanism prevents access.": "Some files in there are not directly accessible because a security mechanism prevents access.",
  "The Poison Null Byte can trick the security mechanism into thinking that the file you want has a valid file type.": "The Poison Null Byte can trick the security mechanism into thinking that the file you want has a valid file type.",
  "Depending on the files you try to retrieve you will probably solve \"Access a developer’s forgotten backup file\", \"Access a salesman’s forgotten backup file\", \"Access a misplaced SIEM signature file, or \"Find the hidden easter egg\" along the way.": "Depending on the files you try to retrieve you will probably solve \"Access a developer’s forgotten backup file\", \"Access a salesman’s forgotten backup file\", \"Access a misplaced SIEM signature file, or \"Find the hidden easter egg\" along the way.",
  "Asking over and over again like a little kid might actually help you succeed in this case.": "Asking over and over again like a little kid might actually help you succeed in this case.",
  "No seriously, just keep asking.": "No seriously, just keep asking.",
  "You should read up on Local File Read (LFR) vulnerabilities in popular NodeJS template engines.": "You should read up on Local File Read (LFR) vulnerabilities in popular NodeJS template engines.",
  "Look for an easily forgettable endpoint in Juice Shop to test out the LFR attack.": "Look for an easily forgettable endpoint in Juice Shop to test out the LFR attack.",
  "500 Internal Server Error is always an interesting status code.": "500 Internal Server Error is always an interesting status code.",
  "Fuzzing can also help with this challenge.": "Fuzzing can also help with this challenge.",
  "This challenge is most easily solvable immediately after a server restart.": "This challenge is most easily solvable immediately after a server restart.",
  "Alternatively you can also inspect any \"Challenge solved\"-notification in your browser to understand its convenience feature.": "Alternatively you can also inspect any \"Challenge solved\"-notification in your browser to understand its convenience feature.",
  "Check the Juice Shop’s social media channels for regularly scheduled content being posted, possibly even indicating that it was automatically created.": "Check the Juice Shop’s social media channels for regularly scheduled content being posted, possibly even indicating that it was automatically created.",
  "Find out which part of the content might come from the response of an API call.": "Find out which part of the content might come from the response of an API call.",
  "Find the place where the API call happens — as stated above, it is not in the web application — and then look for the API key itself.": "Find the place where the API call happens — as stated above, it is not in the web application — and then look for the API key itself.",
  "Your eldest siblings middle name?": "ご兄弟の一番上の方のミドルネームは？",
  "Mother's maiden name?": "お母さんの旧姓は？",
  "Mother's birth date? (MM/DD/YY)": "お母さんの生年月日は？(MM/DD/YY)",
  "Father's birth date? (MM/DD/YY)": "お父さんの生年月日は？(MM/DD/YY)",
  "Maternal grandmother's first name?": "母方の祖母の姓は？",
  "Paternal grandmother's first name?": "父方の祖母の姓は?",
  "Name of your favorite pet?": "お気に入りのペットの名前は？",
  "Last name of dentist when you were a teenager? (Do not include 'Dr.')": "10代の時の歯科医の苗字は？（博士は含めないでください）",
  "Your ZIP/postal code when you were a teenager?": "10代の頃の郵便番号は？",
  "Company you first work for as an adult?": "最初に働いた会社は？",
  "Your favorite book?": "あなたの好きな本は？",
  "Your favorite movie?": "あなたのお気に入りの映画は？",
  "Number of one of your customer or ID cards?": "顧客またはIDカードのいずれかの番号は？",
  "What's your favorite place to go hiking?": "お気に入りのハイキングスポットはどこですか？"
}
