{
  "Apple Juice (1000ml)": "Sok jabłkowy (1000ml)",
  "The all-time classic.": "Klasyka wszech czasów.",
  "Apple Pomace": "Wytłoki jabłkowe.",
  "Finest pressings of apples. Allergy disclaimer: Might contain traces of worms. Can be <a href=\"/#recycle\">sent back to us</a> for recycling.": "Najlepsze tłoczenia jabłek. Zastrzeżenie dotyczące alergii: Może zawierać ślady robaków. Może być <a href=\"/#recycle\">odesłany do nas</a> w celu recyklingu.",
  "Banana Juice (1000ml)": "Sok bananowy (1000ml)",
  "Monkeys love it the most.": "Małpy kochają to najbardziej.",
  "Best Juice Shop Salesman Artwork": "Najlepsza praca artystyczna sprzedawcy w Juice SHop.",
  "Unique digital painting depicting Stan, our most qualified and almost profitable salesman. He made a succesful carreer in selling used ships, coffins, krypts, crosses, real estate, life insurance, restaurant supplies, voodoo enhanced asbestos and courtroom souvenirs before <em>finally</em> adding his expertise to the Juice Shop marketing team.": "Wyjątkowy obraz cyfrowy przedstawiający Stana, naszego najbardziej wykwalifikowanego i niemal dochodowego sprzedawcę. Odniósł sukces w sprzedaży używanych statków, trumien, krypt, krzyży, nieruchomości, ubezpieczeń na życie, artykułów restauracyjnych, azbestu wzmocnionego voodoo i pamiątek sądowych, zanim <EM>w końcu</EM> dodał swoją wiedzę do zespołu marketingowego sklepu z sokami.",
  "Carrot Juice (1000ml)": "Sok marchwiowy (1000ml)",
  "As the old German saying goes: \"Carrots are good for the eyes. Or has anyone ever seen a rabbit with glasses?\"": "Jak mówi stare niemieckie powiedzenie: \"Marchew jest dobra dla oczu. Czy ktoś kiedykolwiek widział królika w okularach?\"",
  "Eggfruit Juice (500ml)": "Sok z kanistela (500ml)",
  "Now with even more exotic flavour.": "Teraz z jeszcze bardziej egzotycznym smakiem.",
  "Fruit Press": "Prasa owocowa.",
  "Fruits go in. Juice comes out. Pomace you can send back to us for recycling purposes.": "Owoce wchodzą. Wychodzi sok. Wytłoki możesz odesłać do nas w celu recyklingu.",
  "Green Smoothie": "Zielone smoothie.",
  "Looks poisonous but is actually very good for your health! Made from green cabbage, spinach, kiwi and grass.": "Wygląda na trujący, ale w rzeczywistości jest bardzo dobry dla twojego zdrowia! Wykonane z zielonej kapusty, szpinaku, kiwi i trawy.",
  "Juice Shop \"Permafrost\" 2020 Edition": "Juice Shop \"Permafrost\" Edycja 2020.",
  "Exact version of <a href=\"https://github.com/juice-shop/juice-shop/releases/tag/v9.3.1-PERMAFROST\">OWASP Juice Shop that was archived on 02/02/2020</a> by the GitHub Archive Program and ultimately went into the <a href=\"https://github.blog/2020-07-16-github-archive-program-the-journey-of-the-worlds-open-source-code-to-the-arctic\">Arctic Code Vault</a> on July 8. 2020 where it will be safely stored for at least 1000 years.": "Dokładna wersja <a href=\"https://github.com/juice-shop/juice-shop/releases/tag/v9.3.1-PERMAFROST\">OWASP Juice Shop, która została zarchiwizowana 02.02.2020</a> przez GitHub Archive Program i ostatecznie trafiła do <a href=\"https://github.blog/2020-07-16-github-archive-program-the-journey-of-the-worlds-open-source-code-to-the-arctic\">Arctic Code Vault</a> 8 lipca 2020, gdzie będzie bezpiecznie przechowywana przez co najmniej 1000 lat.",
  "Lemon Juice (500ml)": "Sok cytrynowy (500ml)",
  "Sour but full of vitamins.": "Kwaśny, ale pełen witamin.",
  "Melon Bike (Comeback-Product 2018 Edition)": "Melonowy rower ( Edycja powrotna produktu z 2018r.)",
  "The wheels of this bicycle are made from real water melons. You might not want to ride it up/down the curb too hard.": "Koła tego roweru są wykonane z prawdziwych arbuzów. Lepiej nie zjeżdżaj ani nie wjeżdżaj nim zbyt gwałtownie na krawężnik.",
  "OWASP Juice Shop \"King of the Hill\" Facemask": "OWASP Juice Shop „King of the Hill” Maska ochronna na twarz",
  "Facemask with compartment for filter from 50% cotton and 50% polyester.": "Maska ochronna na twarz z komorą na filtr z 50% bawełny i 50% poliestru.",
  "OWASP Juice Shop CTF Girlie-Shirt": "Koszula dziewczęca OWASP Juice Shop CTF",
  "For serious Capture-the-Flag heroines only!": "Tylko dla poważnych bohaterek Capture-the-Flag!",
  "OWASP Juice Shop Card (non-foil)": "Karta OWASP Juice Shop (bez folii)",
  "Mythic rare <small><em>(obviously...)</em></small> card \"OWASP Juice Shop\" with three distinctly useful abilities. Alpha printing, mint condition. A true collectors piece to own!": "Mityczna, rzadka karta <small><em>(oczywiście...)</em></small> \"OWASP Juice Shop\" z trzema wyraźnie przydatnymi umiejętnościami. Druk alfa, stan idealny. Prawdziwy przedmiot kolekcjonerski do posiadania!",
  "OWASP Juice Shop Coaster (10pcs)": "Podkładki OWASP Juice Shop (10 szt.)",
  "Our 95mm circle coasters are printed in full color and made from thick, premium coaster board.": "Nasze okrągłe 95mm podstawki są drukowane w pełnym kolorze i wykonane z grubej, wysokiej jakości tektury.",
  "OWASP Juice Shop Holographic Sticker": "Holograficzna naklejka OWASP Juice Shop.",
  "Die-cut holographic sticker. Stand out from those 08/15-sticker-covered laptops with this shiny beacon of 80's coolness!": "Wycinana naklejka holograficzna. Wyróżnij się spośród laptopów oblepionych zwykłymi naklejkami dzięki tej błyszczącej ikonie stylu z lat 80!",
  "OWASP Juice Shop Hoodie": "Bluza z kapturem OWASP Juice Shop.",
  "Mr. Robot-style apparel. But in black. And with logo.": "Odzież w stylu Mr. Robot. Ale w czerni. I z logo.",
  "OWASP Juice Shop Iron-Ons (16pcs)": "OWASP Juice Shop naprasowanki (16 sztuk)",
  "Upgrade your clothes with washer safe <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">iron-ons</a> of the OWASP Juice Shop or CTF Extension logo!": "Ulepsz swoje ubrania dzięki odpornym na pranie <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">naprasowankom</a> OWASP Juice Shop lub logo CTF Extension!",
  "OWASP Juice Shop LEGO™ Tower": "OWASP Juice Shop wieża z klocków LEGO™",
  "Want to host a Juice Shop CTF in style? Build <a href=\"https://github.com/OWASP/owasp-swag/blob/master/projects/juice-shop/lego/OWASP%20JuiceShop%20Pi-server%201.2.pdf\" target=\"_blank\">your own LEGO™ tower</a> which holds four Raspberry Pi 4 models with PoE HAT modules <a href=\"https://github.com/juice-shop/multi-juicer/blob/main/guides/raspberry-pi/raspberry-pi.md\" target=\"_blank\">running a MultiJuicer Kubernetes cluster</a>! Wire to a switch and connect to your network to have an out-of-the-box ready CTF up in no time!": "Chcesz zorganizować Juice Shop CTF w dobrym stylu? Zbuduj <a href=\"https://github.com/OWASP/owasp-swag/blob/master/projects/juice-shop/lego/OWASP%20JuiceShop%20Pi-server%201.2.pdf\" target=\"_blank\">własną wieżę LEGO™</a>, która pomieści cztery modele Raspberry Pi 4 z modułami PoE HAT <a href=\"https://github.com/juice-shop/multi-juicer/blob/main/guides/raspberry-pi/raspberry-pi.md\" target=\"_blank\">działające w klastrze MultiJuicer Kubernetes</a>! Podłącz kablem do przełącznika i połącz się ze swoją siecią, aby błyskawicznie mieć gotowy do użycia CTF!",
  "OWASP Juice Shop Logo (3D-printed)": "Logo OWASP Juice Shop (wydrukowane w 3D)",
  "This rare item was designed and handcrafted in Sweden. This is why it is so incredibly expensive despite its complete lack of purpose.": "Ten rzadki przedmiot został zaprojektowany i wykonany ręcznie w Szwecji. Dlatego jest tak niewiarygodnie drogi pomimo całkowitego braku celu.",
  "OWASP Juice Shop Magnets (16pcs)": "Magnesy OWASP Juice Shop (16 sztuk)",
  "Your fridge will be even cooler with these OWASP Juice Shop or CTF Extension logo <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">magnets</a>!": "Twoja lodówka będzie jeszcze fajniejsza z tymi <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">magnesami</a> z logo OWASP Juice Shop lub logo CTF Extension!",
  "OWASP Juice Shop Mug": "Kubek OWASP Juice Shop",
  "Black mug with regular logo on one side and CTF logo on the other! Your colleagues will envy you!": "Czarny kubek ze zwykłym logo po jednej stronie i logo CTF po drugiej! Twoi koledzy będą ci zazdrościć!",
  "OWASP Juice Shop Sticker Page": "Strona z naklejkami OWASP Juice Shop",
  "Massive decoration opportunities with these OWASP Juice Shop or CTF Extension <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">sticker pages</a>! Each page has 16 stickers on it.": "Ogromne możliwości dekoracyjne dzięki tym <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">stronom z naklejkami</a> OWASP Juice Shop lub CTF Extension! Każda strona zawiera 16 naklejek.",
  "OWASP Juice Shop Sticker Single": " Pojedyncza naklejka OWASP Juice Shop.",
  "Super high-quality vinyl <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">sticker single</a> with the OWASP Juice Shop or CTF Extension logo! The ultimate laptop decal!": "Super wysokiej jakości winylowa <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">pojedyncza naklejka</a> z logo OWASP Juice Shop lub rozszerzenia CTF! Najlepsza naklejka na laptopa!",
  "OWASP Juice Shop T-Shirt": "Koszulka OWASP Juice Shop",
  "Real fans wear it 24/7!": "Prawdziwi fani noszą to 24/7!",
  "OWASP Juice Shop Temporary Tattoos (16pcs)": "Tymczasowe tatuaże OWASP Juice Shop (16 sztuk)",
  "Get one of these <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">temporary tattoos</a> to proudly wear the OWASP Juice Shop or CTF Extension logo on your skin! If you tweet a photo of yourself with the tattoo, you get a couple of our stickers for free! Please mention <a href=\"https://twitter.com/owasp_juiceshop\" target=\"_blank\"><code>@owasp_juiceshop</code></a> in your tweet!": "Zdobądź jeden z tych <a href=\"https://www.stickeryou.com/products/owasp-juice-shop/794\" target=\"_blank\">tymczasowych tatuaży</a> , aby z dumą nosić na skórze logo sklepu z sokami OWASP lub logo CTF Extension! Jeśli zatweetujesz swoje zdjęcie z tatuażem, dostaniesz kilka naszych naklejek za darmo! Proszę wymienić <a href=\"https://twitter.com/owasp_juiceshop\" target=\"_blank\"><code>@owasp_juiceshop</code></a> w tweecie!",
  "OWASP Juice Shop-CTF Velcro Patch": "OWASP Juice Shop-CTF łatka na rzep.",
  "4x3.5\" embroidered patch with velcro backside. The ultimate decal for every tactical bag or backpack!": "4x3,5\" haftowana naszywka z rzepem z tyłu. Najlepsza naklejka do każdej torby taktycznej lub plecaka!",
  "OWASP SSL Advanced Forensic Tool (O-Saft)": "Zaawansowane narzędzie kryminalistyczne OWASP SSL (O-Saft)",
  "O-Saft is an easy to use tool to show information about SSL certificate and tests the SSL connection according given list of ciphers and various SSL configurations. <a href=\"https://www.owasp.org/index.php/O-Saft\" target=\"_blank\">More...</a>": "O-Saft jest łatwym w użyciu narzędziem do wyświetlania informacji o certyfikacie SSL i testowania połączenia SSL zgodnie z podaną listą szyfrów i różnymi konfiguracjami SSL. <a href=\"https://www.owasp.org/index.php/O-Saft\" target=\"_blank\">Więcej...</a>",
  "OWASP Snakes and Ladders - Mobile Apps": "Węże i drabiny OWASP - Aplikacje mobilne.",
  "This amazing mobile app security awareness board game is <a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1970691216\">available for Tabletop Simulator on Steam Workshop</a> now!": "Ta niesamowita edukacyjna gra planszowa dotycząca bezpieczeństwa aplikacji mobilnych jest już <a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1970691216\">dostępna w Tabletop Simulator na Steam Workshop</a>teraz!",
  "OWASP Snakes and Ladders - Web Applications": "Węże i drabiny OWASP - Aplikacje internetowe.",
  "This amazing web application security awareness board game is <a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1969196030\">available for Tabletop Simulator on Steam Workshop</a> now!": "Ta niesamowita edukacyjna gra planszowa dotycząca bezpieczeństwa aplikacji internetowych jest już <a href=\"https://steamcommunity.com/sharedfiles/filedetails/?id=1969196030\">dostępna w Tabletop Simulator na Steam Workshop</a>teraz!",
  "Orange Juice (1000ml)": "Sok jabłkowy (1000ml)",
  "Made from oranges hand-picked by Uncle Dittmeyer.": "Wykonane z pomarańczy ręcznie zbieranych przez wujka Dittmeyera.",
  "Pwning OWASP Juice Shop": "Przejęcie OWASP Juice Shop.",
  "<em>The official Companion Guide</em> by Björn Kimminich available <a href=\"https://leanpub.com/juice-shop\">for free on LeanPub</a> and also <a href=\"https://pwning.owasp-juice.shop\">readable online</a>!": "<em>Oficjalny Przewodnik</em> autorstwa Björna Kimminicha dostępny <a href=\"https://leanpub.com/juice-shop\">za darmo na LeanPub</a>, a także <a href=\"https://pwning.owasp-juice.shop\">do przeczytania online</a>!",
  "Quince Juice (1000ml)": "Sok z pigwy (1000ml)",
  "Juice of the <em>Cydonia oblonga</em> fruit. Not exactly sweet but rich in Vitamin C.": "Sok z owoców <em>Pigwa pospolita</em>. Nie do końca słodki, ale bogaty w witaminę C.",
  "Raspberry Juice (1000ml)": "Sok malinowy (1000ml)",
  "Made from blended Raspberry Pi, water and sugar.": "Wykonane z mieszanki Raspberry Pi, wody i cukru.",
  "Strawberry Juice (500ml)": "Sok truskawkowy (500ml)",
  "Sweet & tasty!": "Słodki i smaczny!",
  "Woodruff Syrup \"Forest Master X-Treme\"": " Syrop marzankowy \"Forest Master X-Treme\"",
  "Harvested and manufactured in the Black Forest, Germany. Can cause hyperactive behavior in children. Can cause permanent green tongue when consumed undiluted.": "Zbierane i produkowane w Czarnym lesie w Niemczech. Może powodować nadpobudliwe zachowania u dzieci. Może powodować trwały zielony język po spożyciu nierozcieńczonego.",
  "Find the carefully hidden 'Score Board' page.": "Znajdź starannie ukrytą stronę z tablicą wyników.",
  "Try to find a reference or clue behind the scenes. Or simply guess what URL the Score Board might have.": "Spróbuj znaleźć odniesienie lub wskazówkę za kulisami. Lub po prostu zgadnij, jaki adres URL może mieć tablica wyników.",
  "Perform a <i>persisted</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> without using the frontend application at all.": "Wykonaj <i>trwały</i> atak XSS za pomocą <code><iframe src=\"javascript:alert(`xss`)\"></code> bez użycia aplikacji front-endowej.",
  "You need to work with the server-side API directly. Try different HTTP verbs on different entities exposed through the API.": "Musisz pracować bezpośrednio z API po stronie serwera. Wypróbuj różne czasowniki HTTP na różnych podmiotach ujawnionych przez API.",
  "Gain access to any access log file of the server.": "Uzyskaj dostęp do dowolnego pliku dziennika dostępu serwera.",
  "Who would want a server access log to be accessible through a web application?": "Kto chciałby, aby dziennik dostępu do serwera był dostępny za pośrednictwem aplikacji internetowej?",
  "Register as a user with administrator privileges.": "Zarejestruj się jako użytkownik z uprawnieniami administratora.",
  "You have to assign the unassignable.": "Musisz przypisać to, co nie można przypisać.",
  "Access the administration section of the store.": "Uzyskaj dostęp do sekcji administracyjnej sklepu.",
  "It is just slightly harder to find than the score board link.": "Jest on nieco trudniejszy do znalezienia niż link do tablicy wyników.",
  "Overwrite the <a href=\"/ftp/legal.md\">Legal Information</a> file.": "Nadpisz plik <a href=\"/ftp/legal.md\">Informacje prawne</a>.",
  "Look out for a tweet praising new functionality of the web shop. Then find a third party vulnerability associated with it.": "Zwróć uwagę na tweeta chwalącego nową funkcjonalność sklepu internetowego. Następnie znajdź lukę w zabezpieczeniach strony trzeciej z nią związaną.",
  "Reset the password of Bjoern's OWASP account via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "Zresetuj hasło do konta OWASP Bjöerna za pomocą mechanizmu <a href=\"/#/forgot-password\">Zapomniałem hasła</a>, podając <i>oryginalną odpowiedź</i> na jego pytanie bezpieczeństwa.",
  "Hints to the answer to Bjoern’s question can be found by looking him up on the Internet.": "Wskazówki do odpowiedzi na pytanie Bjöerna można znaleźć, wyszukując go w internecie.",
  "Learn about the Token Sale before its official announcement.": "Dowiedz się o sprzedaży tokenów przed jej oficjalnym ogłoszeniem.",
  "The developers truly believe in \"Security through Obscurity\" over actual access restrictions.": "Deweloperzy naprawdę wierzą w \"Bezpieczeństwo przez niejasność\" zamiast rzeczywistych ograniczeń dostępu.",
  "Take over the wallet containing our official Soul Bound Token (NFT).": "Przejmij portfel zawierający nasz oficjalny Soul Bound Token (NFT).",
  "Find the seed phrase posted accidentally.": "Znajdź frazę seed opublikowaną przypadkowo.",
  "Mint the Honey Pot NFT by gathering BEEs from the bee haven.": "Wykop garnek miodu NFT zbierając BEE-sy z pszczelego raju.",
  "Discover NFT wonders among the captivating visual memories.": "Odkryj cuda NFT wśród urzekających wizualnych wspomnień.",
  "Withdraw more ETH from the new wallet than you deposited.": "Wypłać więcej ETH z nowego portfela niż zdeponowałeś.",
  "Try to exploit the contract of the wallet.": "Spróbuj wykorzystać kontrakt portfela.",
  "Find an accidentally deployed code sandbox for writing smart contracts on the fly.": "Znajdź przypadkowo wdrożoną piaskownicę kodową do pisania inteligentnych kontraktów na bieżąco.",
  "It is just as easy as finding the Score Board.": "Jest to równie łatwe jak znalezienie tablicy wyników.",
  "Perform a Remote Code Execution that would keep a less hardened application busy <em>forever</em>.": "Wykonaj zdalne wykonanie kodu, które utrzymałoby mniej zahartowaną aplikację <em>na zawsze</em>.",
  "The feature you need to exploit for this challenge is not directly advertised anywhere.": "Funkcja, którą musisz wykorzystać do tego wyzwania, nie jest nigdzie bezpośrednio reklamowana.",
  "Submit 10 or more customer feedbacks within 20 seconds.": "Prześlij 10 lub więcej opinii klientów w ciągu 20 sekund.",
  "After finding a CAPTCHA bypass, write a script that automates feedback submission. Or open many browser tabs and be really quick.": "Po znalezieniu obejścia CAPTCHA napisz skrypt, który automatyzuje przesyłanie opinii. Lub otwórz wiele kart przeglądarki i bądź naprawdę szybki.",
  "Change Bender's password into <i>slurmCl4ssic</i> without using SQL Injection or Forgot Password.": "Zmień hasło Bendera na <i>slurmCl4ssic</i> bez użycia wstrzyknięcia SQL lub \"Zapomniałem hasła\".",
  "In previous releases this challenge was wrongly accused of being based on CSRF.": "W poprzednich wydaniach to wyzwanie było niesłusznie oskarżane o to, że opiera się na CSRF.",
  "Order the Christmas special offer of 2014.": "Zamów świąteczną ofertę specjalną z 2014 roku.",
  "Find out how the application handles unavailable products and try to find a loophole.": "Dowiedz się, jak aplikacja radzi sobie z niedostępnymi produktami i spróbuj znaleźć lukę.",
  "Bypass the Content Security Policy and perform an XSS attack with <code>&lt;script&gt;alert(`xss`)&lt;/script&gt;</code> on a legacy page within the application.": "Omiń politykę bezpieczeństwa treści i wykonaj atak XSS z <code>&lt;script&gt;alert(`xss`)&lt;/script&gt;</code> na starszej stronie w aplikacji.",
  "What is even \"better\" than a legacy page with a homegrown RegEx sanitizer? Having CSP injection issues on the exact same page as well!": "Co jest jeszcze \"lepsze\" niż przestarzała strona z domowym środkiem dezynfekującym RegEx? Mając problemy z wstrzyknięciem CSP również na tej samej stronie!",
  "Perform a <i>persisted</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> bypassing a <i>client-side</i> security mechanism.": "Wykonaj <i>trwały</i> atak XSS z <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> omijając mechanizm bezpieczeństwa <i>po stronie klienta</i>.",
  "There are only some input fields in the Juice Shop forms that validate their input.": "W formularzach Juice Shop tylko niektóre pola wejściowe walidują wprowadzane dane.",
  "Access a confidential document.": "Uzyskaj dostęp do poufnego dokumentu.",
  "Analyze and tamper with links in the application that deliver a file directly.": "Analizuj i manipuluj linkami w aplikacji, które bezpośrednio dostarczają plik.",
  "Perform a <i>DOM</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code>.": "Wykonaj atak <i>DOM</i> XSS za pomocą <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code>.",
  "Look for an input field where its content appears in the HTML when its form is submitted.": "Poszukaj pola wejściowego, w którym jego zawartość pojawia się w HTML po przesłaniu formularza.",
  "Exfiltrate the entire DB schema definition via SQL Injection.": "Eksfiltruj całą definicję schematu DB za pomocą wstrzyknięcia SQL.",
  "Find out where this information could come from. Then craft an attack string against an endpoint that offers an unnecessary way to filter data.": "Dowiedz się, skąd mogłaby pochodzić ta informacja. Następnie stwórz ciąg ataku przeciwko endpointowi, który oferuje niepotrzebny sposób filtrowania danych.",
  "Use a deprecated B2B interface that was not properly shut down.": "Użyj przestarzałego interfejsu B2B, który nie został prawidłowo wyłączony.",
  "The developers who disabled the interface think they could go invisible by just closing their eyes.": "Deweloperzy, którzy wyłączyli interfejs, uważają, że mogą być niewidoczni, po prostu zamykając oczy.",
  "Find the hidden <a href=\"https://en.wikipedia.org/wiki/Easter_egg_(media)\" target=\"_blank\">easter egg</a>.": "Znajdź ukrytą <a href=\"https://en.wikipedia.org/wiki/Easter_egg_(media)\" target=\"_blank\">pisankę</a>.",
  "If you solved one of the four file access challenges, you already know where to find the easter egg.": "Jeśli rozwiązałeś jedno z czterech wyzwań dostępu do plików, już wiesz, gdzie znaleźć pisankę.",
  "Perform an unwanted information disclosure by accessing data cross-domain.": "Wykonaj ujawnienie niechcianych informacji, uzyskując dostęp do danych między domeną.",
  "Try to find and attack an endpoint that responds with user information. SQL Injection is not the solution here.": "Spróbuj znaleźć i zaatakować punkt końcowy, który odpowiada informacjom użytkownika. Wstrzyknięcie SQL nie jest tutaj rozwiązaniem.",
  "Register a user with an empty email and password.": "Zarejestruj użytkownika z pustym adresem e-mail i hasłem.",
  "Consider intercepting and playing with the request payload.": "Rozważ przechwycenie i zabawę z ładunkiem żądania.",
  "Log in with the (non-existing) accountant <i>acc0unt4nt@juice-sh.op</i> without ever registering that user.": "Zaloguj się przy użyciu (nieistniejącego) księgowego <i>acc0unt4nt@juice-sh.op</i> bez rejestracji tego użytkownika.",
  "Try to create the needed user \"out of thin air\".": "Spróbuj stworzyć potrzebnego użytkownika \"z powietrza\".",
  "Provoke an error that is neither very gracefully nor consistently handled.": "Sprowokuj błąd, który nie jest ani elegancko, ani konsekwentnie obsługiwany.",
  "Try to submit bad input to forms. Alternatively tamper with URL paths or parameters.": "Spróbuj przesłać nieprawidłowe dane wejściowe do formularzy. Alternatywnie manipuluj ścieżkami URL lub parametrami.",
  "Successfully redeem an expired campaign coupon code.": "Pomyślnie zrealizuj wygasły kod kuponu na kampanię.",
  "Try to identify past special event or holiday campaigns of the shop first.": "Spróbuj najpierw zidentyfikować poprzednie specjalne wydarzenia lub kampanie świąteczne sklepu.",
  "First you should find out how the languages are technically changed in the user interface.": "Najpierw powinieneś dowiedzieć się, w jaki sposób języki są technicznie zmieniane w interfejsie użytkownika.",
  "Brute force is not the only option for this challenge, but a perfectly viable one.": "Atak typu brute force nie jest jedyną opcją dla tego wyzwania, ale całkowicie wykonalną.",
  "Get rid of all 5-star customer feedback.": "Pozbądź się wszystkich 5-gwiazdkowych opinii klientów.",
  "Once you found admin section of the application, this challenge is almost trivial.": "Gdy znajdziesz już sekcję administracyjną aplikacji, to wyzwanie staje się prawie trywialne.",
  "Forge a coupon code that gives you a discount of at least 80%.": "Sfałszuj kod kuponu, aby dawał ci zniżkę w wysokości co najmniej 80%.",
  "Try either a) a knowledgeable brute force attack or b) reverse engineering or c) some research in the cloud.": "Wypróbuj a) świadomy atak typu brute force lub b) inżynierię odwrotną lub c) poszukać informacji w chmurze.",
  "Post some feedback in another user's name.": "Opublikuj opinię w imieniu innego użytkownika.",
  "You can solve this by tampering with the user interface or by intercepting the communication with the RESTful backend.": "Możesz rozwiązać ten problem, manipulując interfejsem użytkownika lub przechwytując komunikację z zapleczem RESTful.",
  "Post a product review as another user or edit any user's existing review.": "Opublikuj recenzję produktu jako inny użytkownik lub edytuj istniejącą recenzję dowolnego użytkownika.",
  "Observe the flow of product review posting and editing and see if you can exploit it.": "Obserwuj proces publikowania i edycji recenzji produktów i sprawdź, czy możesz to wykorzystać.",
  "Forge an almost properly RSA-signed JWT token that impersonates the (non-existing) user <i>rsa_lord@juice-sh.op</i>.": "Sfałszuj prawie poprawnie podpisany przez RSA token JWT, który podszywa się pod (nieistniejącego) użytkownika <i>rsa_lord@juice-sh.op</i>.",
  " <em>(This challenge is <strong>potentially harmful</strong> on Windows!)</em>": "<em>(To wyzwanie jest <strong>potencjalnie szkodliwe</strong> w systemie Windows!)</em>",
  "This challenge is explicitly not about acquiring the RSA private key used for JWT signing.": "Wyzwanie to wyraźnie nie polega na nabyciu prywatnego klucza RSA używanego do podpisywania JWT.",
  "Access a developer's forgotten backup file.": "Uzyskaj dostęp do zapomnianego pliku kopii zapasowej programisty.",
  "You need to trick a security mechanism into thinking that the file you want has a valid file type.": "Musisz oszukać mechanizm bezpieczeństwa, aby myślał, że żądany plik ma prawidłowy typ.",
  "Access a salesman's forgotten backup file.": "Uzyskaj dostęp do zapomnianego pliku kopii zapasowej sprzedawcy.",
  "<a href=\"/#/contact\">Inform the shop</a> about a <i>typosquatting</i> imposter that dug itself deep into the frontend. (Mention the exact name of the culprit)": "<a href=\"/#/contact\">Poinformuj sklep o oszustwie typu</a> o <i>typosquatting</i>  które wkopało się głęboko w interfejs. (Wspomnij dokładne imię sprawcy)",
  "This challenge has nothing to do with mistyping web domains. There is no conveniently misplaced file helping you with this one either. Or is there?": "To wyzwanie nie ma nic wspólnego z błędnym wpisywaniem domen internetowych. Nie ma też żadnego pliku, który pomógłby Państwu w tym zadaniu. A może jest?",
  "Log in with Chris' erased user account.": "Zaloguj się za pomocą usuniętego konta użytkownika Chrisa.",
  "Turns out that something is technically and legally wrong with the implementation of the \"right to be forgotten\" for users.": "Okazuje się, że coś jest technicznie i prawnie nie tak z wdrożeniem „prawa do bycia zapomnianym” dla użytkowników.",
  "Steal someone else's personal data without using Injection.": "Ukradnij czyjeś dane osobowe bez użycia wstrzyknięcia.",
  "Trick the regular Data Export to give you more than actually belongs to you.": "Oszukaj zwykły eksport danych, aby dać ci więcej niż faktycznie należy do ciebie.",
  "Perform a <i>persisted</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> through an HTTP header.": "Wykonaj <i>trwały</i> atak XSS z <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> przez nagłówek HTTP.",
  "Finding a piece of displayed information that could originate from an HTTP header is part of this challenge.": "Znalezienie fragmentu wyświetlanej informacji, która może pochodzić z nagłówka HTTP, jest częścią tego wyzwania.",
  "Solve challenge #999. Unfortunately, this challenge does not exist.": "Rozwiąż wyzwanie #999. Niestety to wyzwanie nie istnieje.",
  "You need to trick the hacking progress persistence feature into thinking you solved challenge #999.": "Należy oszukać funkcję utrzymywania postępu hakowania, aby myślała, że rozwiązano wyzwanie #999.",
  "Dumpster dive the Internet for a leaked password and log in to the original user account it belongs to. (Creating a new account with the same password does not qualify as a solution.)": "Przeszukaj internet w poszukiwaniu wyciekłego hasła i zaloguj się na oryginalne konto użytkownika, do którego ono należy. (Utworzenie nowego konta z tym samym hasłem nie kwalifikuje się jako rozwiązanie).",
  "As the challenge name implies, your task is to find some leaked access logs which happen to have a fairly common format.": "Jak wskazuje nazwa wyzwania, twoim zadaniem jest znalezienie wyciekłych logów dostępu, które przypadkowo mają dość powszechny format.",
  "Identify an unsafe product that was removed from the shop and <a href=\"/#/contact\">inform the shop</a> which ingredients are dangerous.": "Zidentyfikuj niebezpieczny produkt, który został usunięty ze sklepu i <a href=\"/#/contact\">poinformuj sklep</a>, które składniki są niebezpieczne.",
  "Your own SQLi and someone else's Ctrl-V will be your accomplices in this challenge!": "Twój własny SQL i czyjeś Ctrl-V będą twoimi wspólnikami w tym wyzwaniu!",
  "<a href=\"/#/contact\">Inform the shop</a> about a <i>typosquatting</i> trick it has been a victim of at least in <code>v6.2.0-SNAPSHOT</code>. (Mention the exact name of the culprit)": "Poinformuj sklep o sztuczce typosquattingu, której padł ofiarą przynajmniej w wersji v6.2.0-SNAPSHOT. (Wspomnij dokładną nazwę sprawcy)",
  "This challenge has nothing to do with mistyping web domains. Investigate the forgotten developer's backup file instead.": "To wyzwanie nie ma nic wspólnego z błędnymi domenami internetowymi. Zbadaj zapomniany plik kopii zapasowej programisty.",
  "Log in with the administrator's user account.": "Zaloguj się za pomocą konta administratora",
  "The challenge description probably gave away what form you should attack.": "Opis wyzwania prawdopodobnie zdradził, jaką formę należy zaatakować.",
  "Log in with Amy's original user credentials. (This could take 93.83 billion trillion trillion centuries to brute force, but luckily she did not read the \"One Important Final Note\")": "Zaloguj się przy użyciu oryginalnych danych użytkownika Amy. (To może zająć 93. 3 miliardy bilionów wieków metodą ataku typu brute force, ale na szczęście nie przeczytała \"Jednej ważnej notatki końcowej\")",
  "This challenge will make you go after a needle in a haystack.": "To wyzwanie sprawi, że pójdziesz za igłą w stogu siana.",
  "Log in with Bender's user account.": "Zaloguj się za pomocą konta użytkownika Bender.",
  "Log in with Bjoern's Gmail account <i>without</i> previously changing his password, applying SQL Injection, or hacking his Google account.": "Zaloguj się na konto Gmail Bjöerna <i>bez</i> wcześniejszej zmiany jego hasła, stosowania wstrzyknięcia SQL ani hakowania jego konta Google.",
  "The security flaw behind this challenge is 100% OWASP Juice Shop's fault and 0% Google's.": "Za tym wyzwaniem kryją się w 100% błędy OWASP Juice Shop i 0% błędów Google.",
  "Log in with Jim's user account.": "Zaloguj się za pomocą konta użytkownika Jima.",
  "Log in with MC SafeSearch's original user credentials without applying SQL Injection or any other bypass.": "Zaloguj się za pomocą oryginalnych poświadczeń użytkownika MC SafeSearch bez stosowania iniekcji SQL lub jakiegokolwiek innego obejścia.",
  "MC SafeSearch is a rapper who produced the song \"Protect Ya' Passwordz\" which explains password & sensitive data protection very nicely.": "MC SafeSearch jest raperem, który wyprodukował piosenkę \"Protect Ya' Passwordz\", która bardzo ładnie wyjaśnia ochronę haseł i wrażliwych danych.",
  "Log in with the support team's original user credentials without applying SQL Injection or any other bypass.": "Zaloguj się przy użyciu oryginalnych danych użytkownika zespołu wsparcia bez stosowania wstrzyknięcia SQL lub innych obejść.",
  "The underlying flaw of this challenge is a lot more human error than technical weakness.": "Podstawową wadą tego wyzwania jest o wiele bardziej błąd ludzki niż słabość techniczna.",
  "Put an additional product into another user's shopping basket.": "Umieść dodatkowy produkt w koszyku innego użytkownika.",
  "Have an eye on the HTTP traffic while placing products in the shopping basket.": "Miej oko na ruch HTTP podczas umieszczania produktów w koszyku.",
  "Access a misplaced <a href=\"https://github.com/Neo23x0/sigma\">SIEM signature</a> file.": "Uzyskaj dostęp do niewłaściwie umieszczonego pliku podpisu SIEM <a href=\"https://github.com/Neo23x0/sigma\">SIEM</a>.",
  "Like any review at least three times as the same user.": "Polub każdą recenzje co najmniej trzy razy jako ten sam użytkownik.",
  "Punctuality is the politeness of kings.": "Punktualność to uprzejmość królów.",
  "Apply some advanced cryptanalysis to find <i>the real</i> easter egg.": "Zastosuj zaawansowaną kryptoanalizę, aby znaleźć <i>prawdziwą</i> pisankę.",
  "You might have to peel through several layers of tough-as-nails encryption for this challenge.": "Być może będziesz musiał przejść przez kilka warstw bardzo trudnego szyfrowania w tym zadaniu.",
  "Let the server sleep for some time. (It has done more than enough hard work for you)": "Pozwól serwerowi spać przez jakiś czas. (Wykonał dla ciebie więcej niż wystarczająco ciężkiej pracy)",
  "This challenge is essentially a stripped-down Denial of Service (DoS) attack.": "To wyzwanie jest zasadniczo uproszczonym atakiem Denial of Service (DoS).",
  "All your orders are belong to us! Even the ones which don't.": "Wszystkie twoje zamówienia należą do nas! Nawet te, które nie należą.",
  "Take a close look on how the $where query operator works in MongoDB.": "Przyjrzyj się bliżej, jak działa operator zapytania $where w MongoDB.",
  "Update multiple product reviews at the same time.": "Aktualizuj wiele recenzji produktów jednocześnie.",
  "Take a close look on how the equivalent of UPDATE-statements in MongoDB work.": "Przyjrzyj się dokładnie, jak działa odpowiednik AKTUALIZACJI w MongoDB.",
  "Let us redirect you to one of our crypto currency addresses which are not promoted any longer.": "Pozwól nam przekierować cię na jeden z naszych adresów kryptowalutowych, które nie są już promowane.",
  "When removing references to those addresses from the code the developers have been a bit sloppy.": "When removing references to those addresses from the code the developers have been a bit sloppy.",
  "Log in with the administrator's user credentials without previously changing them or applying SQL Injection.": "Zaloguj się przy użyciu danych logowania administratora bez wcześniejszej zmiany ich lub zastosowania wstrzyknięcia SQL.",
  "This challenge can be solved with three different approaches.": "This challenge can be solved with three different approaches.",
  "Place an order that makes you rich.": "Złóż zamówienie, które sprawi, że będziesz bogaty.",
  "You literally need to make the shop owe you any amount of money.": "Dosłownie musisz sprawić, by sklep był ci winien jakąkolwiek sumę pieniędzy.",
  "<i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><!--IvLuRfBJYlmStf9XfL6ckJFngyd9LfV1JaaN/KRTPQPidTuJ7FR+D/nkWJUF+0xUF07CeCeqYfxq+OJVVa0gNbqgYkUNvn//UbE7e95C+6e+7GtdpqJ8mqm4WcPvUGIUxmGLTTAC2+G9UuFCD1DUjg==--> <a href=\"https://blockchain.info/address/1AbKfgvw9psQ41NbLi8kufDQTezwG8DRZm\" target=\"_blank\"><i class=\"fab fa-btc fa-sm\"></i> Unlock Premium Challenge</a> to access exclusive content.": "<i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><i class=\"far fa-gem\"></i><!--IvLuRfBJYlmStf9XfL6ckJFngyd9LfV1JaaN/KRTPQPidTuJ7FR+D/nkWJUF+0xUF07CeCeqYfxq+OJVVa0gNbqgYkUNvn//UbE7e95C+6e+7GtdpqJ8mqm4WcPvUGIUxmGLTTAC2+G9UuFCD1DUjg==--> <a href=\"https://blockchain.info/address/1AbKfgvw9psQ41NbLi8kufDQTezwG8DRZm\" target=\"_blank\"><i class=\"fab fa-btc fa-sm\"></i> Odblokuj wyzwanie premium</a> aby uzyskać dostęp do ekskluzywnych treści.",
  "You do not have to pay anything to unlock this challenge! Nonetheless, donations are very much appreciated.": "Nie musisz nic płacić, aby odblokować to wyzwanie! Niemniej jednak darowizny są bardzo doceniane.",
  "Read our privacy policy.": "Przeczytaj naszą politykę prywatności.",
  "We won't even ask you to confirm that you did. Just read it. Please. Pretty please.": "Nie poprosimy cię nawet o potwierdzenie, że to zrobiłeś. Po prostu przeczytaj to. Proszę. Bardzo proszę.",
  "Prove that you actually read our privacy policy.": "Udowodnij, że faktycznie przeczytałeś naszą politykę prywatności.",
  "Only by visiting a special URL you can confirm that you read it carefully.": "Tylko odwiedzając specjalny adres URL możesz potwierdzić, że przeczytałeś go uważnie.",
  "Change the <code>href</code> of the link within the <a href=\"/#/search?q=OWASP SSL Advanced Forensic Tool (O-Saft)\">OWASP SSL Advanced Forensic Tool (O-Saft)</a> product description into <i>https://owasp.slack.com</i>.": "Zmień atrybut <code>href</code> w odnośniku wewnątrz opisu produktu <a href=\"/#/search?q=OWASP SSL Advanced Forensic Tool (O-Saft)\">OWASP SSL zaawansowane narzędzie kryminalistyczne (O-Saft)</a> na <i>https://owasp.slack.com</i>.",
  "Theoretically there are three possible ways to beat this challenge: a) broken admin functionality, b) holes in RESTful API or c) possibility for SQL Injection.": "Teoretycznie istnieją trzy możliwe sposoby pokonania tego wyzwania: a) uszkodzona funkcjonalność administratora, b) luki w RESTful API lub c) możliwość wstrzyknięcia kodu SQL.",
  "Perform a <i>reflected</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code>.": "Wykonaj <i>reflected</i> atak XSS za pomocą <code><iframe src=\"javascript:alert(`xss`)\"&gt;</code>.",
  "Look for a url parameter where its value appears in the page it is leading to.": "Poszukaj parametru URL, w którym jego wartość pojawia się na stronie, do której prowadzi.",
  "Follow the DRY principle while registering a user.": "Podczas rejestracji użytkownika przestrzegaj zasady DRY.",
  "You can solve this by cleverly interacting with the UI or bypassing it altogether.": "Możesz rozwiązać ten problem, sprytnie wchodząc w interakcję z interfejsem użytkownika lub całkowicie go omijając.",
  "Reset Bender's password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "Zresetuj hasło Bendera za pomocą mechanizmu <a href=\"/#/forgot-password\">Zmień hasło</a> z <i>oryginalną odpowiedzią</i> na jego pytanie bezpieczeństwa.",
  "If you have no idea who Bender is, please put down this book right now and watch the first episodes of Futurama before you come back.": "Jeśli nie masz pojęcia, kim jest Bender, odłóż tę książkę natychmiast i obejrzyj pierwsze odcinki Futuramy, zanim do niej wrócisz.",
  "Reset the password of Bjoern's internal account via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "Zresetuj hasło do wewnętrznego konta Bjöerna za pomocą mechanizmu <a href=\"/#/forgot-password\">Zapomniałem hasła</a> z <i>oryginalną odpowiedzią</i> na jego pytanie bezpieczeństwa.",
  "Nothing a little bit of Facebook stalking couldn't reveal. Might involve a historical twist.": "Nic, czego nie ujawniłby mały stalking na Facebooku. Może być związane z historycznym zwrotem akcji.",
  "Reset Jim's password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "Zresetuj hasło Jima za pomocą mechanizmu <a href=\"/#/forgot-password\">Zapomniałem hasła</a> z <i>oryginalną odpowiedzią</i> na jego pytanie bezpieczeństwa.",
  "The hardest part of this challenge is actually to find out who Jim actually is.": "Najtrudniejszą częścią tego wyzwania jest dowiedzieć się, kim tak naprawdę jest Jim.",
  "Reset Morty's password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>his obfuscated answer</i> to his security question.": "Zresetuj hasło Morty'ego za pomocą mechanizmu <a href=\"/#/forgot-password\">Zapomniałem hasła</a> z <i>jego zaciemnioną odpowiedzią</i> na jego pytanie bezpieczeństwa.",
  "Finding out who Morty actually is, will help to reduce the solution space.": "Finding out who Morty actually is, will help to reduce the solution space.",
  "Deprive the shop of earnings by downloading the blueprint for one of its products.": "Pozbaw sklep zysków, pobierając plan jednego z jego produktów.",
  "The product you might want to give a closer look is the OWASP Juice Shop Logo (3D-printed).": "Produkt, któremu możesz chcieć przyjrzeć się bliżej, to logo OWASP Juice Shop (wydruk 3D).",
  "Request a hidden resource on server through server.": "Zażądaj ukrytego zasobu na serwerze za pośrednictwem serwera.",
  "Reverse engineering something bad can make good things happen.": "Inżynieria odwrotna, coś złego może sprawić, że dzieją się dobre rzeczy.",
  "Infect the server with juicy malware by abusing arbitrary command execution.": "Zainfekuj serwer soczystym złośliwym oprogramowaniem nadużywając arbitralnego wykonania poleceń.",
  "\"SSTi\" is a clear indicator that this has nothing to do with anything Angular. Also, make sure to use only our non-malicious malware.": "\"SSTi\" to wyraźna oznaka, że nie ma to nic wspólnego z Angular. Upewnij się, że używasz wyłącznie naszego nieszkodliwego złośliwego oprogramowania.",
  "Behave like any \"white-hat\" should before getting into the action.": "Zachowuj się jak każdy \"biały kapelusz\" powinien, zanim wejdziesz do akcji.",
  "This challenge asks you to act like an ethical hacker.": "This challenge asks you to act like an ethical hacker.",
  "Perform a <i>persisted</i> XSS attack with <code>&lt;iframe src=\"javascript:alert(`xss`)\"&gt;</code> bypassing a <i>server-side</i> security mechanism.": "Wykonaj <i>trwały</i> atak XSS z użyciem &lt;iframe src=\"javascript:alert(\\xss`)\">`, omijając serwerowy mechanizm bezpieczeństwa.",
  "The \"Comment\" field in the \"Customer Feedback\" screen is where you want to put your focus on.": "Pole \"Komentarz\" na ekranie \"Opinie klienta\" jest miejscem na którym chcesz skupić uwagę.",
  "<a href=\"/#/contact\">Rat out</a> a notorious character hiding in plain sight in the shop. (Mention the exact name of the character)": "<a href=\"/#/contact\">Donieś na</a> notorycznego przestępcę ukrywającego się w sklepie. (Wymień dokładne imię tej postaci).",
  "There is not the slightest chance that you can spot the hidden character with the naked eye.": "There is not the slightest chance that you can spot the hidden character with the naked eye.",
  "Perform a Remote Code Execution that occupies the server for a while without using infinite loops.": "Wykonaj zdalne wykonanie kodu, które zajmuje serwer przez jakiś czas bez użycia nieskończonych pętli.",
  "Your attack payload must not trigger the protection against too many iterations and infinite loops.": "Twój ładunek ataku nie może uruchamiać ochrony przed zbyt dużą liczbą iteracji i nieskończonych pętli.",
  "<a href=\"/#/contact\">Inform the development team</a> about a danger to some of <em>their</em> credentials. (Send them the URL of the <em>original report</em> or an assigned CVE or another identifier of this vulnerability)": "<a href=\"/#/contact\">Poinformuj zespół programistów</a> o zagrożeniu dla niektórych <em>ich</em> poświadczeń. (Wyślij im adres URL <em>oryginalnego raportu</em> lub przypisany CVE lub inny identyfikator tej luki w zabezpieczeniach)",
  "This vulnerability will not affect any customer of the shop. It is aimed exclusively at its developers.": "Ta luka nie wpłynie na żadnego klienta sklepu. Jest skierowana wyłącznie do jej programistów.\n",
  "Solve the 2FA challenge for user \"wurstbrot\". (Disabling, bypassing or overwriting his 2FA settings does not count as a solution)": "Rozwiąż wyzwanie 2FA dla użytkownika \"wurstbrot\". (Wyłączenie, ominięcie lub nadpisanie jego ustawień 2FA nie liczy się jako rozwiązanie)",
  "The 2FA implementation requires to store a secret for every user. You will need to find a way to access this secret in order to solve this challenge.": "Wdrożenie 2FA wymaga przechowywania tajemnicy dla każdego użytkownika. Będziesz musiał znaleźć sposób na uzyskanie dostępu do tego sekretu, aby rozwiązać to wyzwanie.",
  "Forge an essentially unsigned JWT token that impersonates the (non-existing) user <i>jwtn3d@juice-sh.op</i>.": "Sfałszuj zasadniczo niepodpisany token JWT, który podszywa się pod (nieistniejący) użytkownik <i>jwtn3d@juice-sh.op</i>.",
  "This challenge exploits a weird option that is supported when signing tokens with JWT.": "To wyzwanie wykorzystuje dziwną opcję, która jest obsługiwana podczas podpisywania tokenów za pomocą JWT.",
  "Upload a file larger than 100 kB.": "Prześlij plik większy niż 100 kB.",
  "You can attach a small file to the \"Complaint\" form. Investigate how this upload actually works.": "Możesz dołączyć mały plik do formularza \"Skarga\". Zbadaj, jak to przesyłanie faktycznie działa.",
  "Upload a file that has no .pdf or .zip extension.": "Prześlij plik, który nie posiada rozszerzenia .pdf lub .zip.",
  "You can attach a PDF or ZIP file to the \"Complaint\" form. Investigate how this upload actually works.": "Możesz dołączyć plik PDF lub ZIP do formularza \"Skarga\". Zbadaj, jak to przesyłanie faktycznie działa.",
  "Retrieve a list of all user credentials via SQL Injection.": "Pobierz listę wszystkich poświadczeń użytkownika za pomocą wstrzyknięcia SQL.",
  "Gather information on where user data is stored and how it is addressed. Then craft a corresponding UNION SELECT attack.": "Zgromadż informacje o tym, gdzie przechowywane są dane użytkownika i jak są one adresowane. Następnie stwórz odpowiedni atak UNION SELECT.",
  "Embed an XSS payload <code>&lt;/script&gt;&lt;script&gt;alert(`xss`)&lt;/script&gt;</code> into our promo video.": "Umieść ładunek XSS <code>&lt;/script&gt;&lt;script&gt;alert(`xss`)&lt;/script&gt;</code> do naszego filmu promocyjnego.",
  "Without utilizing the vulnerability behind another ⭐⭐⭐⭐⭐⭐ challenge it is not possible to plant the XSS payload for this challenge.": "Bez wykorzystania luki w zabezpieczeniach innego wyzwania ⭐⭐⭐⭐⭐⭐ nie jest możliwe umieszczenie ładunku XSS dla tego wyzwania.",
  "View another user's shopping basket.": "Zobacz koszyk innego użytkownika.",
  "Try out all existing functionality involving the shopping basket while having an eye on the HTTP traffic.": "Wypróbuj wszystkie istniejące funkcje związane z koszykiem zakupów, mając oko na ruch HTTP.",
  "<a href=\"/#/contact\">Inform the shop</a> about a vulnerable library it is using. (Mention the exact library name and version in your comment)": "<a href=\"/#/contact\">Poinformuj sklep</a> o wrażliwej bibliotece, z której korzysta. (Wspomnij o dokładnej nazwie biblioteki i wersji w swoim komentarzu)",
  "Report one of two possible answers via the \"Customer Feedback\" form. Do not forget to submit the library's version as well.": "Zgłoś jedną z dwóch możliwych odpowiedzi za pomocą formularza \"Opinie klienta\". Nie zapomnij również przesłać wersji biblioteki.",
  "<a href=\"/#/contact\">Inform the shop</a> about an algorithm or library it should definitely not use the way it does.": "<a href=\"/#/contact\">Poinformuj sklep</a> o algorytmie lub bibliotece, których zdecydowanie nie powinien używać w sposób, w jaki to robi.",
  "Report one of five possible answers via the \"Customer Feedback\" form.": "Report one of five possible answers via the \"Customer Feedback\" form.",
  "Enforce a redirect to a page you are not supposed to redirect to.": "Wymuś przekierowanie do strony, na którą nie powinieneś przekierowywać.",
  "You have to find a way to beat the allowlist of allowed redirect URLs.": "Musisz znaleźć sposób na pokonanie listy dozwolonych adresów URL przekierowań.",
  "Retrieve the content of <code>C:\\Windows\\system.ini</code> or <code>/etc/passwd</code> from the server.": "Pobierz zawartość <code>C:\\Windows\\system.ini</code> lub <code>/etc/passwd</code> z serwera.",
  "The leverage point for this challenge is the deprecated B2B interface.": "Punktem dźwigni dla tego wyzwania jest przestarzały interfejs B2B.",
  "Give the server something to chew on for quite a while.": "Daj serwerowi coś do przeżucia przez dłuższy czas.",
  "It is not as easy as sending a large amount of data directly to the deprecated B2B interface.": "Nie jest to tak proste, jak wysyłanie dużej ilości danych bezpośrednio do przestarzałego interfejsu B2B.",
  "Drop some explosive data into a vulnerable file-handling endpoint.": "Wrzuć trochę wybuchowych danych do podatnego punktu końcowego obsługującego pliki.",
  "This one is actually similar to the XXE DoS challenge in every way except the data format being (ab)used.": "Ten jest w rzeczywistości podobny do wyzwania XXE DoS pod każdym względem, z wyjątkiem formatu danych, który jest (nad)używany.",
  "Give a devastating zero-star feedback to the store.": "Przekaż sklepowi druzgocącą opinię o zerowej gwiazdce.",
  "Before you invest time bypassing the API, you might want to play around with the UI a bit.": "Zanim zainwestujesz czas w ominięcie API, możesz chcieć trochę pobawić się interfejsem użytkownika.",
  "Retrieve the photo of Bjoern's cat in \"melee combat-mode\".": "Pobierz zdjęcie kota Bjöerna w \"trybie walki wręcz\".",
  "Check the Photo Wall for an image that could not be loaded correctly.": "Sprawdź ścianę zdjęć, czy znajduje się na niej obraz, którego nie udało się poprawnie załadować.",
  "Stick <a href=\"https://cataas.com/cat\" target=\"_blank\">cute cross-domain kittens</a> all over our delivery boxes.": "Przyklej <a href=\"https://cataas.com/cat\" target=\"_blank\">urocze kociaki z różnych domen</a> na wszystkie nasze pudełka dostawcze.",
  "This challenge would formally have to be in several categories as the developers made multiple gaffes for this to be possible.": "To wyzwanie formalnie musiałoby być w kilku kategoriach, ponieważ twórcy poczynili wiele gaf, aby było to możliwe.",
  "Find the endpoint that serves usage data to be scraped by a <a href=\"https://github.com/prometheus/prometheus\">popular monitoring system</a>.": "Znajdź punkt końcowy, który obsługuje dane dotyczące użytkowania, które mają zostać zeskrobane przez <a href=\"https://github.com/prometheus/prometheus\">popularny system monitorowania</a>.",
  "Try to guess what URL the endpoint might have.": "Spróbuj odgadnąć jaki adres URL może mieć punkt końcowy.",
  "Obtain a Deluxe Membership without paying for it.": "Uzyskaj członkostwo deluxe bez konieczności płacenia za to.",
  "Look closely at what happens when you attempt to upgrade your account.": "Przyjrzyj się uważnie temu, co się dzieje, gdy próbujesz uaktualnić swoje konto.",
  "Change the name of a user by performing Cross-Site Request Forgery from <a href=\"http://htmledit.squarefree.com\">another origin</a>.": "Zmień nazwę użytkownika, wykonując Cross-Site Request Forgery z <a href=\"http://htmledit.squarefree.com\">innego pochodzenia</a>.",
  "Find a form which updates the username and then construct a malicious page in the online HTML editor. You probably need an older browser version for this.": "Znajdź formularz, który aktualizuje nazwę użytkownika, a następnie zbuduj złośliwą stronę w edytorze HTML online. Prawdopodobnie potrzebujesz do tego starszej wersji przeglądarki.",
  "Use the bonus payload <code>&lt;iframe width=&quot;100%&quot; height=&quot;166&quot; scrolling=&quot;no&quot; frameborder=&quot;no&quot; allow=&quot;autoplay&quot; src=&quot;https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/771984076&amp;color=%23ff5500&amp;auto_play=true&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true&quot;&gt;&lt;/iframe&gt;</code> in the <i>DOM XSS</i> challenge.": "Użyj bonusowego ładunku <code>&lt;iframe width=&quot;100%&quot; height=&quot;166&quot; scrolling=&quot;no&quot; frameborder=&quot;no&quot; allow=&quot;autoplay&quot; src=&quot;https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/771984076&amp;color=%23ff5500&amp;auto_play=true&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true&quot;&gt;&lt;/iframe&gt;</code> w wyzwaniu <i>DOM XSS</i>.",
  "First, solve the \"Perform a DOM XSS attack\" challenge.": "First, solve the \"Perform a DOM XSS attack\" challenge.",
  "Reset Uvogin's password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism with <i>the original answer</i> to his security question.": "Zresetuj hasło Uvogina za pomocą mechanizmu <a href=\"/#/forgot-password\">Forgot Password</a> z <i>oryginalną odpowiedzią</i> na jego pytanie bezpieczeństwa.",
  "You might have to do some OSINT on his social media personas to find out his honest answer to the security question.": "Możesz potrzebować przeprowadzić trochę OSINT-u na jego profilach w mediach społecznościowych, aby znaleźć jego szczerą odpowiedź na pytanie zabezpieczające.",
  "Determine the answer to John's security question by looking at an upload of him to the Photo Wall and use it to reset his password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism.": "Określ odpowiedź na pytanie bezpieczeństwa Johna, patrząc na jego zdjęcie przesłane na ścianę zdjęć i użyj jej do zresetowania hasła za pomocą mechanizmu <a href=\"/#/forgot-password\"> Zapomniane hasło</a>.",
  "Take a look at the meta data of the corresponding photo.": "Spójrz na meta dane odpowiedniego zdjęcia.",
  "Determine the answer to Emma's security question by looking at an upload of her to the Photo Wall and use it to reset her password via the <a href=\"/#/forgot-password\">Forgot Password</a> mechanism.": "Określ odpowiedź na pytanie bezpieczeństwa Emmy, patrząc na jej zdjęcie przesłane na ścianę zdjęć i użycie jej do zresetowania hasła za pomocą mechanizmu <a href=\"/#/forgot-password\">Zapomniane hasło</a>.",
  "Take a look at the details in the photo to determine the location of where it was taken.": "Spójrz na szczegóły na zdjęciu, aby określić lokalizację, w której zostało zrobione.",
  "Permanently disable the support chatbot so that it can no longer answer customer queries.": "Trwale wyłącz chatbota wsparcia, aby nie mógł już odpowiadać na zapytania klientów.",
  "Think of a way to get a hold of the internal workings on the chatbot API.": "Wymyśl sposób na uzyskanie dostępu do wewnętrznego działania API chatbota.",
  "Bypass a security control with a <a href=\"https://hakipedia.com/index.php/Poison_Null_Byte\">Poison Null Byte</a> to access a file not meant for your eyes.": "Omiń kontrolę bezpieczeństwa za pomocą <a href=\"https://hakipedia.com/index.php/Poison_Null_Byte\">Poison Null Byte</a>, aby uzyskać dostęp do pliku nie przeznaczonego dla twoich oczu.",
  "Analyze and tamper with links in the application until you get to an unprotected directory listing.": "Analyze and tamper with links in the application until you get to an unprotected directory listing.",
  "Receive a coupon code from the support chatbot.": "Otrzymaj kod kuponu od chatbota wsparcia.",
  "The bot is reluctant to give you a coupon as it’s coming up with various excuses for not giving you one.": "The bot is reluctant to give you a coupon as it’s coming up with various excuses for not giving you one.",
  "Gain read access to an arbitrary local file on the web server.": "Uzyskaj dostęp do dowolnego pliku lokalnego na serwerze.",
  "You should read up on vulnerabilities in popular NodeJs template engines.": "Powinieneś przeczytać o lukach w popularnych silnikach szablonów NodeJs.",
  "Close multiple \"Challenge solved\"-notifications in one go.": "Zamknij wiele powiadomień \"Wyzwanie rozwiązane\" za jednym razem.",
  "Either check the official documentation or inspect a notification UI element directly.": "Sprawdź oficjalną dokumentację lub sprawdź bezpośrednio element interfejsu powiadomień użytkownika.",
  "The Juice Shop is susceptible to a known vulnerability in a library, for which an advisory has already been issued, marking the Juice Shop as <i>known affected</i>. A fix is still pending. <a href=\"/#/contact\">Inform the shop</a> about a suitable checksum as proof that you did your due diligence.": "Juice Shop jest podatny na znaną lukę w jednej z bibliotek, dla której wydano już ostrzeżenie, oznaczając Juice Shop jako <i>znany jako podatny</i>. Poprawka jest nadal w trakcie przygotowywania. <a href=\"/#/contact\">Poinformuj sklep</a> o odpowiedniej sumie kontrolnej jako dowód, że dołożyłeś należytej staranności.",
  "Security Advisories are often listed in the security.txt": "Porady dotyczące bezpieczeństwa są często wymienione w security.txt",
  "A developer was careless with hardcoding unused, but still valid credentials for a testing account on the client-side.": "Programista nie zachował należytej ostrożności, zapisując na stałe nieużywane, ale nadal ważne dane uwierzytelniające dla konta testowego po stronie klienta.",
  "Have a look at the client-side code in the dev console.": "Spójrz na kod po stronie klienta w konsoli deweloperskiej.",
  "<a href=\"/#/contact\">Inform the shop</a> about a leaked API key. (Mention the exact key in your comment)": "<a href=\"/#/contact\">Poinformuj sklep</a> o wycieku klucza API. (Wspomnij dokładny klucz w swoim komentarzu)",
  "The API call is part of a scheduled process \"behind the scenes\", i.e. completely unrelated to the web application.": "Wywołanie API jest częścią zaplanowanego procesu \"w tle\", czyli całkowicie niezwiązanego z aplikacją internetową.",
  "A matrix of known data entities and their supported HTTP verbs through the API can help you here.": "A matrix of known data entities and their supported HTTP verbs through the API can help you here.",
  "Careless developers might have exposed API methods that the client does not even need.": "Nieostrożni programiści mogli udostępnić metody API, których klient w ogóle nie potrzebuje.",
  "Normally, server log files are written to disk on server side and are not accessible from the outside.": "",
  "Which raises the question: Who would want a server access log to be accessible through a web application?": "Which raises the question: Who would want a server access log to be accessible through a web application?",
  "One particular file found in the folder you might already have found during the \"Access a confidential document\" challenge might give you an idea who is interested in such a public exposure.": "One particular file found in the folder you might already have found during the \"Access a confidential document\" challenge might give you an idea who is interested in such a public exposure.",
  "Drilling down one level into the file system might not be sufficient.": "Drilling down one level into the file system might not be sufficient.",
  "Register as an ordinary user to learn what API endpoints are involved in this use case.": "Register as an ordinary user to learn what API endpoints are involved in this use case.",
  "Think of the simplest possible implementations of a distinction between regular users and administrators.": "Think of the simplest possible implementations of a distinction between regular users and administrators.",
  "Knowing it exists, you can simply guess what URL the admin section might have.": "Knowing it exists, you can simply guess what URL the admin section might have.",
  "Alternatively, you can try to find a reference or clue within the parts of the application that are not usually visible in the browser.": "Alternatively, you can try to find a reference or clue within the parts of the application that are not usually visible in the browser.",
  "It is probably just slightly harder to find and gain access to than the score board link.": "It is probably just slightly harder to find and gain access to than the score board link.",
  "There is some access control in place, but there are at least three ways to bypass it.": "There is some access control in place, but there are at least three ways to bypass it.",
  "Find all places in the application where file uploads are possible.": "Find all places in the application where file uploads are possible.",
  "For at least one of these, the Juice Shop is depending on a library that suffers from an arbitrary file overwrite vulnerability.": "For at least one of these, the Juice Shop is depending on a library that suffers from an arbitrary file overwrite vulnerability.",
  "You can find a hint toward the underlying vulnerability in the @owasp_juiceshop Twitter timeline.": "You can find a hint toward the underlying vulnerability in the @owasp_juiceshop Twitter timeline.",
  "More precisely, Bjoern might have accidentally (?) doxxed himself by mentioning his security answer on at least one occasion where a camera was running.": "More precisely, Bjoern might have accidentally (?) doxxed himself by mentioning his security answer on at least one occasion where a camera was running.",
  "Brute forcing the answer might be very well possible with a sufficiently extensive list of common pet names.": "Brute forcing the answer might be very well possible with a sufficiently extensive list of common pet names.",
  "Guessing or brute forcing the URL of the token sale page is very unlikely to succeed.": "Guessing or brute forcing the URL of the token sale page is very unlikely to succeed.",
  "You should closely investigate the place where all paths within the application are defined.": "You should closely investigate the place where all paths within the application are defined.",
  "Beating the employed obfuscation mechanism manually will take some time. Maybe there is an easier way to undo it?": "Beating the employed obfuscation mechanism manually will take some time. Maybe there is an easier way to undo it?",
  "As the Juice Shop is written in pure Javascript, there is one data format that is most probably used for serialization.": "As the Juice Shop is written in pure Javascript, there is one data format that is most probably used for serialization.",
  "You should try to make the server busy for all eternity.": "You should try to make the server busy for all eternity.",
  "The challenge will be solved if you manage to trigger the protection of the application against a very specific DoS attack vector.": "The challenge will be solved if you manage to trigger the protection of the application against a very specific DoS attack vector.",
  "Similar to the \"Let the server sleep for some time\" challenge (which accepted nothing but NoSQL Injection as a solution) this challenge will only accept proper RCE as a solution. It cannot be solved by simply hammering the server with requests. That would probably just kill your server instance.": "Similar to the \"Let the server sleep for some time\" challenge (which accepted nothing but NoSQL Injection as a solution) this challenge will only accept proper RCE as a solution. It cannot be solved by simply hammering the server with requests. That would probably just kill your server instance.",
  "You could prepare 10 browser tabs, solving every CAPTCHA and filling out the each feedback form. Then you’d need to very quickly switch through the tabs and submit the forms in under 20 seconds total.": "You could prepare 10 browser tabs, solving every CAPTCHA and filling out the each feedback form. Then you’d need to very quickly switch through the tabs and submit the forms in under 20 seconds total.",
  "Should the Juice Shop ever decide to change the challenge into \"Submit 100 or more customer feedbacks within 60 seconds\" or worse, you’d probably have a hard time keeping up with any tab-switching approach.": "Should the Juice Shop ever decide to change the challenge into \"Submit 100 or more customer feedbacks within 60 seconds\" or worse, you’d probably have a hard time keeping up with any tab-switching approach.",
  "Investigate closely how the CAPTCHA mechanism works and try to find either a bypass or some automated way of solving it dynamically.": "Investigate closely how the CAPTCHA mechanism works and try to find either a bypass or some automated way of solving it dynamically.",
  "Wrap this into a script (in whatever programming language you prefer) that repeats this 10 times.": "Wrap this into a script (in whatever programming language you prefer) that repeats this 10 times.",
  "It might also have been put into the Improper Input Validation category.": "It might also have been put into the Improper Input Validation category.",
  "Bender’s current password is so strong that brute force, rainbow table or guessing attacks will probably not work.": "Bender’s current password is so strong that brute force, rainbow table or guessing attacks will probably not work.",
  "Find out how the application hides deleted products from its customers.": "Find out how the application hides deleted products from its customers.",
  "Try to craft an attack string that makes deleted products visible again.": "Try to craft an attack string that makes deleted products visible again.",
  "You need to get the deleted product into your shopping cart and trigger the Checkout.": "You need to get the deleted product into your shopping cart and trigger the Checkout.",
  "Neither of the above can be achieved through the application frontend and it might even require (half-)Blind SQL Injection.": "Neither of the above can be achieved through the application frontend and it might even require (half-)Blind SQL Injection.",
  "Find a screen in the application that looks subtly odd and dated compared with all other screens.": "Find a screen in the application that looks subtly odd and dated compared with all other screens.",
  "Before trying any XSS attacks, you should understand how the page is setting its Content Security Policy.": "Before trying any XSS attacks, you should understand how the page is setting its Content Security Policy.",
  "For the subsequent XSS, make good use of the flaws in the homegrown sanitization based on a RegEx!": "For the subsequent XSS, make good use of the flaws in the homegrown sanitization based on a RegEx!",
  "Even less of these fields are persisted in a way where their content is shown on another screen.": "Even less of these fields are persisted in a way where their content is shown on another screen.",
  "Bypassing client-side security can typically be done by either disabling it on the client (i.e. in the browser by manipulating the DOM tree) or by ignoring it completely and interacting with the backend instead.": "Bypassing client-side security can typically be done by either disabling it on the client (i.e. in the browser by manipulating the DOM tree) or by ignoring it completely and interacting with the backend instead.",
  "The file you are looking for is not protected in any way. Once you found it you can also access it.": "The file you are looking for is not protected in any way. Once you found it you can also access it.",
  "This challenge is almost indistinguishable from \"Perform a reflected XSS attack\" if you do not look \"under the hood\" to find out what the application actually does with the user input.": "This challenge is almost indistinguishable from \"Perform a reflected XSS attack\" if you do not look \"under the hood\" to find out what the application actually does with the user input.",
  "Find out which database system is in use and where it would usually store its schema definitions.": "Find out which database system is in use and where it would usually store its schema definitions.",
  "Craft a UNION SELECT attack string to join the relevant data from any such identified system table into the original result.": "Craft a UNION SELECT attack string to join the relevant data from any such identified system table into the original result.",
  "You might have to tackle some query syntax issues step-by-step, basically hopping from one error to the next.": "You might have to tackle some query syntax issues step-by-step, basically hopping from one error to the next.",
  "As with \"Order the Christmas special offer of 2014\" this cannot be achieved through the application frontend.": "As with \"Order the Christmas special offer of 2014\" this cannot be achieved through the application frontend.",
  "The old B2B interface was replaced with a more modern version recently.": "The old B2B interface was replaced with a more modern version recently.",
  "When deprecating the old interface, not all of its parts were cleanly removed from the code base.": "When deprecating the old interface, not all of its parts were cleanly removed from the code base.",
  "Simply using the deprecated interface suffices to solve this challenge. No attack or exploit is necessary.": "Simply using the deprecated interface suffices to solve this challenge. No attack or exploit is necessary.",
  "Simply reuse the trick that already worked for the files above.": "Simply reuse the trick that already worked for the files above.",
  "What ways are there to access data from a web application cross-domain?": "What ways are there to access data from a web application cross-domain?",
  "This challenge uses an old way which is no longer recommended.": "This challenge uses an old way which is no longer recommended.",
  "The user literally needs to be ephemeral as in \"lasting for only a short time\".": "The user literally needs to be ephemeral as in \"lasting for only a short time\".",
  "Registering normally with the user’s email address will then obviously not solve this challenge. The Juice Shop will not even let you register as acc0unt4nt@juice-sh.op, as this would make the challenge unsolvable for you.": "Registering normally with the user’s email address will then obviously not solve this challenge. The Juice Shop will not even let you register as acc0unt4nt@juice-sh.op, as this would make the challenge unsolvable for you.",
  "Getting the user into the database some other way will also fail to solve this challenge. In case you somehow managed to do so, you need to restart the Juice Shop application in order to wipe the database and make the challenge solvable again.": "Getting the user into the database some other way will also fail to solve this challenge. In case you somehow managed to do so, you need to restart the Juice Shop application in order to wipe the database and make the challenge solvable again.",
  "The fact that this challenge is in the Injection category should already give away the intended approach.": "The fact that this challenge is in the Injection category should already give away the intended approach.",
  "This challenge actually triggers from various possible error conditions.": "This challenge actually triggers from various possible error conditions.",
  "You can try to submit bad input to forms to provoke an improper error handling.": "You can try to submit bad input to forms to provoke an improper error handling.",
  "Tampering with URL paths or parameters might also trigger an unforeseen error.": "Tampering with URL paths or parameters might also trigger an unforeseen error.",
  "Look for clues about the past campaign or holiday event somewhere in the application.": "Look for clues about the past campaign or holiday event somewhere in the application.",
  "Solving this challenge does not require actual time traveling.": "Solving this challenge does not require actual time traveling.",
  "Guessing will most definitely not work in this challenge.": "Guessing will most definitely not work in this challenge.",
  "Investigate online what languages are actually available.": "Investigate online what languages are actually available.",
  "Nothing happens when you try to delete feedback entries? Check the JavaScript console for errors!": "Nothing happens when you try to delete feedback entries? Check the JavaScript console for errors!",
  "One viable solution would be to reverse-engineer how coupon codes are generated and craft your own 80% coupon by using the same (or at least similar) implementation.": "One viable solution would be to reverse-engineer how coupon codes are generated and craft your own 80% coupon by using the same (or at least similar) implementation.",
  "Another possible solution might be harvesting as many previous coupon as possible and look for patterns that might give you a leverage for a brute force attack.": "Another possible solution might be harvesting as many previous coupon as possible and look for patterns that might give you a leverage for a brute force attack.",
  "If all else fails, you could still try to blindly brute force the coupon code field before checkout.": "If all else fails, you could still try to blindly brute force the coupon code field before checkout.",
  "To find the client-side leverage point, closely analyze the HTML form used for feedback submission.": "To find the client-side leverage point, closely analyze the HTML form used for feedback submission.",
  "The backend-side leverage point is similar to some of the XSS challenges found in OWASP Juice Shop.": "The backend-side leverage point is similar to some of the XSS challenges found in OWASP Juice Shop.",
  "This challenge can be solved by using developers tool of your browser or with tools like postman.": "This challenge can be solved by using developers tool of your browser or with tools like postman.",
  "Analyze the form used for review submission and try to find a leverage point.": "Analyze the form used for review submission and try to find a leverage point.",
  "This challenge is pretty similar to \"Post some feedback in another user’s name\" challenge.": "This challenge is pretty similar to \"Post some feedback in another user’s name\" challenge.",
  "The three generic hints from Forge an essentially unsigned JWT token also help with this challenge.": "The three generic hints from Forge an essentially unsigned JWT token also help with this challenge.",
  "Instead of enforcing no encryption to be applied, try to apply a more sophisticated exploit against the JWT libraries used in the Juice Shop.": "Instead of enforcing no encryption to be applied, try to apply a more sophisticated exploit against the JWT libraries used in the Juice Shop.",
  "Getting your hands on the public RSA key the application employs for its JWTs is mandatory for this challenge.": "Getting your hands on the public RSA key the application employs for its JWTs is mandatory for this challenge.",
  "Finding the corresponding private key should actually be impossible, but that obviously doesn’t make this challenge unsolvable.": "Finding the corresponding private key should actually be impossible, but that obviously doesn’t make this challenge unsolvable.",
  "Make sure your JWT is URL safe!": "Make sure your JWT is URL safe!",
  "The file is not directly accessible because a security mechanism prevents access to it.": "The file is not directly accessible because a security mechanism prevents access to it.",
  "You need to trick the security mechanism into thinking that the file has a valid file type.": "You need to trick the security mechanism into thinking that the file has a valid file type.",
  "For this challenge there is only one approach to pull this trick.": "For this challenge there is only one approach to pull this trick.",
  "This challenge has nothing to do with URLs or domains.": "This challenge has nothing to do with URLs or domains.",
  "Other than for its legacy companion, combing through the package.json.bak does not help for this challenge.": "Other than for its legacy companion, combing through the package.json.bak does not help for this challenge.",
  "Trying out the Request Data Erasure functionality might be interesting, but cannot help you solve this challenge in real time.": "Trying out the Request Data Erasure functionality might be interesting, but cannot help you solve this challenge in real time.",
  "If you have solved the challenge Retrieve a list of all user credentials via SQL Injection you might have already retrieved some information about how the Juice Shop \"deletes\" users upon their request.": "If you have solved the challenge Retrieve a list of all user credentials via SQL Injection you might have already retrieved some information about how the Juice Shop \"deletes\" users upon their request.",
  "What the Juice Shop does here is totally incompliant with GDPR. Luckily a 4% fine on a gross income of 0$ is still 0$.": "What the Juice Shop does here is totally incompliant with GDPR. Luckily a 4% fine on a gross income of 0$ is still 0$.",
  "You should not try to steal data from a \"vanilla\" user who never even ordered something at the shop.": "You should not try to steal data from a \"vanilla\" user who never even ordered something at the shop.",
  "As everything about this data export functionality happens on the server-side, it won’t be possible to just tamper with some HTTP requests to solve this challenge.": "As everything about this data export functionality happens on the server-side, it won’t be possible to just tamper with some HTTP requests to solve this challenge.",
  "Inspecting various server responses which contain user-specific data might give you a clue about the mistake the developers made.": "Inspecting various server responses which contain user-specific data might give you a clue about the mistake the developers made.",
  "You might have to look into less common or even proprietary HTTP headers to find the leverage point.": "You might have to look into less common or even proprietary HTTP headers to find the leverage point.",
  "Adding insult to injury, the HTTP header you need will never be sent by the application on its own.": "Adding insult to injury, the HTTP header you need will never be sent by the application on its own.",
  "Find out how saving and restoring progress is done behind the scenes.": "Find out how saving and restoring progress is done behind the scenes.",
  "Deduce from all available information (e.g. the package.json.bak) how the application encrypts and decrypts your hacking progress.": "Deduce from all available information (e.g. the package.json.bak) how the application encrypts and decrypts your hacking progress.",
  "Other than the user’s passwords, the hacking progress involves an additional secret during its encryption.": "Other than the user’s passwords, the hacking progress involves an additional secret during its encryption.",
  "What would be a really stupid mistake a developer might make when choosing such a secret?": "What would be a really stupid mistake a developer might make when choosing such a secret?",
  "A very popular help platform for developers might contain breadcrumbs towards solving this challenge.": "A very popular help platform for developers might contain breadcrumbs towards solving this challenge.",
  "The actual log file was copied & paste onto a platform often used to share data quickly with externals or even just internal peers.": "The actual log file was copied & paste onto a platform often used to share data quickly with externals or even just internal peers.",
  "Once you found and harvested the important piece of information from the log, you could employ a technique called Password Spraying to solve this challenge.": "Once you found and harvested the important piece of information from the log, you could employ a technique called Password Spraying to solve this challenge.",
  "You must first identify the \"unsafe product\" which ist not available any more in the shop.": "You must first identify the \"unsafe product\" which ist not available any more in the shop.",
  "Solving the \"Order the Christmas special offer of 2014\" challenge might give it to you as by-catch.": "Solving the \"Order the Christmas special offer of 2014\" challenge might give it to you as by-catch.",
  "The actual data you need to solve this challenge was leaked on the same platform that was involved in the \"Dumpster dive the Internet for a leaked password and log in to the original user account it belongs to\" challenge.": "The actual data you need to solve this challenge was leaked on the same platform that was involved in the \"Dumpster dive the Internet for a leaked password and log in to the original user account it belongs to\" challenge.",
  "Google is a particularly good accomplice in this challenge.": "Google is a particularly good accomplice in this challenge.",
  "Investigating the forgotten developer’s backup file might bring some insight.": "Investigating the forgotten developer’s backup file might bring some insight.",
  "\"Malicious packages in npm\" is a worthwhile read on Ivan Akulov’s blog.": "\"Malicious packages in npm\" is a worthwhile read on Ivan Akulov’s blog.",
  "If you happen to know the email address of the admin already, you can launch a targeted attack.": "If you happen to know the email address of the admin already, you can launch a targeted attack.",
  "You might be lucky with a dedicated attack pattern even if you have no clue about the admin email address.": "You might be lucky with a dedicated attack pattern even if you have no clue about the admin email address.",
  "If you harvested the admin’s password hash, you can of course try to attack that instead of using SQL Injection.": "If you harvested the admin’s password hash, you can of course try to attack that instead of using SQL Injection.",
  "Alternatively you can solve this challenge as a combo with the Log in with the administrator’s user credentials without previously changing them or applying SQL Injection challenge.": "Alternatively you can solve this challenge as a combo with the Log in with the administrator’s user credentials without previously changing them or applying SQL Injection challenge.",
  "As with so many other characters from Futurama this challenge is of course about logging in as Amy from that show.": "As with so many other characters from Futurama this challenge is of course about logging in as Amy from that show.",
  "Did you know that Amy is married to an alien named Kif?": "Did you know that Amy is married to an alien named Kif?",
  "The challenge description contains a few sentences which give away some information how Amy decided to strengthen her password.": "The challenge description contains a few sentences which give away some information how Amy decided to strengthen her password.",
  "Obviously, Amy - being a little dimwitted - did not put nearly enough effort and creativity into the password selection process.": "Obviously, Amy - being a little dimwitted - did not put nearly enough effort and creativity into the password selection process.",
  "You need to know (or smart-guess) Bender’s email address so you can launch a targeted attack.": "You need to know (or smart-guess) Bender’s email address so you can launch a targeted attack.",
  "Bender's password hash might not help you very much.": "Bender's password hash might not help you very much.",
  "In case you try some other approach than SQL Injection, you will notice that Bender’s password hash is not very useful.": "In case you try some other approach than SQL Injection, you will notice that Bender’s password hash is not very useful.",
  "One way to light up this challenge in green on the score board, is to be Bjoern Kimminich. In that case, just log in with your Google account to automatically solve this challenge! Congratulations!": "One way to light up this challenge in green on the score board, is to be Bjoern Kimminich. In that case, just log in with your Google account to automatically solve this challenge! Congratulations!",
  "Most likely you are not Bjoern Kimminich, so instead you might want to take detailed look into how the OAuth login with Google is implemented.": "Most likely you are not Bjoern Kimminich, so instead you might want to take detailed look into how the OAuth login with Google is implemented.",
  "It could bring you some insight to register with your own Google account and analyze closely what happens behind the scenes.": "It could bring you some insight to register with your own Google account and analyze closely what happens behind the scenes.",
  "You need to know (or smart-guess) Jim’s email address so you can launch a targeted attack.": "You need to know (or smart-guess) Jim’s email address so you can launch a targeted attack.",
  "If you harvested Jim’s password hash, you can try to attack that instead of using SQL Injection.": "If you harvested Jim’s password hash, you can try to attack that instead of using SQL Injection.",
  "After watching the music video of this song, you should agree that even ⭐⭐ is a slightly exaggerated difficulty rating for this challenge.": "After watching the music video of this song, you should agree that even ⭐⭐ is a slightly exaggerated difficulty rating for this challenge.",
  "The support team is located in a low-cost country and the team structure fluctuates a lot due to people leaving for jobs with even just slightly better wages.": "The support team is located in a low-cost country and the team structure fluctuates a lot due to people leaving for jobs with even just slightly better wages.",
  "To prevent abuse the password for the support team account itself is actually very strong.": "To prevent abuse the password for the support team account itself is actually very strong.",
  "To allow easy access during an incident, the support team utilizes a 3rd party tool which every support engineer can access to get the current account password from.": "To allow easy access during an incident, the support team utilizes a 3rd party tool which every support engineer can access to get the current account password from.",
  "While it is also possible to use SQL Injection to log in as the support team, this will not solve the challenge.": "While it is also possible to use SQL Injection to log in as the support team, this will not solve the challenge.",
  "Adding more instances of the same product to someone else’s basket does not qualify as a solution. The same goes for stealing from someone else’s basket.": "Adding more instances of the same product to someone else’s basket does not qualify as a solution. The same goes for stealing from someone else’s basket.",
  "This challenge requires a bit more sophisticated tampering than others of the same ilk.": "This challenge requires a bit more sophisticated tampering than others of the same ilk.",
  "If you solved one of the other four file access challenges, you already know where the SIEM signature file is located.": "If you solved one of the other four file access challenges, you already know where the SIEM signature file is located.",
  "Every user is (almost) immediately associated with the review they \"liked\" to prevent abuse of that functionality.": "Every user is (almost) immediately associated with the review they \"liked\" to prevent abuse of that functionality.",
  "Did you really think clicking the \"like\" button three times in a row really fast would be enough to solve a ⭐⭐⭐⭐⭐⭐ challenge?": "Did you really think clicking the \"like\" button three times in a row really fast would be enough to solve a ⭐⭐⭐⭐⭐⭐ challenge?",
  "The underlying flaw of this challenge is a Race Condition.": "The underlying flaw of this challenge is a Race Condition.",
  "Make sure you solve Find the hidden easter egg first.": "Make sure you solve Find the hidden easter egg first.",
  "As stated in the Architecture overview, OWASP Juice Shop uses a MongoDB derivate as its NoSQL database.": "As stated in the Architecture overview, OWASP Juice Shop uses a MongoDB derivate as its NoSQL database.",
  "The categorization into the NoSQL Injection category totally gives away the expected attack vector for this challenge. Trying any others will not solve the challenge, even if they might yield the same result.": "The categorization into the NoSQL Injection category totally gives away the expected attack vector for this challenge. Trying any others will not solve the challenge, even if they might yield the same result.",
  "In particular, flooding the application with requests will not solve this challenge. That would probably just kill your server instance.": "In particular, flooding the application with requests will not solve this challenge. That would probably just kill your server instance.",
  "This challenge requires a classic Injection attack.": "This challenge requires a classic Injection attack.",
  "Find an API endpoint with the intent of delivering a single order to the user and work with that.": "Find an API endpoint with the intent of delivering a single order to the user and work with that.",
  "Reading up on how MongoDB queries work is really helpful here.": "Reading up on how MongoDB queries work is really helpful here.",
  "This challenge requires another classic Injection attack.": "This challenge requires another classic Injection attack.",
  "It is also worth looking into how Query Operators work in MongoDB.": "It is also worth looking into how Query Operators work in MongoDB.",
  "More particular, they have been sloppy in a way that even the Angular Compiler was not able to clean up after them automatically.": "More particular, they have been sloppy in a way that even the Angular Compiler was not able to clean up after them automatically.",
  "It is of course not sufficient to just visit any of the crypto currency links directly to solve the challenge.": "It is of course not sufficient to just visit any of the crypto currency links directly to solve the challenge.",
  "Guessing might work just fine.": "Guessing might work just fine.",
  "If you harvested the admin’s password hash, you can try to attack that.": "If you harvested the admin’s password hash, you can try to attack that.",
  "In case you use some hacker tool, you can also go for a brute force attack using a generic password list.": "In case you use some hacker tool, you can also go for a brute force attack using a generic password list.",
  "Investigate the shopping basket closely to understand how it prevents you from creating orders that would fulfil the challenge.": "Investigate the shopping basket closely to understand how it prevents you from creating orders that would fulfil the challenge.",
  "There is no inappropriate, self-written or misconfigured cryptographic library to be exploited here.": "There is no inappropriate, self-written or misconfigured cryptographic library to be exploited here.",
  "How much protection does a sturdy top-quality door lock add to your house if you put the key under the door mat? Or hide the key in the nearby plant pot? Or tape the key to the underside of the mailbox?": "How much protection does a sturdy top-quality door lock add to your house if you put the key under the door mat? Or hide the key in the nearby plant pot? Or tape the key to the underside of the mailbox?",
  "Once more: You do not have to pay anything to unlock this challenge!": "Once more: You do not have to pay anything to unlock this challenge!",
  "When you work with the application you will most likely solve this challenge in the process.": "When you work with the application you will most likely solve this challenge in the process.",
  "Any automated crawling or spidering tool you use might solve this challenge for you.": "Any automated crawling or spidering tool you use might solve this challenge for you.",
  "There is no real hacking involved here.": "There is no real hacking involved here.",
  "First you should obviously solve the \"Read our privacy policy\" challenge.": "First you should obviously solve the \"Read our privacy policy\" challenge.",
  "It is fine to use the mouse cursor to not lose sight of the paragraph you are currently reading.": "It is fine to use the mouse cursor to not lose sight of the paragraph you are currently reading.",
  "If you find some particularly hot sections in the policy you might want to melt them together similar to what you might have already uncovered in Apply some advanced cryptanalysis to find the real easter egg.": "If you find some particularly hot sections in the policy you might want to melt them together similar to what you might have already uncovered in Apply some advanced cryptanalysis to find the real easter egg.",
  "In practice two of these three ways should turn out to be dead ends.": "In practice two of these three ways should turn out to be dead ends.",
  "Try probing for XSS vulnerabilities by submitting text wrapped in an HTML tag which is easy to spot on screen, e.g. <h1> or <strike>.": "Try probing for XSS vulnerabilities by submitting text wrapped in an HTML tag which is easy to spot on screen, e.g. <h1> or <strike>.",
  "The obvious repetition in the User Registration form is the Repeat Password field.": "The obvious repetition in the User Registration form is the Repeat Password field.",
  "Try to register with either an empty or different value in Repeat Password.": "Try to register with either an empty or different value in Repeat Password.",
  "You can solve this challenge by cleverly interacting with the UI or bypassing it altogether.": "You can solve this challenge by cleverly interacting with the UI or bypassing it altogether.",
  "Unexpectedly, Bender also chose to answer his chosen question truthfully.": "Unexpectedly, Bender also chose to answer his chosen question truthfully.",
  "Hints to the answer to Bender’s question can be found in publicly available information on the Internet.": "Hints to the answer to Bender’s question can be found in publicly available information on the Internet.",
  "If a seemingly correct answer is not accepted, you might just need to try some alternative spelling.": "If a seemingly correct answer is not accepted, you might just need to try some alternative spelling.",
  "Brute forcing the answer should be next to impossible.": "Brute forcing the answer should be next to impossible.",
  "Other than with his OWASP account, Bjoern was a bit less careless with his choice of security and answer to his internal account.": "Other than with his OWASP account, Bjoern was a bit less careless with his choice of security and answer to his internal account.",
  "Bjoern chose to answer his chosen question truthfully but tried to make it harder for attackers by applying sort of a historical twist.": "Bjoern chose to answer his chosen question truthfully but tried to make it harder for attackers by applying sort of a historical twist.",
  "Again, hints to the answer to Bjoern’s question can be found by looking him up on the Internet.": "Again, hints to the answer to Bjoern’s question can be found by looking him up on the Internet.",
  "Jim picked one of the worst security questions and chose to answer it truthfully.": "Jim picked one of the worst security questions and chose to answer it truthfully.",
  "As Jim is a celebrity, the answer to his question is quite easy to find in publicly available information on the internet.": "As Jim is a celebrity, the answer to his question is quite easy to find in publicly available information on the internet.",
  "Even brute forcing the answer should be possible with the right kind of word list.": "Even brute forcing the answer should be possible with the right kind of word list.",
  "You can assume that Morty answered his security question truthfully but employed some obfuscation to make it more secure.": "You can assume that Morty answered his security question truthfully but employed some obfuscation to make it more secure.",
  "Morty’s answer is less than 10 characters long and does not include any special characters.": "Morty’s answer is less than 10 characters long and does not include any special characters.",
  "Unfortunately, Forgot your password? is protected by a rate limiting mechanism that prevents brute forcing. You need to beat this somehow.": "Unfortunately, Forgot your password? is protected by a rate limiting mechanism that prevents brute forcing. You need to beat this somehow.",
  "For your inconvenience the blueprint was not misplaced into the same place like so many others forgotten files covered in this chapter.": "For your inconvenience the blueprint was not misplaced into the same place like so many others forgotten files covered in this chapter.",
  "Using whatever you find inside the malware directly will not do you any good.": "Using whatever you find inside the malware directly will not do you any good.",
  "For this to count as an SSRF attack you need to make the Juice Shop server attack itself.": "For this to count as an SSRF attack you need to make the Juice Shop server attack itself.",
  "Do not try to find the source code for the malware on GitHub. Take it apart with classic reverse-engineering techniques instead.": "Do not try to find the source code for the malware on GitHub. Take it apart with classic reverse-engineering techniques instead.",
  "You can find the juicy malware via a very obvious Google search or by stumbling into a very ill-placed quarantine folder with the necessary URLs in it.": "You can find the juicy malware via a very obvious Google search or by stumbling into a very ill-placed quarantine folder with the necessary URLs in it.",
  "Making the server download and execute the malware is key to solving this challenge.": "Making the server download and execute the malware is key to solving this challenge.",
  "For this challenge you do not have to reverse engineer the malware in any way. That will be required later to solve the \"Request a hidden resource on server through server\" challenge.": "For this challenge you do not have to reverse engineer the malware in any way. That will be required later to solve the \"Request a hidden resource on server through server\" challenge.",
  "Undoubtedly you want to read our security policy before conducting any research on our application.": "Bez wątpienia chcesz przeczytać naszą politykę bezpieczeństwa przed przeprowadzeniem jakichkolwiek badań nad naszą aplikacją.",
  "As one of the good guys, would you just start attacking an application without consent of the owner?": "As one of the good guys, would you just start attacking an application without consent of the owner?",
  "You also might want to read the security policy or any bug bounty program that is in place.": "You also might want to read the security policy or any bug bounty program that is in place.",
  "The Comment field in the Contact Us screen is where you want to put your focus on.": "The Comment field in the Contact Us screen is where you want to put your focus on.",
  "The attack payload <iframe src=\"javascript:alert(`xss)\">` will not be rejected by any validator but stripped from the comment before persisting it.": "The attack payload <iframe src=\"javascript:alert(`xss)\">` will not be rejected by any validator but stripped from the comment before persisting it.",
  "Look for possible dependencies related to input processing in the package.json.bak you harvested earlier.": "Look for possible dependencies related to input processing in the package.json.bak you harvested earlier.",
  "If an XSS alert shows up but the challenge does not appear as solved on the Score Board, you might not have managed to put the exact attack string <iframe src=\"javascript:alert(`xss)\">` into the database?": "If an XSS alert shows up but the challenge does not appear as solved on the Score Board, you might not have managed to put the exact attack string <iframe src=\"javascript:alert(`xss)\">` into the database?",
  "You will need very specialized tool assistance for this challenge.": "You will need very specialized tool assistance for this challenge.",
  "The effective difficulty of this challenge depends a lot on what tools you pick to tackle it.": "The effective difficulty of this challenge depends a lot on what tools you pick to tackle it.",
  "This challenge cannot be solved by just reading our \"Lorem Ipsum\"-texts carefully.": "This challenge cannot be solved by just reading our \"Lorem Ipsum\"-texts carefully.",
  "This challenge uses the same leverage point as the \"Perform a Remote Code Execution that would keep a less hardened application busy forever\" challenge.": "This challenge uses the same leverage point as the \"Perform a Remote Code Execution that would keep a less hardened application busy forever\" challenge.",
  "This is a research-heavy challenge which does not involve any actual hacking.": "This is a research-heavy challenge which does not involve any actual hacking.",
  "Solving \"Access a developer's forgotten backup file\" before attempting this challenge will save you from a lot of frustration.": "Solving \"Access a developer's forgotten backup file\" before attempting this challenge will save you from a lot of frustration.",
  "As always, first learn how the feature under attack is used and behaves under normal conditions.": "As always, first learn how the feature under attack is used and behaves under normal conditions.",
  "Make sure you understand how 2FA with TOTP (time-based one-time password) works and which part of it is the critically sensitive one.": "Make sure you understand how 2FA with TOTP (time-based one-time password) works and which part of it is the critically sensitive one.",
  "Solving the challenge \"Retrieve a list of all user credentials via SQL Injection\" before tackling this one will definitely help. But it will not carry you all the way.": "Solving the challenge \"Retrieve a list of all user credentials via SQL Injection\" before tackling this one will definitely help. But it will not carry you all the way.",
  "You should begin with retrieving a valid JWT from the application’s Authorization request header.": "You should begin with retrieving a valid JWT from the application’s Authorization request header.",
  "A JWT is only given to users who have logged in. They have a limited validity, so better do not dawdle.": "A JWT is only given to users who have logged in. They have a limited validity, so better do not dawdle.",
  "Try to convince the site to give you a valid token with the required payload while downgrading to no encryption at all.": "Try to convince the site to give you a valid token with the required payload while downgrading to no encryption at all.",
  "First you should try to understand how the file upload is actually handled on the client and server side.": "First you should try to understand how the file upload is actually handled on the client and server side.",
  "With this understanding you need to find a \"weak spot\" in the right place and have to craft an exploit for it.": "With this understanding you need to find a \"weak spot\" in the right place and have to craft an exploit for it.",
  "If you solved the \"Upload a file larger than 100 kB\" challenge, you should try to apply the same solution here": "If you solved the \"Upload a file larger than 100 kB\" challenge, you should try to apply the same solution here",
  "Try to find an endpoint where you can influence data being retrieved from the server.": "Try to find an endpoint where you can influence data being retrieved from the server.",
  "Craft a UNION SELECT attack string to join data from another table into the original result.": "Craft a UNION SELECT attack string to join data from another table into the original result.",
  "You might have to tackle some query syntax issues step-by-step, basically hopping from one error to the next": "You might have to tackle some query syntax issues step-by-step, basically hopping from one error to the next",
  "As with \"Order the Christmas special offer of 2014\" and \"Exfiltrate the entire DB schema definition via SQL Injection\" this cannot be achieved through the application frontend.": "As with \"Order the Christmas special offer of 2014\" and \"Exfiltrate the entire DB schema definition via SQL Injection\" this cannot be achieved through the application frontend.",
  "The mentioned \"marketing collateral\" might have been publicly advertised by the Juice Shop but is not necessarily part of its sitemap yet.": "The mentioned \"marketing collateral\" might have been publicly advertised by the Juice Shop but is not necessarily part of its sitemap yet.",
  "It might help to perform some online searches for structurally similar web projects once you get stuck.": "It might help to perform some online searches for structurally similar web projects once you get stuck.",
  "This challenge will always partially keep you blindfolded, no matter how hard you do research and analysis.": "This challenge will always partially keep you blindfolded, no matter how hard you do research and analysis.",
  "There might be a client-side association of user to basket that you can try to manipulate.": "There might be a client-side association of user to basket that you can try to manipulate.",
  "In case you manage to update the database via SQL Injection so that a user is linked to another shopping basket, the application will not notice this challenge as solved.": "In case you manage to update the database via SQL Injection so that a user is linked to another shopping basket, the application will not notice this challenge as solved.",
  "Look for possible dependencies related to security in the package.json.bak you probably harvested earlier during the Access a developer’s forgotten backup file challenge.": "Look for possible dependencies related to security in the package.json.bak you probably harvested earlier during the Access a developer’s forgotten backup file challenge.",
  "Do some research on the internet for known security issues in the most suspicious application dependencies.": "Do some research on the internet for known security issues in the most suspicious application dependencies.",
  "Cryptographic functions only used in the \"Apply some advanced cryptanalysis to find the real easter egg\" challenge do not count as they are only a developer’s prank and not a serious security problem.": "Cryptographic functions only used in the \"Apply some advanced cryptanalysis to find the real easter egg\" challenge do not count as they are only a developer’s prank and not a serious security problem.",
  "You can find several places where redirects happen in the OWASP Juice Shop.": "You can find several places where redirects happen in the OWASP Juice Shop.",
  "The application will only allow you to redirect to allowlisted (previously referred to as whitelisted) URLs.": "The application will only allow you to redirect to allowlisted (previously referred to as whitelisted) URLs.",
  "Tampering with the redirect mechanism might give you some valuable information about how it works under to hood.": "Tampering with the redirect mechanism might give you some valuable information about how it works under to hood.",
  "This challenge sounds a lot harder than it actually is, which amplifies how bad the underlying vulnerability is.": "This challenge sounds a lot harder than it actually is, which amplifies how bad the underlying vulnerability is.",
  "Doing some research on typical XEE attack patterns basically gives away the solution for free.": "Doing some research on typical XEE attack patterns basically gives away the solution for free.",
  "The leverage point for this is obviously the same as for the XXE Data Access challenge.": "The leverage point for this is obviously the same as for the XXE Data Access challenge.",
  "You can only solve this challenge by keeping the server busy for >2sec with your attack.": "You can only solve this challenge by keeping the server busy for >2sec with your attack.",
  "The effectiveness of attack payloads for this challenge might depend on the operating system the Juice Shop is running on.": "The effectiveness of attack payloads for this challenge might depend on the operating system the Juice Shop is running on.",
  "You just have to (literally) inspect the problem to understand the basic issue.": "You just have to (literally) inspect the problem to understand the basic issue.",
  "It can also help to try out the Tweet-button of the entry and observe what happens.": "It can also help to try out the Tweet-button of the entry and observe what happens.",
  "Loading this page with an empty browser cache and on a slow (or throttled) connection will give you an idea on what the delivery box image is made of. Of course inspecting the page source will tell you just as much.": "Loading this page with an empty browser cache and on a slow (or throttled) connection will give you an idea on what the delivery box image is made of. Of course inspecting the page source will tell you just as much.",
  "You need to dive deep into the actual Angular code to understand this one.": "You need to dive deep into the actual Angular code to understand this one.",
  "This challenge requires the exploitation of another vulnerability which even has its own two challenges in its very own category": "This challenge requires the exploitation of another vulnerability which even has its own two challenges in its very own category",
  "This challenge can only be solved by strictly using the mentioned \"cross-domain kittens\". No other kittens from anywhere else can solve this challenge.": "This challenge can only be solved by strictly using the mentioned \"cross-domain kittens\". No other kittens from anywhere else can solve this challenge.",
  "The Juice Shop serves its metrics on the default path expected by Prometheus": "The Juice Shop serves its metrics on the default path expected by Prometheus",
  "Guessing the path is probably just as quick as taking the RTFM route via https://prometheus.io/docs/introduction/first_steps": "Guessing the path is probably just as quick as taking the RTFM route via https://prometheus.io/docs/introduction/first_steps",
  "Go to the payment page for a deluxe membership and try paying through different methods.": "Go to the payment page for a deluxe membership and try paying through different methods.",
  "Try inspecting the requests that go out for each of these methods, using the browser’s developer tools.": "Try inspecting the requests that go out for each of these methods, using the browser’s developer tools.",
  "Maybe playing around with the parameters in these requests could reveal something interesting.": "Maybe playing around with the parameters in these requests could reveal something interesting.",
  "Take a look at what happens when you change the username within the profile page.": "Take a look at what happens when you change the username within the profile page.",
  "Search for information about CSRF attacks and look out for examples that can be applied to this challenge.": "Search for information about CSRF attacks and look out for examples that can be applied to this challenge.",
  "Write the code for the CSRF attack within http://htmledit.squarefree.com and verify that it changes your username.": "Write the code for the CSRF attack within http://htmledit.squarefree.com and verify that it changes your username.",
  "Now it is just a question of copying and pasting the payload into the same vulnerable field.": "Now it is just a question of copying and pasting the payload into the same vulnerable field.",
  "Crank up the volume of your computer before submitting the payload! 🔊": "Crank up the volume of your computer before submitting the payload! 🔊",
  "People often reuse aliases online. You might be able to find something by looking online for Uvogin’s name or slight variations of it based on his unique writing habits.": "People often reuse aliases online. You might be able to find something by looking online for Uvogin’s name or slight variations of it based on his unique writing habits.",
  "You might be able to find some existing OSINT tools to help you in this investigation.": "You might be able to find some existing OSINT tools to help you in this investigation.",
  "Make use of tools that can inspect the metadata of images.": "Make use of tools that can inspect the metadata of images.",
  "Use this information to answer the security question of the John, who enjoys hiking in the park.": "Use this information to answer the security question of the John, who enjoys hiking in the park.",
  "In order to disable the chatbot for all users, you must first get an understanding of how it works under the hood.": "In order to disable the chatbot for all users, you must first get an understanding of how it works under the hood.",
  "The chatbot sure offers a lot of functionality. Could it be that juice-shop relies on a third party, possibly open source library for this?": "The chatbot sure offers a lot of functionality. Could it be that juice-shop relies on a third party, possibly open source library for this?",
  "Maybe you can try to gather clues from around juice shop and then go dumpster dive the internet to get a hold of the bot’s source.": "Maybe you can try to gather clues from around juice shop and then go dumpster dive the internet to get a hold of the bot’s source.",
  "Some files in there are not directly accessible because a security mechanism prevents access.": "Some files in there are not directly accessible because a security mechanism prevents access.",
  "The Poison Null Byte can trick the security mechanism into thinking that the file you want has a valid file type.": "The Poison Null Byte can trick the security mechanism into thinking that the file you want has a valid file type.",
  "Depending on the files you try to retrieve you will probably solve \"Access a developer’s forgotten backup file\", \"Access a salesman’s forgotten backup file\", \"Access a misplaced SIEM signature file, or \"Find the hidden easter egg\" along the way.": "Depending on the files you try to retrieve you will probably solve \"Access a developer’s forgotten backup file\", \"Access a salesman’s forgotten backup file\", \"Access a misplaced SIEM signature file, or \"Find the hidden easter egg\" along the way.",
  "Asking over and over again like a little kid might actually help you succeed in this case.": "Asking over and over again like a little kid might actually help you succeed in this case.",
  "No seriously, just keep asking.": "No seriously, just keep asking.",
  "You should read up on Local File Read (LFR) vulnerabilities in popular NodeJS template engines.": "You should read up on Local File Read (LFR) vulnerabilities in popular NodeJS template engines.",
  "Look for an easily forgettable endpoint in Juice Shop to test out the LFR attack.": "Look for an easily forgettable endpoint in Juice Shop to test out the LFR attack.",
  "500 Internal Server Error is always an interesting status code.": "500 Internal Server Error is always an interesting status code.",
  "Fuzzing can also help with this challenge.": "Fuzzing can also help with this challenge.",
  "This challenge is most easily solvable immediately after a server restart.": "This challenge is most easily solvable immediately after a server restart.",
  "Alternatively you can also inspect any \"Challenge solved\"-notification in your browser to understand its convenience feature.": "Alternatively you can also inspect any \"Challenge solved\"-notification in your browser to understand its convenience feature.",
  "Check the Juice Shop’s social media channels for regularly scheduled content being posted, possibly even indicating that it was automatically created.": "Check the Juice Shop’s social media channels for regularly scheduled content being posted, possibly even indicating that it was automatically created.",
  "Find out which part of the content might come from the response of an API call.": "Find out which part of the content might come from the response of an API call.",
  "Find the place where the API call happens — as stated above, it is not in the web application — and then look for the API key itself.": "Find the place where the API call happens — as stated above, it is not in the web application — and then look for the API key itself.",
  "Your eldest siblings middle name?": "Drugie imię twojego najstarszego rodzeństwa?",
  "Mother's maiden name?": "Nazwisko panieńskie matki?",
  "Mother's birth date? (MM/DD/YY)": "Data urodzenia matki? (MM/DD/RR)",
  "Father's birth date? (MM/DD/YY)": "Data urodzenia ojca? (MM/DD/RR)",
  "Maternal grandmother's first name?": "Imię babci ze strony matki?",
  "Paternal grandmother's first name?": "Imię babci ze strony ojca?",
  "Name of your favorite pet?": "Imię twojego ulubionego zwierzęcia?",
  "Last name of dentist when you were a teenager? (Do not include 'Dr.')": "Nazwisko dentysty, kiedy byłeś nastolatkiem? (Nie dołączaj 'Dr.')",
  "Your ZIP/postal code when you were a teenager?": "Twój kod pocztowy kiedy byłeś nastolatkiem?",
  "Company you first work for as an adult?": "Firma, w której po raz pierwszy pracowałeś jako dorosły?",
  "Your favorite book?": "Twoja ulubiona książka?",
  "Your favorite movie?": "Twój ulubiony film?",
  "Number of one of your customer or ID cards?": "Numer jednej z twoich kart klienta lub dowodów tożsamości?",
  "What's your favorite place to go hiking?": "Jakie jest twoje ulubione miejsce na wędrówki?"
}
